[{"id":7,"player_id":1,"quote":"Kangkung dulu naik sekarang dah turun, bila dah turun kenapa tak puji kerajaan?","source":"\u003Cobject type=\"application/x-shockwave-flash\" style=\"width:450px; height:366px;\" data=\"http://www.youtube.com/v/Uwy5MH14i8M?color2=FBE9EC\u0026amp;loop=1\u0026amp;version=3\"\u003E\u003Cbr\u003E        \u003Cparam name=\"movie\" value=\"http://www.youtube.com/v/Uwy5MH14i8M?color2=FBE9EC\u0026amp;loop=1\u0026amp;version=3\" /\u003E\u003Cbr\u003E        \u003Cparam name=\"allowFullScreen\" value=\"true\" /\u003E\u003Cbr\u003E        \u003Cparam name=\"allowscriptaccess\" value=\"always\" /\u003E\u003Cbr\u003E        \u003C/object\u003E\u003Cbr\u003E\u003Cbr\u003EMalaysian Prime Minister Najib Razak has landed himself in the soup after reproaching Malaysians for blaming the government when food prices go up and not being appreciative when food prices drop.\u003Cbr\u003E\u003Cbr\u003EIn a YouTube video that has gone viral, Mr Najib was seen saying in Malay: \"When prices of things go up, everything goes up, including sawi (mustard green) and kangkong (water spinach). There are times when the prices of vegetables go up and down.\u003Cbr\u003E\u003Cbr\u003E\"Today I read in the newspaper that the prices of some things have dropped. The price of kangkong increased before this and now it has gone down,\" he added.\u003Cbr\u003E\u003Cbr\u003E\"When this happens, they don't want to praise the government. But when it rises, they blame the government... This is not fair as it is due to weather conditions.\"\u003Cbr\u003E\u003Cbr\u003EKangkung dulu naik sekarang dah turun, bila dah turun kenapa tak puji kerajaan?","created_at":"2014-04-07T23:35:23.020Z","updated_at":"2014-04-21T23:25:06.862Z","source_url":"http://www.straitstimes.com/breaking-news/se-asia/story/malaysia-netizens-see-red-over-pm-najibs-kangkung-remark-20140114","source_date":"2014-01-14","context":"","view_count":198,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["kangkung","price hikes"]},{"id":176,"player_id":12,"quote":"If the orang asing (foreigners) think we are zalim (cruel), ask them to go back to their own country\"","source":"In reference to the case of police officers making a Chinese woman do squats. Noh Omar told journalists that if foreigners thought our police were cruel, they should leave Malaysia and go back to their own country","created_at":"2014-04-21T09:11:16.722Z","updated_at":"2014-04-21T23:25:00.611Z","source_url":"http://news.bbc.co.uk/2/hi/asia-pacific/4485360.stm","source_date":"1992-12-15","context":"","view_count":14,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Abd Rahman Abu Bakar","tags":["Foreigners","Cruelty","women","BN"]},{"id":99,"player_id":29,"quote":"Malaysians should appreciate that Najib fielded a \"rare species” like me in the elections","source":"It is a proof of Najib’s commitment to transform the political scenario in Malaysia, thinking outside the box. So I am the living proof of that transformation programme,” he claimed proudly, referring to his candidacy as someone not affiliated to any of the BN component parties.\u003Cbr\u003E\u003Cbr\u003EThe syariah lawyer and former defence lawyer for Datuk Seri Anwar Ibrahim is the first person to be running under the flag of “Friends of Barisan Nasional” in the May 5 general elections.\u003Cbr\u003E\u003Cbr\u003EThe decision to field Zulkifli has earned BN much criticism, not just due to his reputation as a Muslim hardliner and his position as vice president of the Malay rights advocacy group Perkasa, but also the recent controversies over his insults against the Hindu community.\u003Cbr\u003E\u003Cbr\u003EIn the interview, Zulkifli said Najib was brave to field a “rare species” like him in the upcoming elections and that Malaysians should appreciate that.","created_at":"2014-04-17T03:48:32.832Z","updated_at":"2014-04-21T23:24:47.789Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/zul-noordin-confident-with-his-image-selangor-bn-sweep/","source_date":"2013-04-21","context":"","view_count":114,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["Najib","GE13","BN"]},{"id":43,"player_id":4,"quote":"The police cannot be everywhere","source":"KUALA LUMPUR, August 16 — Datuk Seri Chua Soi Lek today said it was unfair to rely solely on the police to curb rising crime in shopping complexes.\u003Cbr\u003E\u003Cbr\u003EThe MCA president said today the operators of shopping malls were also responsible for helping to deter crime on their premises by providing adequate and efficient security measures.\u003Cbr\u003E\u003Cbr\u003E“The (mall) management have a duty to strengthen security features. To be fair, we cannot depend solely on police,” Dr Chua told reporters today after MCA’s central committee meeting here.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E“The police cannot be everywhere; there is just no way,” he added.\u003Cbr\u003E\u003Cbr\u003EDr Chua said the committee was concerned about security issues in the country, “especially those of shopping malls”, and have directed Housing and Local Development Minister Datuk Chor Chee Heung to look into shopping arcade by-laws to enforce the use of closed-circuit televisions (CCTVs) in parking lots.\u003Cbr\u003E","created_at":"2014-04-10T05:10:42.954Z","updated_at":"2014-04-21T23:24:38.126Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/help-to-police-own-malls-soi-lek-tells-operators/","source_date":"2012-08-16","context":null,"view_count":15,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":[]},{"id":40,"player_id":4,"quote":"MCA is more multiracial than DAP","source":"DAP will continue to package itself as a multiracial party, but as a matter of fact, MCA is more multiracial than DAP. Why do I say so? Let us use the numbers to prove my point:\u003Cbr\u003E\u003Cbr\u003E1) MCA service centre opens to and serves all rakyat regardless of races.\u003Cbr\u003E\u003Cbr\u003E2) MCA forefathers established KTAR and UTAR so that citizens from all races can apply and study in the institutions.\u003Cbr\u003E\u003Cbr\u003E3) The plans pursued by the new MCA leadership, for example the 1MCA Medical Foundation, 1MCA Education Loan Program, 1MCA Micro Credit Scheme and others benefit all races.\u003Cbr\u003E","created_at":"2014-04-10T05:08:21.189Z","updated_at":"2014-04-21T23:24:16.472Z","source_url":"http://1sya.com/?p=2969","source_date":"2012-10-22","context":null,"view_count":47,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":[]},{"id":154,"player_id":46,"quote":"Hair salon posters are too sexy","source":"KOTA BARU: Hair salon operators here are fuming following verbal warnings from the Kota Baru Municipal Council to remove posters featuring models who did not cover their heads (tutup aurat).\u003Cbr\u003E\u003Cbr\u003EOne salon operator, who only wanted to be known as Ong, said they had been told by enforcement officers that the posters placed in front of their salons were deemed “too sexy”.\u003Cbr\u003E\u003Cbr\u003EOng said she was shocked when five officers turned up at her salon yesterday afternoon to caution her about it.\u003Cbr\u003E\u003Cbr\u003E“However, they did not force us to bring down the posters. All I did was hear them out. But I could not understand why they wanted to do so. It is not stated in our permits.\u003Cbr\u003E\u003Cbr\u003E“I do not intend to take down the posters. They merely show pictures of men and women in different hairstyles. What type of poster is deemed to be decent?” she said in an interview.\u003Cbr\u003E\u003Cbr\u003EOng said this was the first time she experienced council enforcement officers advising her on the matter.\u003Cbr\u003E","created_at":"2014-04-20T06:42:50.977Z","updated_at":"2014-04-21T23:24:15.921Z","source_url":"http://www.thestar.com.my/Opinion/Columnists/Temp/2013/09/27/Salon-owners-fume-over-sexy-poster-warn","source_date":"2013-09-27","context":"","view_count":10,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Parti Islam Se-Malaysia","tags":["Kelantan","PAS","policy fail"]},{"id":91,"player_id":29,"quote":"Allah has killed him for opposing the implementation of Hudud","source":"\u003Ca href=\"http://imgur.com/7Ke47sV\"\u003E\u003Cimg src=\"http://i.imgur.com/7Ke47sV.png\" title=\"Zulfikli Noordin\" width=\"80%\"/\u003E\u003C/a\u003E","created_at":"2014-04-17T03:14:59.542Z","updated_at":"2014-04-21T23:24:12.192Z","source_url":"https://twitter.com/zulkiflinoordin/status/456570866692669442","source_date":"2014-04-16","context":"Karpal Singh's car accident","view_count":43,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["DAP","islam","UMNO","Hudud"]},{"id":137,"player_id":34,"quote":"The tiger is still alive and ... a wounded tiger is even more dangerous.","source":"Karpal in April 1995 after DAP was defeated in Penang. The then-state chairman said the defeat did not mean the end of the opposition in Penang.","created_at":"2014-04-18T19:27:48.825Z","updated_at":"2014-04-21T23:23:58.381Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/18/Dont-play-the-fool-and-other-quotes-by-Karpal-Singh","source_date":"2014-04-19","context":"","view_count":39,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Karpal Singh","tags":[]},{"id":63,"player_id":26,"quote":"My son is not my wife, I don't sleep with him","source":"KUALA LUMPUR, Nov 1 — Datuk Seri Mohamed Nazri Aziz said today he does not see any wrong in his son’s alleged use of a car belonging to Michael Chia, pointing out that Nedim’s relationship with the Sabah timber trader has no connection to his integrity as a Cabinet minister.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E“I don’t sleep with my son. I am not gay (homosexual). My son is not my wife, my son is not my lover. What he does, he doesn’t tell me.\"\u003Cbr\u003E\u003Cbr\u003E“Go ask my son. I cannot be responsible for him... I don’t sleep with him... he sleeps with his wife, he has a kid.\u003Cbr\u003E\u003Cbr\u003E","created_at":"2014-04-13T02:36:00.663Z","updated_at":"2014-04-21T23:23:55.844Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/nazri-my-son-is-not-my-wife-he-doesnt-tell-me-what-he-does/","source_date":"2012-11-01","context":"","view_count":175,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Nazri Abdul Aziz","tags":["son","wife"]},{"id":139,"player_id":34,"quote":"I am not questioning the privileges. I am asking how long they will be implemented.","source":"Karpal in 2010, asking the Government for a time frame for the gradual removal of special privileges accorded to Malays and other bumiputras, in the spirit of 1Malaysia. ","created_at":"2014-04-18T19:37:14.509Z","updated_at":"2014-04-21T23:23:54.152Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/18/Dont-play-the-fool-and-other-quotes-by-Karpal-Singh","source_date":"2014-04-19","context":"","view_count":105,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Karpal Singh","tags":[]},{"id":134,"player_id":38,"quote":"Women are like property, their price increases with make-up and drops without make-up","source":"Federal Territories Minister Tengku Adnan Tengku Mansor (pic) has apologised to women who felt offended by his recent statement which compared the gender to property.\u003Cbr\u003E\u003Cbr\u003ENevertheless, he said the statement was not ill-intentioned, and was misinterpreted by certain quarters.\u003Cbr\u003E\u003Cbr\u003E\"I did not mean that women are property. What I meant was, if we build a house and want it to appear nice, it needs to have make-up, like (how) women (put on make-up),\" he told reporters after attending the MCA Annual General Assembly in Kuala Lumpur today.\u003Cbr\u003E\u003Cbr\u003ETengku Adnan, who is also Barisan Nasional (BN) secretary-general, also denied that he disrespected women as he was a father of six daughters.\u003Cbr\u003E\u003Cbr\u003E\"Of course, I respect women... I've got six daughters, while in Umno itself, half its members are women. If I have hurt their (women's) feelings, I apologise as I had no intention of hurting them,\" he said.\u003Cbr\u003E\u003Cbr\u003EYesterday, Tengku Adnan was said to have belittled Malaysian women when he was reported to have stated, \"Women are like property, their price increases with make-up and drops without make-up\", when explaining the valuation for property in Kuala Lumpur.\u003Cbr\u003E\u003Cbr\u003Ehttp://m.themalaymailonline.com/malaysia/article/ku-nan-claims-remark-on-women-was-twisted","created_at":"2014-04-18T18:42:45.195Z","updated_at":"2014-04-21T23:23:46.278Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/tengku-adnan-extends-apology-for-likening-women-","source_date":"2013-12-21","context":"","view_count":51,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Tengku Adnan","tags":["Minister","sexist","Offensive","women"]},{"id":52,"player_id":16,"quote":"If the husband wants sex, give in to him. If not, the angels will curse her and this is not good for the family.","source":"\"We are talking about first-class elite types, not street hooker types … Ordinary prostitutes can only provide good sex, but not love and affection, which only a wife can provide,\" she told the Malay Mail.\u003Cbr\u003E\u003Cbr\u003E\"If we provide our husbands [with] more than a prostitute can give, then he will not go out looking for it.\"\u003Cbr\u003E\u003Cbr\u003EBut the Malaysian women's minister, Robia Kosai, dismissed the OWC's views as \"nonsense\", and said the club was \"not welcome\" in the state she represents, Johor, which borders Singapore. \"Divorce – and other social ills – won't stop just because the wife is good in bed,\" she said. \"Research shows that divorce in Malaysia is primarily due to economic factors, not because a wife hasn't been 'obedient' to her husband.\"\u003Cbr\u003E\u003Cbr\u003EBut with members already numbering some 1,000 worldwide, the OWC – whose umbrella organisation, Global Ikhwan, also started a polygamy group two years ago – aims to launch branches in London, Paris, Rome and Frankfurt in the near future.\u003Cbr\u003E","created_at":"2014-04-10T05:54:48.838Z","updated_at":"2014-04-21T23:23:31.674Z","source_url":"http://www.theguardian.com/world/2011/jul/06/outrage-at-obedient-wives-club-singapore?CMP=twt_gu","source_date":"2011-07-06","context":"Muslim wives","view_count":39,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Obedient Wives Club","tags":[]},{"id":5,"player_id":2,"quote":"Jews had to be periodically massacred","source":"The former premier also blamed Jews for hindering progress in US foreign policy. Voicing his disappointment that Barack Obama had not yet ended the war in Afghanistan or closed the US terror detention center at Guantanamo, he explained that “there are forces in the United States which prevent the president from doing some things. One of the forces is the Jewish lobby.”\u003Cbr\u003E\u003Cbr\u003EJews “had always been a problem in European countries. \u003Cb\u003EThey had to be confined to ghettoes and periodically massacred\u003C/b\u003E. But still they remained, they thrived and they held whole governments to ransom,” Mahathir said.\u003Cbr\u003E\u003Cbr\u003E“Even after their massacre by the Nazis of Germany, they survived to continue to be a source of even greater problems for the world.”\u003Cbr\u003E","created_at":"2014-04-07T23:34:58.863Z","updated_at":"2014-04-21T23:23:08.305Z","source_url":"http://blogs.news.com.au/couriermail/andrewbolt/index.php/couriermail/comments/mahathir_jews_had_to_be_periodically_massacred/","source_date":"2010-01-23","context":"","view_count":105,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Mahathir Mohamad","tags":["Nazi","BN"]},{"id":186,"player_id":51,"quote":"Ini perkara banyak memalukan saya. Sebenarnya, Kemaluan saya sangat sangat BESAR","source":"[Source Needed: Please email us]","created_at":"2014-04-21T09:45:27.258Z","updated_at":"2014-04-21T23:22:50.922Z","source_url":"","source_date":"1992-12-15","context":"","view_count":38,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Samy Vellu","tags":[]},{"id":25,"player_id":13,"quote":"Start behaving like world-class universities","source":"Malaysian institutions of higher learning should start behaving like world-class universities, says Datuk Ambiga Sreenevasan, following Universiti of Malaya's (UM) refusal to allow the prominent lawyer to speak at its law convention last week.\u003Cbr\u003E\u003Cbr\u003EClaiming it was a ridiculous move by the university, the former Bersih co-chair said UM was setting a bad example by curtailing the rights of students and clamping down on academic freedom.\u003Cbr\u003E\u003Cbr\u003E\"This has to stop. We cannot have narrow-minded people up there telling us this. Public institutions of higher learning  should start behaving like world-class universities,\" she told The Malaysian Insider.\u003Cbr\u003E","created_at":"2014-04-10T01:08:31.997Z","updated_at":"2014-04-21T23:20:59.997Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/start-behaving-like-world-class-universities-ambiga-tells-local-varsities","source_date":"2014-04-09","context":"local varsities","view_count":42,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ambiga Sreenevasan","tags":["IPTA","university"]},{"id":171,"player_id":50,"quote":"Commercials on sanitary pads could influence the young to get involve in social ills","source":"THEY may be the princesses of the party, but Puteri Umno delegates who stepped up to the debate rostrum made fiery speeches that could rival their senior speakers.\u003Cbr\u003E\u003Cbr\u003EFeisty Sabah delegate Hamidah Mumamad Jafar called for support for bold moves to curb cases of baby-dumping, such as setting up a school for pregnant mothers and providing more baby hatches.\u003Cbr\u003E\u003Cbr\u003EThe Putatan Puteri Umno division chief said the Government should fully support innovative approaches as the growing number of baby-dumping cases was alarming.\u003Cbr\u003E\u003Cbr\u003E“Setting the school and the baby-hatch provided a lifeline for pregnant unwed mothers and their babies.\u003Cbr\u003E\u003Cbr\u003E“Sex education in schools is also a must to prevent young girls from being involved in premarital sex,” she said, to the applause of the more than 700 delegates.\u003Cbr\u003E\u003Cbr\u003EJohor Baru Puteri Umno chief Azura Mohd Afandi wants the Information Ministry to curb television shows and commercials that could lead people astray from the right religious paths.\u003Cbr\u003E\u003Cbr\u003E“Horror films and commercials deemed too sexy for young viewers might lead to deviant teachings.\u003Cbr\u003E\u003Cbr\u003E“For example, commercials on sanitary pads are openly shown on TV and this could influence the young to get involved in social ills,” said Azura, urging the ministry to increase shows that teach good values and religious practices.\u003Cbr\u003E\u003Cbr\u003EKedah delegate Azifah Abdul Rahman supports the continued use of the Internal Security Act against those who threaten the country’s security.\u003Cbr\u003E\u003Cbr\u003EShe said: “The Act is needed, especially as there are those who dare question the Malay rights.”\u003Cbr\u003E","created_at":"2014-04-21T07:32:02.580Z","updated_at":"2014-04-21T23:20:41.346Z","source_url":"http://thestar.com.my/news/story.asp?file=/2010/10/21/nation/7266377\u0026sec=nation","source_date":"2010-10-21","context":"","view_count":41,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Azura Mohd Afandi","tags":["women","foot in mouth"]},{"id":39,"player_id":4,"quote":"Malaysian roads are like Iraqi war zones","source":"KUALA LUMPUR: MCA president Dr Chua Soi Lek today defended the Automated Enforcement System (AES) of traffic control, saying it was necessary in the light of statistics on road accidents.\u003Cbr\u003EHe likened Malaysian highways to the Iraqi war zone and urged Pakatan Rakyat to stop politicising the issue.\u003Cbr\u003EQuoting official statistics, he said there were 400,000 road accidents last year and 6,800 road deaths.\u003Cbr\u003E“The number of American soldiers who have died in Iraq is fewer than 3,000 since they were deployed to that country,” he said.\u003Cbr\u003E“That is already a big political issue in America. But we have 6,800 people who die every year. Imagine that.”\u003Cbr\u003EChua was addressing a press conference after chairing the MCA presidential council meeting this afternoon.\u003Cbr\u003E","created_at":"2014-04-10T05:06:16.068Z","updated_at":"2014-04-21T23:20:21.321Z","source_url":"http://www.freemalaysiatoday.com/category/nation/2012/11/08/chua-likens-our-roads-to-iraqi-war-zone/?utm_source=twitterfeed\u0026utm_medium=twitt","source_date":"2012-10-08","context":"","view_count":115,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":["roads","JPJ","war","MCA"]},{"id":197,"player_id":55,"quote":"Potong telinga saya jika DAP menang Bentong","source":"Menteri Besar Pahang, Datuk Seri Adnan Yaakob percaya loji Lynas merupakan isu di Kuantan sahaja dan tidak akan menjejaskan peluang BN di Pahang dalam pilihan raya umum akan datang.\u003Cbr\u003E\u003Cbr\u003EBeliau memberi contoh kawasannya di Bentong yang menurutnya tidak boleh dimenangi DAP.\u003Cbr\u003E\u003Cbr\u003E\"... DAP tidak boleh menang di Bentong. Tidak boleh menang. Jika DAP menang di Bentong, anda potong teliga saya, saya terjun Sungai Pahang. (DAP) tidak boleh menang,\" katanya.\u003Cbr\u003E\u003Cbr\u003EAdnan adalah ADUN Pelangai - satu lagi kerusi DUN dalam Parlimen Bentong.\u003Cbr\u003E\u003Cbr\u003EDitanya sama ada referendum mengenai Lynas itu hanya terhadap di Kuantan, Adnan menjawab: \"... jika kita menang di Kuantan, selesai. Lynas bukan isu lagi.\" \u003Cbr\u003E\u003Cbr\u003EAdnan yang juga pengerusi BN dan Umno Pahang menegaskan demikian ketika ditemui pemberita di perhimpunan agung Umno di PWTC hari ini.\u003Cbr\u003E\u003Cbr\u003EDitanya mengenai tahap keyakinannya dalam pilihan raya umum akan datang, Adnan berkata:\u003Cbr\u003E\u003Cbr\u003E\"Sangat, sangat yakin. (Kalau Lim) Guan Eng datang pun dia akan kalah. Betul. Jika MCA kalah di Bentong, MCA mesti tutup kedai. \u003Cbr\u003E\u003Cbr\u003E\"MCA adalah perimeter di Pahang, jika MCA kalah kepada DAP, lebih baik tutup kedai. Tapi jika MCA menang, DAP kena tutup kedai di Pahang,\" tegasnya.\u003Cbr\u003E","created_at":"2014-04-21T09:59:58.979Z","updated_at":"2014-04-21T23:20:10.559Z","source_url":"http://www.malaysiakini.com/news/215588","source_date":"2012-11-30","context":"","view_count":11,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Adnan Yaakob","tags":["DAP","elections"]},{"id":126,"player_id":1,"quote":"1Malaysia is accepted and understood by all Malaysians","source":"KUALA LUMPUR, Mar 17 — Datuk Seri Najib Razak today conceded that his 1 Malaysia concept required further fleshing out, despite having been implemented since 2009.\u003Cbr\u003E\u003Cbr\u003E“We need to explain the concept in detail... even though majority of people understand the concept, there is a lot of explaining to do,” Najib said in Parliament today.\u003Cbr\u003E\u003Cbr\u003EIn a reply to Kulim-Bandar Baharu MP Zulkifli Noordin, the premier labelled attacks against the 1 Malaysia concept as “baseless accusations” made by politicians who felt “politically threatened”, in a thinly-veiled reference to Pakatan Rakyat (PR) lawmakers.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E“I didn’t say everything is ideal today... but the 1 Malaysia concept is accepted and understood by all Malaysians,” said Najib.\u003Cbr\u003E\u003Cbr\u003EPR lawmakers as well as former PM Tun Dr Mahathir Mohamed have criticised Najib’s brainchild, calling it ambiguous and saying that it contrasted drastically with the government’s policies.\u003Cbr\u003E","created_at":"2014-04-18T08:56:52.704Z","updated_at":"2014-04-21T23:20:09.364Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/najib-1-malaysia-needs-more-explanation/","source_date":"2011-03-17","context":"","view_count":24,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["1Malaysia","BN"]},{"id":3,"player_id":2,"quote":"If they can make Avatar, they can make anything","source":"Malaysia’s former premier Mahathir Mohamad said on Wednesday there was “strong evidence” the US faked the September 11 terror attacks as an excuse to go to war against Muslims.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E“There is strong evidence that the attacks were staged. \u003Cb\u003EIf they can make Avatar, they can make anything\u003C/b\u003E,’ Mahathir told the Conference for the Support of Al-Quds (Jerusalem), as quoted by local media.\u003Cbr\u003E","created_at":"2014-04-06T08:31:00.499Z","updated_at":"2014-04-21T23:19:09.259Z","source_url":"http://blogs.news.com.au/couriermail/andrewbolt/index.php/couriermail/comments/mahathir_jews_had_to_be_periodically_massacred/","source_date":"2010-01-23","context":"","view_count":42,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Mahathir Mohamad","tags":["avatar"]},{"id":195,"player_id":1,"quote":"Do you think Penang people are stupid to support Lim Guan Eng? We Penangites are not stupid.","source":"Do you think Penang people are stupid enough to support (Guan Eng)? We Penangites are not stupid.\u003Cbr\u003E- Prime Minister Abdullah Badawi, said before March 8\u003Cbr\u003E\u003Cbr\u003EABOUT THE BOOK\u003Cbr\u003EThe day of the underdogs, the real Merdeka, a political tsunami, the perfect storm — by any name, March 8, 2008, will go down in history as a turning point in Malaysian politics. With their votes, Malaysians dealt a blow to the Barisan Nasional government that had held almost absolute power for 50 years. Denying it the all-important two-thirds majority in Parliament and the control of five states has certainly made the political scenario more vibrant.\u003Cbr\u003EAlthough surprised that there was such power in the vote they cast, Malaysians woke up to the true meaning and practice of democracy. They now face the present reasonably free from fear, free from the spectre of May 13.\u003Cbr\u003EThis book is about that historic day and the change that came with it — an expression of hope for a brighter future, with many Malaysian voices speaking their thoughts frankly. There are also eyewitness accounts, interviews with key people, and articles never published before, written by fledgling and established writers.\u003Cbr\u003E\u003Cbr\u003EFrom Malaysia’s hard-hitting journalist and playwright Kee Thuan Chye","created_at":"2014-04-21T09:57:56.565Z","updated_at":"2014-04-21T23:19:06.561Z","source_url":"https://blog.limkitsiang.com/2008/09/19/1487/comment-page-1/","source_date":"2008-08-19","context":"","view_count":36,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["Penang","stupid","CONFIDENCE","BN"]},{"id":100,"player_id":29,"quote":"I am 101% confident that I would win Shah Alam","source":"Zulkifli became a BN-friendly Independent MP and critical of the opposition when he was dismissed from PKR on March 6, 2010 over a police report he lodged against Shah Alam incumbent Khalid Abdul Samad.\u003Cbr\u003E\u003Cbr\u003EHe also told fz.com that he was “101 per cent” confident that he would win Shah Alam against PAS’s Khalid Samad, who won the seat in Election 2008.\u003Cbr\u003E\u003Cbr\u003E“After 5th of May you will see me as a wakil rakyat of Shah Alam, because I am confident of the prime minister,” he said.\u003Cbr\u003E","created_at":"2014-04-17T03:50:24.967Z","updated_at":"2014-04-21T23:18:59.106Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/zul-noordin-confident-with-his-image-selangor-bn-sweep/","source_date":"2013-04-21","context":"","view_count":26,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["GE13","CONFIDENCE","BN"]},{"id":169,"player_id":1,"quote":"Haram Jadah!","source":"\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/_VOq6MDFQ1s?hl=en_GB\u0026amp;version=3\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/_VOq6MDFQ1s?hl=en_GB\u0026amp;version=3\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E\u003Cbr\u003E\u003Cbr\u003ENajib dalam ucapannya di Majlis Sejahtera Peneroka bersama Perdana Menteri di Jengka 8 kelmarin turut berkata dirinya tidak redha dan tidak rela pembangkang mengambil ‘durian runtuh’ RM15,000 itu selepas cuba menghalang penyenaraian FGVHB.\u003Cbr\u003E\u003Cbr\u003E“Haram jadah mereka tu. Jangan terima kebaikan daripada penyenaraian (FGVHB). Saya nak tengok muka-muka mereka ni terima durian runtuh. Haram jadah,” katanya.\u003Cbr\u003E\u003Cbr\u003EKhalid berkata, walaupun ada peneroka yang tidak bersetuju dengan penyenaraian itu, keputusan sama ada mahu menerima ‘durian runtuh’ itu tetap terletak di tangan mereka.\u003Cbr\u003E\u003Cbr\u003EBeliau turut mendakwa pemberian ‘durian runtuh’ itu dibuat hanya berdasarkan niat politik apabila Najib menyentuh isu ‘pembubaran parlimen’.\u003Cbr\u003E","created_at":"2014-04-21T07:25:13.235Z","updated_at":"2014-04-21T23:18:38.926Z","source_url":"http://www.freemalaysiatoday.com/category/nation/2012/05/10/najib-kata-haram-jadah-kepada-peneroka/","source_date":"2012-05-10","context":"FELDA participants","view_count":21,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["FELDA","rude","foot in mouth"]},{"id":158,"player_id":1,"quote":"Tujuan utama larian ini ialah untuk menghapuskan rasuah","source":"\u003Cimg src=\"http://www.sinarharian.com.my/polopoly_fs/1.272412.1397966752!/image/image.jpg_gen/derivatives/landscape_490/image.jpg\" width=\"100%\"\u003E\u003Cbr\u003E\u003Cbr\u003EPerdana Menteri, Datuk Seri Najib Tun Razak melakukan senamrobik bersama orang ramai sebelum memulakan Larian yang bertemakan \"Hapuskan Rasuah\" di Padang Merbok di Kuala Lumpur, hari ini. - Foto Bernama\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EOrganizing a fun run to fight corruption. Only in Malaysia. #genius","created_at":"2014-04-20T08:47:23.669Z","updated_at":"2014-04-21T23:18:31.410Z","source_url":"http://www.sinarharian.com.my/nasional/pm-ketuai-larian-hapuskan-rasuah-1.272410","source_date":"2014-04-20","context":"Larian Hapuskan Rasuah","view_count":30,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["corruption","policy fail","BN"]},{"id":132,"player_id":1,"quote":"Baru kena sikit je tear gas","source":"\u003Cobject width=\"420\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/Dd9slh1Y4Ug?hl=en_GB\u0026amp;version=3\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/Dd9slh1Y4Ug?hl=en_GB\u0026amp;version=3\" type=\"application/x-shockwave-flash\" width=\"420\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-18T09:20:20.410Z","updated_at":"2014-04-21T23:18:14.428Z","source_url":"https://www.youtube.com/watch?v=Dd9slh1Y4Ug","source_date":"2011-07-10","context":"Anwar hospitalized","view_count":38,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["anwar","tear gas","Bersih"]},{"id":44,"player_id":14,"quote":"Women who wear skimpy clothes invite rape","source":"A Malaysian official is under fire after saying women who wear skimpy clothes invite rape.\u003Cbr\u003E \u003Cbr\u003EHis attitude is medieval\u003Cbr\u003E\u003Cbr\u003ENg Yen-yen, Malaysian Chinese Association\u003Cbr\u003ENik Aziz Nik Mat, chief minister of Kelantan state, also accused women of being the main cause of \"social ills and moral decadence\".\u003Cbr\u003E\u003Cbr\u003EHe admitted that even his faith could be weakened by an exposed navel.\u003Cbr\u003E\u003Cbr\u003EMr Nik Aziz is a religious teacher and spiritual adviser to the opposition Parti Islam se-Malaysia (PAS) which rules Kelantan and neighbouring Terengganu.\u003Cbr\u003E\u003Cbr\u003E women in market\u003Cbr\u003EMr Nik Aziz wants women to dress modestly\u003Cbr\u003EMalaysian women's representatives immediately accused Mr Nik Aziz of being out of touch and having no respect for women.\u003Cbr\u003E\u003Cbr\u003EMr Nik Aziz made his comments during his weekly religious meeting in the Kelantan state capital, Kota Baru.\u003Cbr\u003E","created_at":"2014-04-10T05:17:19.756Z","updated_at":"2014-04-21T23:18:13.799Z","source_url":"http://news.bbc.co.uk/2/hi/asia-pacific/963834.stm","source_date":"2000-10-08","context":null,"view_count":186,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Tok Guru Nik Aziz","tags":[]},{"id":125,"player_id":1,"quote":"There are Indians who have even kissed him already","source":"Najib: Zul Noordin will take care of Indians' welfare\u003Cbr\u003ERam Anand 6:43PM Apr 22, 2013\u003Cbr\u003E\u003Cbr\u003EBN chairperson Najib Abdul Razak today attempted to douse the anger over \u003Cbr\u003EPerkasa vice-president Zulkifli Noordin's disparaging remarks about Hindus, \u003Cbr\u003Eclaiming that Indians have now warmed up to him.\u003Cbr\u003E\u003Cbr\u003E\"There are Indians who have even kissed him already,\" Najib said, adding \u003Cbr\u003Ethat he endorsed Zulkifli's (right) candidacy for the Shah Alam \u003Cbr\u003Eparliamentary seat.\u003Cbr\u003E\u003Cbr\u003E\"Forget about the remarks he has made. He has apologised. Let it be,\" the \u003Cbr\u003Ecaretaker prime minister said in Shah Alam as he stressed that the \u003Cbr\u003Estatements were made when Zulkifli was part of a \"backward\" party.\u003Cbr\u003E\u003Cbr\u003EHe claimed that Zulkifli has vowed to take care of the welfare of Indians in \u003Cbr\u003Ethe constituency.\u003Cbr\u003E\u003Cbr\u003E\"Indians want temples, schools. He told me he wants to get them what they \u003Cbr\u003Ewant,\" Najib added.\u003Cbr\u003E\u003Cbr\u003EHe was speaking during a walkabout campaign in Kota Raja and Shah Alam \u003Cbr\u003Eearlier today.\u003Cbr\u003E\u003Cbr\u003EAt a press conference in a hotel in Shah Alam later, Najib went on to say \u003Cbr\u003Ethat the Selangor government's demolition of an altar in Sepang recently was \u003Cbr\u003Emore serious than Zulkifli's remarks.\u003Cbr\u003E","created_at":"2014-04-18T08:53:10.577Z","updated_at":"2014-04-21T23:18:09.587Z","source_url":"http://www.malaysiakini.com/news/227935","source_date":"2013-04-24","context":"Zulkifli Noordin","view_count":32,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["kiss","racist","BN"]},{"id":144,"player_id":1,"quote":"Are you ready for PSY?","source":"\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/g0WiH85IaGM?hl=en_GB\u0026amp;version=3\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/g0WiH85IaGM?hl=en_GB\u0026amp;version=3\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-19T22:22:00.154Z","updated_at":"2014-04-21T23:17:59.326Z","source_url":"http://www.youtube.com/watch?v=g0WiH85IaGM","source_date":"2013-02-12","context":"GE13","view_count":64,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["Penang","PSY","BN"]},{"id":38,"player_id":4,"quote":"I am retired, but not brain dead","source":"INTERVIEW Despite his decision to step down as MCA president last year, Dr Chua Soi Lek says he will not stop taking jabs at his party successors for as long as he can.\u003Cbr\u003E\u003Cbr\u003EChua said by leaving the leadership after three decades in MCA, those who think he is quitting politics altogether are wrong: he will hit out occasionally, when MCA takes a misstep, for he is still an elected central delegate.\u003Cbr\u003E\u003Cbr\u003EAn issue in point: when the party leaders recently tried to lobby support to re-enter the cabinet, tearing down a prohibition he had erected during his term of presidency...\u003Cbr\u003E","created_at":"2014-04-10T05:02:00.736Z","updated_at":"2014-04-21T23:17:36.419Z","source_url":"http://www.malaysiakini.com/news/254218?utm_source=dlvr.it\u0026utm_medium=twitter","source_date":"2014-02-13","context":null,"view_count":13,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":[]},{"id":113,"player_id":21,"quote":"Unreasonable and racist grandmother","source":"There was name-calling after the Penang state assembly today when Chief Minister Lim Guan Eng (pic) accused opposition leader Datuk Jahara Hamid of being a \"racist grandmother\" when she alleged there was selective prosecution of Malay hawkers in the state.\u003Cbr\u003E\u003Cbr\u003EIn debating the 2014 Budget, Jahara had questioned why no action was taken against Chinese hawkers who operated illegally at Pantai Bersih in Butterworth while action was always taken against Malay hawkers by the Seberang Prai Municipal Council (MPSP).\u003Cbr\u003E\u003Cbr\u003ELim (DAP-Air Putih) accused Jahara (BN-Teluk Ayer Tawar) of taking a racist line and trying to \"twist the issue\" when she could have just questioned why the local councils were not acting against illegal hawkers.\u003Cbr\u003E","created_at":"2014-04-18T02:59:34.217Z","updated_at":"2014-04-21T23:17:35.842Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/lim-guan-eng-calls-penang-opposition-chief-a-rac","source_date":"2013-12-09","context":"Penang opposition","view_count":121,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Lim Guan Eng","tags":["Penang","DAP","BN"]},{"id":1,"player_id":6,"quote":"The Malaysian education system is better than advanced nations","source":"Malaysian children received better education than those in advanced countries based on the World Economic Forum's global competitiveness report, said Deputy Prime Minister Tan Sri Muhyiddin Yassin.\u003Cbr\u003E\u003Cbr\u003EHe said the report ranked Malaysia 14th among 142 countries in quality of education and second in the ASEAN region.\u003Cbr\u003E\u003Cbr\u003E\"For those who have come to me complaining about our education system, it seems the report contradicts their claims.\u003Cbr\u003E\u003Cbr\u003E\"Furthermore, the report also states that our younger generation are receiving a better education than students in the United States, Britain and Germany,\" said Muhyiddin at a national higher education carnival at Putra World Trade Centre here.","created_at":"2014-04-06T07:32:17.700Z","updated_at":"2014-04-21T23:17:35.716Z","source_url":"http://www.thestar.com.my/News/Nation/2012/03/31/Muhyiddin-Our-education-system-better-than-advanced-nations/","source_date":"2012-03-31","context":"","view_count":109,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Muhyiddin Yassin","tags":["education","Malaysia"]},{"id":221,"player_id":1,"quote":"Are you ready for BN? \"No!\"","source":"Embarassing moment for PM during PSY Gangnam Style Live in Penang, Malaysia.","created_at":"2014-04-21T14:23:41.335Z","updated_at":"2014-04-21T23:17:13.430Z","source_url":"http://www.youtube.com/watch?v=R7Pnb9DKock","source_date":"2013-02-11","context":"","view_count":6,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["Penang","PSY","BN"]},{"id":146,"player_id":1,"quote":"Even if our bodies are crushed and lives are lost, whatever happens, we must defend Putrajaya!","source":"“Even if our bodies are crushed and our lives lost, brothers and sisters, whatever happens, we must defend Putrajaya!”\u003Cbr\u003E\u003Cbr\u003E\u003Cb\u003E\"Walau berkecai tulang dan juga badan, walau bercerai jasad dari nyawa. Saudara dan saudari, walau apa pun yang terjadi, Putrajaya mesti kita pertahankan!\" kata Presiden Umno, Datuk Seri Najib Tun Razak ketika merasmikan perhimpunan agung Umno di PWTC pagi ini. \u003C/b\u003E\u003Cbr\u003E\u003Cbr\u003EReading materials:\u003Cbr\u003Ehttp://asiapacific.anu.edu.au/newmandala/2010/10/25/umno-dies-defending-putrajaya/\u003Cbr\u003Ehttp://www.malaysiakini.com/news/145963\u003Cbr\u003E\u003Cbr\u003E\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/Whi-4OYzAQY?hl=en_GB\u0026amp;version=3\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/Whi-4OYzAQY?hl=en_GB\u0026amp;version=3\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-19T22:36:46.793Z","updated_at":"2014-04-21T23:17:06.671Z","source_url":"http://www.malaysiakini.com/news/145960","source_date":"2010-10-21","context":"UMNO AGM","view_count":17,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["threat","UMNO","election"]},{"id":179,"player_id":7,"quote":"You see, don't talk sh*t, I-I-I-I-I-I-I-I-I-I repeat, don't talk shit three times.","source":"In a 2010 interview with Al-Jazeera over grievances by Malaysian minorities on their rights, then Pasir Mas MP and Perkasa chief Ibrahim Ali told the television station what he felt about their claims.","created_at":"2014-04-21T09:33:29.207Z","updated_at":"2014-04-21T23:16:41.299Z","source_url":"http://www.youtube.com/watch?v=CBHAMp0-bLc","source_date":"1992-12-15","context":"","view_count":36,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Ali","tags":["rude","foot in mouth"]},{"id":57,"player_id":1,"quote":"Had a good chat yesterday with Mark Zuckerberg at Twitter HQ.","source":"Click on the date icon for a direct link to the article.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg src=\"http://sin.stb.s-msn.com/i/75/D3575420CF2E55F3BB71499E02F4F.JPG\" width=\"381\" height=\"449\" alt=\"Twitter\" title=\"Twitter\"\u003E","created_at":"2014-04-11T16:56:44.129Z","updated_at":"2014-04-21T23:16:36.980Z","source_url":"http://news.malaysia.msn.com/tech/pm-najib-tweets-wrong-company","source_date":"2013-09-26","context":"","view_count":123,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["Mark Zuckerberg","Silicon Valley","Facebook","Twitter"]},{"id":22,"player_id":7,"quote":"In Islam, wives are supposed to stop everything to fulfil their husband's demands","source":"Mr Ibrahim heads Perkasa, a right-wing Malay nationalist group, seeking to protect ethnic Malay dominance in politics.\u003Cbr\u003EHis strident comments came as he asked about plans by the government's religious development department to educate wives on their responsibilities.\u003Cbr\u003EWives \"failing in their duties\" pushed men to go to \"private places to satisfy their urges\", he said.\u003Cbr\u003EAn aide to the lawmaker has confirmed the remarks but has declined further comment.\u003Cbr\u003EHis comments have prompted fury among women's groups in a nation with a growing sex industry and a problem with human trafficking.\u003Cbr\u003EWomen's Aid Organisation chief Ivy Josiah said Mr Ibrahim's comments were unacceptable for a parliamentarian.\u003Cbr\u003E\"I am appalled as he equates women to being a sex toy and what is worse is that he uses religion to try and justify his position,\" she said.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003ERead more: http://www.smh.com.au/world/men-have-affairs-because-wives-neglect-their-responsibilities-mp-tells-parliament-20110408-1d6k7.html#ixzz2yRDG6UPm","created_at":"2014-04-10T00:15:55.872Z","updated_at":"2014-04-21T23:15:35.982Z","source_url":"http://www.smh.com.au/world/men-have-affairs-because-wives-neglect-their-responsibilities-mp-tells-parliament-20110408-1d6k7.html","source_date":"2011-04-08","context":null,"view_count":42,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Ali","tags":[]},{"id":103,"player_id":28,"quote":"If tomorrow never comes","source":"\u003Cobject width=\"420\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/_PmAy81VSjQ?hl=en_GB\u0026amp;version=3\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/_PmAy81VSjQ?hl=en_GB\u0026amp;version=3\" type=\"application/x-shockwave-flash\" width=\"420\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-17T05:17:27.797Z","updated_at":"2014-04-21T23:15:14.409Z","source_url":"http://www.youtube.com/watch?v=_PmAy81VSjQ","source_date":"2010-10-26","context":"","view_count":76,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Rosmah Mansor","tags":["cincin","hippo","singer"]},{"id":187,"player_id":51,"quote":"Toll naik sikit, marah sama saya. You ingat ini semua toll saya punya bapak punya kah?!","source":"[Source Needed: Please email us]","created_at":"2014-04-21T09:45:50.476Z","updated_at":"2014-04-21T23:13:51.063Z","source_url":"","source_date":"1992-12-15","context":"","view_count":29,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Samy Vellu","tags":[]},{"id":42,"player_id":4,"quote":"Money politics is not corruption","source":"Money politics is not corruption, says MCA president Dr Chua Soi Lek.\u003Cbr\u003E\u003Cbr\u003EThis is his response to the PKR proposal that he refer his money politics allegation against a woman deputy minister from the MCA to the Malayian Anti-Corruption Commission (MACC).\u003Cbr\u003E\u003Cbr\u003EOne example of money politics, Chua said, is purchasing things for people during the New Year, which cannot be considered as corruption.\u003Cbr\u003E","created_at":"2014-04-10T05:09:53.824Z","updated_at":"2014-04-21T23:13:20.512Z","source_url":"http://www.malaysiakini.com/news/209382","source_date":"2012-09-20","context":null,"view_count":28,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":[]},{"id":115,"player_id":36,"quote":"I'm confident in winning the Raub seat","source":"PUTRAJAYA: MCA vice president Ng Yen Yen said she is confident to achieve the victory should she be fielded in Raub parliamentary seat. \u003Cbr\u003E\u003Cbr\u003E\"I'm confident in winning the Raub seat, but I didn't say I wanna contest in the constituency.\" \u003Cbr\u003E\u003Cbr\u003EThey (BN leader) asked me to contest in Raub last time, so I went. In my opinion, the party's decision should be prioritised.\"\u003Cbr\u003E\u003Cbr\u003EAccording to Ng, all quarters should stay cautious though the winning chance of BN in Raub remains high. \u003Cbr\u003E\u003Cbr\u003EIn response to the dissatisfaction of Raub constituents with her, she shrugged off the statement and revealed that the disgruntled voters are just the minority.\" \u003Cbr\u003E\u003Cbr\u003E\"For those living in KL, you all should make a trip to Raub and listen to them. \"\u003Cbr\u003E","created_at":"2014-04-18T08:26:40.602Z","updated_at":"2014-04-21T23:13:09.014Z","source_url":"http://news.sinchew.com.my/node/286661?tid=1","source_date":"2013-04-04","context":"","view_count":18,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["GE13","CONFIDENCE","BN"]},{"id":29,"player_id":10,"quote":"What is important is there is no wrongdoing by the police.","source":"KUALA LUMPUR, Oct 3 — Datuk Seri Ahmad Zahid Hamidi today backed Inspector-General of Police (IGP) Tan Sri Khalid Abu Bakar's claim that some of the guns missing from the police force's weapons cache could have tumbled into the ocean during operations.\u003Cbr\u003E\u003Cbr\u003EDespite criticisms over the purported lack of accountability over the dangerous items, the Home Minister described the explanation as \"transparent\", pointing out that such incidences could happen during the course of duty.\u003Cbr\u003E","created_at":"2014-04-10T04:42:16.344Z","updated_at":"2014-04-21T23:12:58.898Z","source_url":"https://my.news.yahoo.com/zahid-backs-igp-agrees-missing-guns-likely-sea-061000519.html","source_date":"2013-10-03","context":"Missing guns","view_count":16,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":41,"player_id":4,"quote":"1.2 million Malaysians would lose their jobs if PAS implements hudud","source":"MCA president Chua Soi Lek claims that 1.2 million Malaysians will lose their jobs if PAS implements hudud in Malaysia - which he bases on an anonymous SMS he received today.\u003Cbr\u003E","created_at":"2014-04-10T05:09:19.395Z","updated_at":"2014-04-21T23:12:21.798Z","source_url":"http://www.malaysiakini.com/news/212048","source_date":"2012-10-18","context":null,"view_count":29,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":[]},{"id":140,"player_id":34,"quote":"I do not intend to give up. The Opposition has a big role to play in this country.","source":"Karpal after his accident in 2005 which left him in a wheelchair.","created_at":"2014-04-18T19:38:34.281Z","updated_at":"2014-04-21T23:12:03.119Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/18/Dont-play-the-fool-and-other-quotes-by-Karpal-Singh","source_date":"2014-04-19","context":"","view_count":19,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Karpal Singh","tags":[]},{"id":190,"player_id":9,"quote":"Correct, correct, correct","source":"Correct, correct, correct. Correct, correct. You know that the same problem that Tun Eusoff Chin had. He tried to do all this and yet he has run out of soldiers. He couldn’t do it because many were from the other camp. Last time was unfortunate because Tun Daim was doing everything sabotaging, you know lah…\u003Cbr\u003E\u003Cbr\u003EOtherwise how are things with you – everything is okay? No, don’t worry. You know sometimes Tan Sri Vincent said that half the time we are talking about judiciary rather than doing the work. But if I don’t do this part, my work will be useless. Ha! Ha! Ha!\u003Cbr\u003E\u003Cbr\u003EAh, yes. Correct, correct, correct, correct, correct. Right, right, right. Correct. Ah. Ah. Right! Susah. You see he has now asked for six Court of Appeal judges, so that he can put his men before he retires.\u003Cbr\u003E","created_at":"2014-04-21T09:51:52.207Z","updated_at":"2014-04-21T23:11:48.333Z","source_url":"http://chinhuatw.wordpress.com/2007/12/18/correct-correct-correct-full-transcript/","source_date":"2007-12-18","context":"","view_count":8,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"V. K. Lingam","tags":["corruption","lawyer"]},{"id":106,"player_id":31,"quote":"When non-Muslims build such big idols, it hurts people’s feelings","source":"KUALA LUMPUR, April 16 — The “huge” statues at a Hindu temple in Batu Caves and Buddhist temple in Penang are an affront to Islam as the religion forbids idolatry, a retired Court of Appeals judge said.\u003Cbr\u003E\u003Cbr\u003EDatuk Mohd Noor Abdullah stressed that such sculptures of non-Muslim deities should not be built in the open, but should be placed within an enclosed building instead.\u003Cbr\u003E\u003Cbr\u003E“With such a huge statue, you’re showing that your religion is all mighty and powerful,” Mohd Noor told The Malay Mail Online and Bernama in an joint interview yesterday, referring to the 42.7-metre high statue of Lord Murugan, the Hindu warrior god, at Batu Caves in Selangor.\u003Cbr\u003E\u003Cbr\u003EPointing to the Federal Constitution which states that Islam is the religion of the federation, the former judge insisted Islam is above other faiths.\u003Cbr\u003E","created_at":"2014-04-17T09:51:01.764Z","updated_at":"2014-04-21T23:11:32.501Z","source_url":"http://www.themalaymailonline.com/malaysia/article/huge-hindu-buddhist-statues-against-islam-ex-judg","source_date":"2014-04-16","context":"","view_count":83,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Mohd Noor Abdullah","tags":["islam","racist","religion"]},{"id":11,"player_id":9,"quote":"It looks like me, it sounds like me (but it's not me).","source":"KUALA LUMPUR (Jan 21, 2008): Despite being identified by earlier witnesses, lawyer Datuk V.K. Lingam today insisted before the Royal Commission of Inquiry probing a controversial video-clip that the person featured in the clip \"looks like me and sounds like me\".\u003Cbr\u003E\u003Cbr\u003E\"Irrespective of what others said, it looks like me and sounds like me,\" he told the commission.\u003Cbr\u003E\u003Cbr\u003EHe then added: \"I have conducted my own checks and the only way to verify its authenticity is to have the original equipment used to record it and the original recording is produced.\"\u003Cbr\u003E","created_at":"2014-04-09T08:38:54.503Z","updated_at":"2014-04-21T23:11:20.104Z","source_url":"http://www.malaysianbar.org.my/bar_news/berita_badan_peguam/lingam_looks_like_me_sounds_like_me.html","source_date":"2008-01-21","context":null,"view_count":25,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"V. K. Lingam","tags":[]},{"id":15,"player_id":11,"quote":"If you can't afford to buy cake, make your own.","source":"KUALA LUMPUR: \"(Jika) berpendapatan rendah, buat sendiri kek,\" demikian sanggahan Ahli Parlimen Padang Besar, Datuk Zahidi Zainul  Abidin terhadap Ahli Parlimen Sepang, Mohamed Hanipa Maidin semasa sesi perbahasan Dewan Rakyat, semalam.\u003Cbr\u003E\u003Cbr\u003EHanipa (gambar) membangkitkan kesulitan yang dihadapi rakyat berpendapatan rendah apabila terpaksa membayar mahal untuk membeli kek apabila Cukai Barangan dan Perkhidmatan (GST) dilaksanakan dalam perbahasan mengenai cukai itu di Dewan Rakyat.\u003Cbr\u003E\u003Cbr\u003E","created_at":"2014-04-09T09:44:37.118Z","updated_at":"2014-04-21T23:10:12.902Z","source_url":"http://bm.harakahdaily.net/index.php/berita-utama/26981-gst-kalau-tak-mampu-beli-kek-buat-sendiri-mp-bn","source_date":"2014-04-08","context":null,"view_count":26,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahidi Zainul Abidin","tags":[]},{"id":20,"player_id":7,"quote":"Chinese in Kelantan are not greedy as they live like Malays.","source":"KUALA LUMPUR: Malay rights group PERKASA President Datuk Ibrahim Ali said that Chinese were controlling the economy of Malaysia and the number of Chinese tycoons were more than the number of Malay tycoons, while major industries were also manopolised by Chinese, \"Could a particular group of Chinese just don't be so greedy?\"\u003Cbr\u003E\u003Cbr\u003EHe said that Malays were still lagging far behind in some economic areas, \"Please have sympathies with them....\"\u003Cbr\u003E\u003Cbr\u003E\"There were no private college in the past but we are having plenty of them nowadays, who are the owners?\u003Cbr\u003E\u003Cbr\u003E\"You have even been given scholarships, what else are you asking for? You should ask bankers or business groups how much money have them allocated for scholarships?\" he said.\u003Cbr\u003E\u003Cbr\u003EHe told Sin Chew Daily that Article 153 of the Federal Constitution that protected Malay and Bumiputra privileges did not erode the interests of non-Bumiputras.\u003Cbr\u003E","created_at":"2014-04-10T00:14:29.412Z","updated_at":"2014-04-21T23:09:29.804Z","source_url":"http://www.mysinchew.com/node/37560","source_date":"2010-04-12","context":null,"view_count":152,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Ali","tags":[]},{"id":184,"player_id":2,"quote":"Melayu mudah lupa","source":"And of course these Malays (invariably it is always the Malays that do this to me!) would wag their fingers at me and remind me of that iconic phrase ‘Melayu mudah lupa!’.\u003Cbr\u003E\u003Cbr\u003ESaudara, it is because ‘Melayu TIDAK mudah lupa’ that I started to write what was in my heart.\u003Cbr\u003EAnd if you care to read what other Malays have written through all these many years – read what they write and taken the trouble to think and work out for yourself the truth of what they write – then maybe, you too will agree that ‘Melayu TIDAK mudah lupa!’.\u003Cbr\u003E\u003Cbr\u003ESaudara, look around you today. We cannot ignore the presence of Dr Mahathir Mohamad and his family. And why can we not ignore their presence?\u003Cbr\u003E\u003Cbr\u003EOne reason is because Mahathir, at almost 90 years of age, chooses to involve himself in the sordid business of Umno politics.\u003Cbr\u003E\u003Cbr\u003E[Please email us if you find a direct source]","created_at":"2014-04-21T09:40:37.543Z","updated_at":"2014-04-21T23:09:15.974Z","source_url":"http://www.freemalaysiatoday.com/category/opinion/2013/08/08/jangan-mudah-lupa/","source_date":"2013-08-08","context":"","view_count":21,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Mahathir Mohamad","tags":["Malays"]},{"id":66,"player_id":10,"quote":"Those who renounce their citizenship will not be forgiven","source":"Home Minister Datuk Seri Dr Ahmad Zahid Hamidi today reminded Malaysian citizens residing abroad not to fall for any citizenship offer made by the certain companies or even the opposition parties.\u003Cbr\u003E\u003Cbr\u003E\"Those who renounce their citizenship will not be forgiven, unless stated in the Regulation 16A, Immigration Regulations 1963. \u003Cbr\u003E \u003Cbr\u003E\"So, don't simply renounce your citizenship, don't hate the country, don't leave it with hatred and simply take the first citizenship offer found,\" he told reporters after opening the 'Jom Sihat' programme organised by Universiti Putra Malaysia (UPM) here today. \u003Cbr\u003E \u003Cbr\u003ERead more: Zahid reminds Malaysians abroad not to fall for citizenship scam - Latest - New Straits Times http://www.nst.com.my/latest/zahid-reminds-malaysians-abroad-not-to-fall-for-citizenship-scam-1.563515#ixzz2ypAjNBwA","created_at":"2014-04-14T02:36:50.977Z","updated_at":"2014-04-21T23:09:09.998Z","source_url":"http://www.nst.com.my/latest/zahid-reminds-malaysians-abroad-not-to-fall-for-citizenship-scam-1.563515","source_date":"2014-04-12","context":"","view_count":19,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":["citizenship","brain drain","Malaysia"]},{"id":45,"player_id":14,"quote":"Padan muka kena rogol","source":"PETALING JAYA: A four-year-old video recording of PAS spiritual adviser Datuk Nik Abdul Aziz Nik Mat saying women who did not cover up deserve to be raped has gone viral.\u003Cbr\u003E\u003Cbr\u003ENik Aziz said in the 5.47-minute clip that those who did not cover their aurat were tempting men to rape them. (Aurat is part of the body that must not be exposed in public in accordance with Islamic belief.)\u003Cbr\u003E\u003Cbr\u003E“She did not cover her aurat, and got raped. Serves her right for being raped (dah dia buka aurat, dirogol, padanlah muka dirogol).\u003Cbr\u003E\u003Cbr\u003E“She is selling cheap... her calf, her face, her thigh...rape lah,” he said in his speech recorded four years ago.\u003Cbr\u003E\u003Cbr\u003EThe video recording resurfaced on various blogs after MCA president Datuk Seri Dr Chua Soi Lek recently reminded Nik Aziz of his speech about how the eyes were linked to sexual organs and temptations.\u003Cbr\u003E","created_at":"2014-04-10T05:18:17.063Z","updated_at":"2014-04-21T23:09:04.371Z","source_url":"http://www.thestar.com.my/News/Nation/2012/10/25/Video-clip-of-Nik-Aziz-goes-viral/","source_date":"2012-10-25","context":null,"view_count":97,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Tok Guru Nik Aziz","tags":["rape"]},{"id":149,"player_id":42,"quote":"Negarakuku","source":"I like this country so much\u003Cbr\u003E\u003Cbr\u003EIn the early morning 5 o'clock\u003Cbr\u003E\u003Cbr\u003EThere is morning call to wake me up\u003Cbr\u003E\u003Cbr\u003ESometime a few sings together\u003Cbr\u003E\u003Cbr\u003EJust like singing a love song\u003Cbr\u003E\u003Cbr\u003ESometimes the voice get twisted just like RnB style\u003Cbr\u003E\u003Cbr\u003EAlthough sometimes they sing until out of key\u003Cbr\u003E\u003Cbr\u003EOr sometimes they even sing until throated\u003Cbr\u003E\u003Cbr\u003ESome of their voice sound like cock, but they're earlier than a cock\u003Cbr\u003E\u003Cbr\u003EOnly like this, we'd be awaken to go to school or work\u003Cbr\u003E\u003Cbr\u003E\u003Cobject width=\"420\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/gyiBvJtJ5Z4?hl=en_GB\u0026amp;version=3\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/gyiBvJtJ5Z4?hl=en_GB\u0026amp;version=3\" type=\"application/x-shockwave-flash\" width=\"420\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-20T05:22:13.454Z","updated_at":"2014-04-21T23:07:59.806Z","source_url":"http://www.youtube.com/watch?v=gyiBvJtJ5Z4","source_date":"2007-07-24","context":"","view_count":29,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Namewee","tags":["negerakuku"]},{"id":118,"player_id":36,"quote":"You are quite a dinosaur","source":"KUALA LUMPUR: Social media has become a key tool in telling the world about Malaysia’s tourist attractions, said Tourism Minister Datuk Seri Dr Ng Yen Yen.\u003Cbr\u003E\u003Cbr\u003E“If promotions are not done over the social media, you are quite a dinosaur,” Dr Ng said at a press conference on the Malaysian International Tourism Bloggers Conference \u0026 Awards (MITBCA 2012).\u003Cbr\u003E\u003Cbr\u003EThe event, which is organised by the ministry in collaboration with the Malaysia Social Media Chambers, will see a gathering of tourism bloggers and industry players here on May 8 and 9.\u003Cbr\u003E\u003Cbr\u003EDr Ng said the inaugural Malaysia International Tourism Bloggers Awards would also be held in conjunction with the conference.\u003Cbr\u003E","created_at":"2014-04-18T08:34:40.278Z","updated_at":"2014-04-21T23:07:20.044Z","source_url":"http://www.mca.org.my/en/use-online-promotions-to-attract-more-tourists-to-malaysia-says-ng/","source_date":"2012-05-03","context":"social media usage","view_count":25,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["Facebook","MCA","social media"]},{"id":162,"player_id":49,"quote":"High unemployment rates and influx of foreign workers are caused by lazy Malaysians","source":"KUALA LUMPUR, Jan 30 — Datuk Ahmad Maslan accused “lazy Malaysians” today of adding to the country’s unemployment rate by refusing to take up job opportunities.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E \u003Cbr\u003EThe Deputy Finance Minister also blamed the unemployed for the influx of foreign migrant workers plying their trade in several industries in the country.\u003Cbr\u003E\u003Cbr\u003E“The 3 per cent are the lazy ones, ladies and gentlemen … They are worse than just lazy. There are around 300,000 of them, who are just sitting and doing nothing,” said Ahmad Maslan, referring to the jobless.\u003Cbr\u003E\u003Cbr\u003E“The nation is filled with foreign migrants, but they continue to be unemployed,” he added.\u003Cbr\u003E\u003Cbr\u003EAccording to the Department of Statistics Malaysia, the unemployment rate is at 3.4 per cent as at November last year, or 484,600 of the 14.2 million of the country’s total labour force.\u003Cbr\u003E\u003Cbr\u003E- See more at: http://www.themalaymailonline.com/malaysia/article/ahmad-maslan-lazy-malaysians-to-blame-for-countrys-jobless-rate#sthash.YoAaApQ7.dpuf","created_at":"2014-04-20T21:27:49.477Z","updated_at":"2014-04-21T23:05:27.672Z","source_url":"http://www.themalaymailonline.com/malaysia/article/ahmad-maslan-lazy-malaysians-to-blame-for-country","source_date":"2014-01-30","context":"","view_count":14,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ahmad Maslan","tags":["unemployment","lazy","foot in mouth"]},{"id":199,"player_id":34,"quote":"Tuan Speaker, jangan main-main dengan perlembagaan!","source":"Perhaps his most famous line during his last appearance in Parliament.\u003Cbr\u003E\u003Cbr\u003ERIP Karpal Singh.\u003Cbr\u003E\u003Cbr\u003E“Jangan main-main” – a catchphrase of sorts for the statesman, Karpal Singh said this on many occasions – to the Registrar of Societies when his beloved party was faced with the threat of deregistration, after being sent live bullets by thugs.\u003Cbr\u003E\u003Cbr\u003EMore quotes from The Star:\u003Cbr\u003Ehttp://www.thestar.com.my/News/Nation/2014/04/18/Dont-play-the-fool-and-other-quotes-by-Karpal-Singh/ \u003Cbr\u003E","created_at":"2014-04-21T10:00:41.845Z","updated_at":"2014-04-21T23:01:58.080Z","source_url":"https://www.youtube.com/watch?v=UMvTxlYcSLI","source_date":"2014-04-18","context":"","view_count":30,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Karpal Singh","tags":["constitution","dont play play","serious"]},{"id":206,"player_id":39,"quote":"Yoga chanting can destroy the faith of Muslims","source":"Millions of people in Malaysia have been banned from doing yoga because of fears it could corrupt Muslims.\u003Cbr\u003EThe Islamic authorities have issued a ruling, known as a fatwa, instructing the country's Muslims to avoid yoga because of its Hindu roots.\u003Cbr\u003E\u003Cbr\u003ETo most people yoga is simply a sport - a stress-busting start to the day.\u003Cbr\u003EMalaysia's National Fatwa Council said it goes further than that and that elements of the Indian religion are inherent in yoga.\u003Cbr\u003E\u003Cbr\u003EAnnouncing the decision, the council chairman Abdul Shukor Husin said practices like chanting and what he called worshipping were inappropriate and they could \"destroy the faith of a Muslim\".\u003Cbr\u003EThe ruling is not legally binding but many of Malaysia's Muslims abide by fatwas.\u003Cbr\u003EYoga classes here are filled with mostly non-Muslim Malaysians of Chinese or Indian descent, but in the major cities it is not uncommon to see several Muslim women at classes.\u003Cbr\u003E","created_at":"2014-04-21T10:20:29.694Z","updated_at":"2014-04-21T23:01:56.634Z","source_url":"http://news.bbc.co.uk/2/hi/asia-pacific/7743312.stm","source_date":"2008-11-22","context":"","view_count":5,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"National Fatwa Council ","tags":["religion","yoga","Muslims"]},{"id":141,"player_id":34,"quote":"It is important for every citizen in the country to know, that no one, no one is above the law.","source":"In the case of the king and the other rulers, the Special Court is the only court which I think is quite unfair because it is one-tiered … Even the rulers have the right to the rule of law.”","created_at":"2014-04-18T19:47:10.171Z","updated_at":"2014-04-21T23:00:20.159Z","source_url":"http://blog.limkitsiang.com/2014/04/18/10-things-about-karpal-singh-the-tiger-of-jelutong/#more-2753","source_date":"2014-04-19","context":"","view_count":36,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Karpal Singh","tags":[]},{"id":183,"player_id":40,"quote":"Malaysia has been settled by the Malays and holds the Malay identity for over 60,000 years","source":"Accusing the country’s previous British colonial masters of the conspiracy, the group pointed to a claimed 350-million strong “Malay people” purportedly rooted here to insist that peninsular Malaysia be identified as a Malay and Islamic state.\u003Cbr\u003E\u003Cbr\u003E“Malaysia is a huge province which has been settled by the Malays and hold the Malay identity for over 60,000 years, and has embraced Islam for hundreds of years.\u003Cbr\u003E\u003Cbr\u003E“History also showed that Borneo, including Sabah and Sarawak has the same identity,” ISMA vice-president Abdul Rahman Mat Dali said on the group’s website here.\u003Cbr\u003E\u003Cbr\u003EHe also asserted that Malaysia was dubbed “The Cradle of Human Civilisation”. The nickname has been claimed by many areas worldwide, but is widely recognised to be either in ancient Mesopotamia, Egypt, China, India, the Andes or Central America.\u003Cbr\u003E\u003Cbr\u003E- See more at: http://www.themalaymailonline.com/malaysia/article/indians-chinese-imported-to-dispossess-malays-of-birthright-isma-claims#sthash.NzaEEINA.dpuf","created_at":"2014-04-21T09:39:08.916Z","updated_at":"2014-04-21T22:59:48.113Z","source_url":"http://www.themalaymailonline.com/malaysia/article/indians-chinese-imported-to-dispossess-malays-of-birthright-isma-claims","source_date":"2014-04-21","context":"the continuation of Malay special rights","view_count":23,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ikatan Muslimin Malaysia","tags":["malay","race"]},{"id":49,"player_id":15,"quote":"Women should not be attracted to ‘new faces’ or foreigners because they may end up as drug mules","source":"KUCHING: Women have been reminded not to be attracted to ‘new faces’ or foreigners because they may end up being used as drug mules.\u003Cbr\u003EDeputy Dewan Rakyat Speaker Datuk Wan Junaidi Tuanku Jaafar said their attraction to the new kid on the block might become so great that they (locals) could be sweet talked into carrying luggage laden with drugs overseas.\u003Cbr\u003EHe said the problem might also be due to the fact that Malaysians are helpful and friendly in nature and usually had no qualms in lending a helping hand to strangers.\u003Cbr\u003E“Malaysia has the highest ratio of people being used as drug mules, and most of them are women. For instance, one thousand Malaysians have been caught overseas for carrying drugs, compared to below 100 in the Philippines and less than 300 in Vietnam,” said Wan Junaidi at the SK Pajar sales carnival, exhibition and joggerthon closing ceremony yesterday.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E","created_at":"2014-04-10T05:34:20.823Z","updated_at":"2014-04-21T22:59:35.617Z","source_url":"http://www.theborneopost.com/2011/11/14/wan-junaidi-to-women-don%E2%80%99t-be-gullible/?utm_medium=twitter\u0026utm_source=twitterfeed","source_date":"2011-10-14","context":null,"view_count":20,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Wan Junaidi","tags":[]},{"id":60,"player_id":20,"quote":"I want to clarify that it was just my assumption","source":"Deputy Defence Minister Datuk Abdul Rahim Bakri (pic) today admitted he assumed that the Subang air traffic control had asked lost Malaysia Airlines flight MH370 to turn back, adding his assumption was not accurate.\u003Cbr\u003E\u003Cbr\u003EThe deputy minister's reply in Parliament yesterday added another element to the often confusing and contradictory statements made by Malaysian authorities over the Malaysia Airlines Boeing 777 passenger jet that went missing with 239 people on board on March 8. It has yet to be found.\u003Cbr\u003E\u003Cbr\u003E\"In relation to my statement in the debate for the Royal Address yesterday, in which I said MH370 did a turn back probably because it received instructions from air traffic control, I want to clarify that it was just my assumption and one of the possibilities that could have happened.","created_at":"2014-04-12T21:20:16.099Z","updated_at":"2014-04-21T22:58:42.516Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/deputy-defence-minister-now-says-wrongly-assumed-subang-ordered-mh370-to-tu","source_date":"2014-03-28","context":"MH370 turnback ","view_count":17,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Abdul Rahim Bakri","tags":["flip-flop","mh370"]},{"id":9,"player_id":6,"quote":"People ask me what am I. My late father was a Bugis and my late mother was a Javanese. I am a Malay.","source":"Light exchanges over the origins of Malay and whether Umno vice-president Datuk Seri Hishammuddin Tun Hussein, who is of Turkish descent, could be regarded as Malay, had the delegates in stitches yesterday.\u003Cbr\u003E\u003Cbr\u003EUmno deputy president Tan Sri Muhyiddin Yassin also touched on a person’s roots.\u003Cbr\u003E\u003Cbr\u003E“People ask me what am I. My late father was a Bugis and my late mother was a Javanese. I am a Malay,” he said.\u003Cbr\u003E\u003Cbr\u003E","created_at":"2014-04-09T04:45:45.822Z","updated_at":"2014-04-21T22:56:53.414Z","source_url":"http://www.thestar.com.my/story.aspx/?file=%2f2010%2f10%2f24%2fnation%2f7289147\u0026sec=nation","source_date":"2010-10-24","context":null,"view_count":93,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Muhyiddin Yassin","tags":[]},{"id":138,"player_id":34,"quote":"As long as I am alive, I will continue to struggle to see a non-Malay become prime minister.","source":"Karpal in 2012, saying the Federal Constitution did not provide that only Malays could be prime minister.","created_at":"2014-04-18T19:36:18.637Z","updated_at":"2014-04-21T22:56:12.538Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/18/Dont-play-the-fool-and-other-quotes-by-Karpal-Singh","source_date":"2014-04-19","context":"","view_count":47,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Karpal Singh","tags":[]},{"id":205,"player_id":1,"quote":"Pleasure to run with u guys!","source":"\u003Ca href=\"http://imgur.com/ynb74Li\"\u003E\u003Cimg src=\"http://i.imgur.com/ynb74Li.png\" title=\"Hosted by imgur.com\" width=\"100%\"/\u003E\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003EPosted on Twitter after participating on a run for a corruption free nation. Seems like he's giving out corruption for free. \u003Cbr\u003E\u003Cbr\u003EDon't blame him. He's probably just doing his part to spread the Easter cheer.","created_at":"2014-04-21T10:09:49.185Z","updated_at":"2014-04-21T22:55:34.363Z","source_url":"https://twitter.com/NajibRazak/status/458117497007640577","source_date":"2014-04-20","context":"Larian Hapuskan Rasuah (anti-corruption run)","view_count":13,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["corruption","policy fail"]},{"id":201,"player_id":1,"quote":"Chinese Tsunami!","source":"BY CLARA CHOOI\u003Cbr\u003EASSISTANT NEWS EDITOR\u003Cbr\u003E\u003Cbr\u003EKUALA LUMPUR, May 6 — Datuk Seri Najib Razak’s Barisan Nasional (BN) survived a hard-fought polls battle in face of “Chinese tsunami” yesterday, but rival Datuk Seri Anwar Ibrahim has vowed to fight the result following allegations of widespread fraud.\u003Cbr\u003EThe BN chairman admitted it had not expected the wholesale abandonment by the Chinese community, which he blamed on the Pakatan Rakyat’s alleged play on racial sentiments to woo support from the country’s second largest ethnic group.\u003Cbr\u003E“I think they were taken in by some of the undertakings given by the opposition... and that’s why there was that swing.... and a lot of sentiments there, some of them racial in nature, that were being played up in this election, which is not very healthy for this country,” he told a 1am press conference at the Putra World Trade Centre (PWTC) today, shortly after a simple majority victory cemented BN’s place in Putrajaya.\u003Cbr\u003E“I expected it but I did not expect it to this extent. None of us expected it to this extent. But despite the extent of the swing against us, BN did not fall,” he added.\u003Cbr\u003EAt a separate press conference, PR de facto leader Datuk Seri Anwar Ibrahim said the pact rejected the results of the poll, pointing to unanswered allegations on electoral fraud.\u003Cbr\u003E“As of now, we are not accepting the results... until the EC (Election Commission) responds and issues an official statement to the allegations of irregularities and fraud,” he told reporters.\u003Cbr\u003EAs at 12.50am this morning, BN retained federal power with a simple majority, scoring 112 seats to PR’s 58.\u003Cbr\u003E\u003Cbr\u003Ehttps://my.news.yahoo.com/bn-wins-najib-shocked-by-chinese-tsunami-anwar-173712057.html","created_at":"2014-04-21T10:02:17.579Z","updated_at":"2014-04-21T22:55:32.858Z","source_url":"http://www.ft.com/cms/s/0/460f0c42-b711-11e2-841e-00144feabdc0.html#axzz2zWG9UG3u","source_date":"2013-05-07","context":"on context","view_count":17,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["Chinese","GE13"]},{"id":27,"player_id":10,"quote":"Offering cash rewards for slapping people is not a threat","source":"KAJANG: Why should police investigate the Muslim NGOs who offered a cash reward for anyone who could slap Seputeh MP Teresa Kok? It wasn’t a threat, said Home Minister Datuk Seri Dr Ahmad Zahid Hamidi.\u003Cbr\u003E\u003Cbr\u003E“If they issued a death threat, then it would be a threat. Slapping is not,” Zahid told reporters after a forum at the Kajang prison Saturday morning.\u003Cbr\u003E\u003Cbr\u003EWhen asked if he thought the accusations made by the NGOs, that Kok’s controversial Onederful Malaysia CNY 2014 video had fanned racial hatred Dr. Zahid opted not to comment but stressed that the NGOs are being investigated.\u003Cbr\u003E\u003Cbr\u003E“They are being investigated, so we should leave it to the investigation,” he confirmed.\u003Cbr\u003E\u003Cbr\u003EZahid added that an investigation had been initiated against Kok for her controversial Chinese New Year video, with over 300 police reports being lodged against her.\u003Cbr\u003E","created_at":"2014-04-10T04:34:21.734Z","updated_at":"2014-04-21T22:54:07.420Z","source_url":"http://www.thestar.com.my/News/Nation/2014/02/08/Leave-it-to-the-investigation-says-Zahid-Hamidi/","source_date":"2014-02-08","context":"slapping Teresa Kok","view_count":22,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":4,"player_id":4,"quote":"MCA issues report card: passed with flying colours.","source":"The MCA gave itself top marks in a self-praising performance report card charting its contributions to the Chinese community and claimed credit for Putrajaya’s implementation of policies targeted towards recapturing Chinese support.\u003Cbr\u003E\u003Cbr\u003E“These are based on accurate figures, not spins like what the DAP does,”  MCA President Datuk Seri Dr Chua Soi Lek told reporters at the report card launch held at the party’s headquarters here.","created_at":"2014-04-07T23:34:46.435Z","updated_at":"2014-04-21T22:53:10.142Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/mca-issues-report-card-says-passed-with-flying-colours/","source_date":"2013-04-02","context":"","view_count":33,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":["flying colours"]},{"id":198,"player_id":53,"quote":"LGBT ( Lesbians, Gay, Bisexual, Transsexuals) can be cured","source":"Former deputy education minister says if you seek treatment early, particularly during secondary school years,  you can be \"cured\".\u003Cbr\u003E\u003Cbr\u003EBUKIT MERTAJAM: Lesbian, Gay, Bisexual and Transgender (LGBT) is akin to a social sickness that can be prevented and cured, said Deputy Education Minister Datuk Dr Mohd Puad Zarkashi.\u003Cbr\u003E \u003Cbr\u003EPuad said several non-governmental organisations had pledged to stop people from all walks of life, especially students in the secondary schools from getting involved in LGBT.\u003Cbr\u003E \u003Cbr\u003EHe said many people, including teachers had confessed to him that they were gays and managed to turn over a new leaf following repeated personal consultation.\u003Cbr\u003E \u003Cbr\u003E\"LGBT is curable so those who are in this category please seek help immediately,\" he said.\u003Cbr\u003E \u003Cbr\u003EPuad was speaking to reporters while officiating a LGBT seminar to discuss ways of overcoming fears to get treatment.\u003Cbr\u003E \u003Cbr\u003ERead more: LGBT can be cured: Puad Zarkashi - Latest - New Straits Times http://www.nst.com.my/latest/lgbt-can-be-cured-puad-zarkashi-1.210722#ixzz2zW6Oepq2","created_at":"2014-04-21T10:00:34.969Z","updated_at":"2014-04-21T22:51:22.598Z","source_url":"http://www.nst.com.my/latest/lgbt-can-be-cured-puad-zarkashi-1.210722","source_date":"2013-01-31","context":"","view_count":5,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Mohd Puad Zarkashi","tags":["LGBT","gay","foot in mouth"]},{"id":135,"player_id":39,"quote":"RIP was an assumption that the non-Muslim person would receive God's blessings.","source":"In a statement issued on its website, www.e-fatwa.gov.my, the National Fatwa Council said Muslims could express their condolences to non-Muslim families.\u003Cbr\u003E\u003Cbr\u003E\"Condolences can be expressed to a non-Muslim family as long as there are no religious implications,\" it said.\u003Cbr\u003E\u003Cbr\u003E\"Wishes such as 'I sympathise with what has happened to you' or 'we express our sadness at the loss in your family' are allowed.\u003Cbr\u003E\u003Cbr\u003E\"However, a Muslim is definitely not encouraged to wish a non-Muslim person 'Rest in Peace',\" the council said.\u003Cbr\u003E\u003Cbr\u003EThe council said RIP was an assumption that the non-Muslim person would receive God's blessings.\u003Cbr\u003E\u003Cbr\u003E\"It is similar to the Latin prayer of 'May his soul and the souls of all the departed faithful by God's mercy rest in peace’.\"\u003Cbr\u003E\u003Cbr\u003EThe council said this sentence was a form of prayer regularly used by Christians, especially during the 18th century and regularly engraved on tombstones.\u003Cbr\u003E\u003Cbr\u003E\"From an Islamic point of view, a person who has died in blasphemy will not receive God's forgiveness and blessings,\" it said.\u003Cbr\u003E\u003Cbr\u003EThe council's statement also said the wish also depended on the intentions of the individual saying “RIP”.","created_at":"2014-04-18T18:55:35.965Z","updated_at":"2014-04-21T22:45:24.431Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/muslims-not-encouraged-to-use-rip-says-national-","source_date":"2014-04-17","context":"","view_count":12,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"National Fatwa Council ","tags":["RIP"]},{"id":133,"player_id":33,"quote":"I think the plane is still in the air or has crashed into the sea.","source":"SEPANG: The mystery surrounding the missing Malaysia Airlines flight MH370 has captured the attention of a well-known ‘bomoh’ (shaman), Ibrahim Mat Zin.\u003Cbr\u003E\u003Cbr\u003EIbrahim, who is known as Raja Bomoh Sedunia Nujum VIP, arrived at the KL International Airport (KLIA) today, claiming to be invited by one of the country’s top leaders, to help locate the missing plane using a spiritual method and prayer.\u003Cbr\u003E\u003Cbr\u003E“We use fish trap hook and a bamboo binocular to look and ask for the victims to be found as soon as possible,” he told reporters here today.\u003Cbr\u003E\u003Cbr\u003EHe was also seen to have performed a prayer at the KLIA entrance.\u003Cbr\u003E\u003Cbr\u003E“During my prayer, my eyes hurt and my vision turned black. I think the plane is still in the air or has crashed into the sea.\u003Cbr\u003E\u003Cbr\u003E“I will come back here (to KLIA) in another two days after performing my prayers and I will bring something,” he said.\u003Cbr\u003E\u003Cbr\u003EAt the same time, Ibrahim also called on all quarters to pray for the safety those on board the missing flight.\u003Cbr\u003E\u003Cbr\u003EThe Raja Bomoh, who has 50 years of experience, became popular after offering his service to search for victims in several major cases, including in the Highland Tower tragedy, Kuala Dipang flood and the Mona Fendy murder case.\u003Cbr\u003E\u003Cbr\u003EBernama","created_at":"2014-04-18T18:27:23.307Z","updated_at":"2014-04-21T22:43:38.384Z","source_url":"http://www.freemalaysiatoday.com/category/nation/2014/03/10/missing-mh370-bomoh-vows-result-with-fis","source_date":"2014-03-10","context":"","view_count":20,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Mat Zin Sedunia Nujum","tags":["mh370"]},{"id":108,"player_id":33,"quote":"I'll slap you like a croc.","source":"In the original quote in Malay, Ibrahim said: \"Biar saya cakap terang-terang pada Khairy Jamaluddin. Saya cabar dia. Letak jawatan (sebagai menteri) dan saya letak jawatan sebagai mahaguru. Kita 'try fight'. Saya tampar dia macam buaya nanti, baru dia tahu.\"\u003Cbr\u003E\u003Cbr\u003E(Let me be frank with Khairy Jamaluddin. I challenge him. Resign (as minister) and I will resign as mahaguru. We try fighting. I will slap him like a crocodile, then he will know).","created_at":"2014-04-17T15:21:01.007Z","updated_at":"2014-04-21T22:43:19.806Z","source_url":"http://www.malaysiakini.com/news/257101","source_date":"2014-03-14","context":"","view_count":24,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Mat Zin Sedunia Nujum","tags":["crocodile","slapping"]},{"id":51,"player_id":16,"quote":"Muslim women could curb prostitution and domestic violence by becoming 'good whores' to their husbands.","source":"\"In Islam, if the husband wants sex and the wife is not in the mood, she has to give in to him,\" the Singapore club's co-founder Darlan Zaini said recently. \"If not, the angels will curse her. This is not good for the family.\"\u003Cbr\u003E\u003Cbr\u003EThe OWC, which launched in Jordan this year, opened a branch in Malaysia last month and in Indonesia last week. In Malaysia, it caused a furore when its international vice-president, Rohaya Mohamad, declared that, by becoming a \"good whore … to your husband\" and serving him \"better than a first-class prostitute\", women could help \"curb social ills like prostitution, domestic violence, human trafficking and abandoned babies\" – all of which she attributed to unfulfilled sexual needs.\u003Cbr\u003E","created_at":"2014-04-10T05:53:21.270Z","updated_at":"2014-04-21T22:42:13.402Z","source_url":"http://www.theguardian.com/world/2011/jul/06/outrage-at-obedient-wives-club-singapore?CMP=twt_gu","source_date":"2011-07-06","context":null,"view_count":77,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Obedient Wives Club","tags":[]},{"id":123,"player_id":4,"quote":"Creativity is something that you cannot measure, not like server and software","source":"He added that it was difficult to put a dollar figure to the creativity of the IT consultants used, which he suggested was the largest variable in the bill.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E“That creativity, I don’t know how much they will charge,” he told reporters after attending a fundraising dinner at SMJK Chong Hwa here.\u003Cbr\u003E\u003Cbr\u003E“It’s something that you cannot measure, not like the server and the software. That one you can quantify the amount.”\u003Cbr\u003E\u003Cbr\u003EDr Chua pointed out that the high-value of creativity was the reason the then 23-year-old Facebook creator Mark Zuckerberg was named youngest billionaire by Forbes in 2008.\u003Cbr\u003E\u003Cbr\u003EHe, nonetheless, said he will request from Ng the minutes of yesterday’s Cabinet meeting, which was convened to seek clarification from her on the RM1.8 million outlay.\u003Cbr\u003E\u003Cbr\u003EThe Malaysian Insider, quoting sources, reported yesterday that Ng had been told not to waste time by her fellow ministers after it became clear she had no intention of providing a breakdown of the costs.\u003Cbr\u003E","created_at":"2014-04-18T08:46:46.468Z","updated_at":"2014-04-21T22:42:01.556Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/soi-lek-says-tourism-facebook-pages-costlier-tha","source_date":"2011-06-18","context":"RM1.8mil Facebook spending","view_count":62,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":["Facebook","creativity","MCA","Tourism","corruption"]},{"id":34,"player_id":10,"quote":"Malaysians who are unhappy with the country’s political system should leave the country","source":"PETALING JAYA (MAY 16): Newly-appointed Home Minister Datuk Seri Ahmad Zahid Hamidi said Malaysians who are unhappy with the country’s political system should leave the country, stressing that loyal citizens should respect the rule of law.\u003Cbr\u003EIn his first opinion piece printed in Utusan Malaysia since receiving the portfolio yesterday, Ahmad Zahid wrote that the illegal gatherings held across the country by Pakatan Rakyat was a form of escapism and the denial of the fact that it failed to take control of Putrajaya.\u003Cbr\u003EThe minister added that the opposition was overconfident with the support it received from voters.\u003Cbr\u003E“Even if it is true that the opposition had claimed a greater majority, the measurement used by the opposition had been manipulated to follow the list system or the single transferable vote system,” he said in column entitled “Perhimpunan haram sebab tak terima hakikat gagal kuasai Putrajaya.” (Illegal gathering because refuses to accept failure in controlling Putrajaya)\u003Cbr\u003E","created_at":"2014-04-10T04:52:04.640Z","updated_at":"2014-04-21T22:41:54.852Z","source_url":"https://my.news.yahoo.com/home-minister-tells-unhappy-malaysians-emigrate-070125535.html","source_date":"2013-05-16","context":null,"view_count":18,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":213,"player_id":61,"quote":"The DAP is a chauvinistic party","source":"Former chief minister of Selangor claims that DAP is chauvinistic and if MCA supports DAP then MCA is also chauvinistic,\u003Cbr\u003E\u003Cbr\u003E“If MCA leaders support the DAP, they are chauvinists because the DAP is a chauvinist party. No one can deny that. In the party’s constitution, the DAP makes no mention of the Malays, Islam or the Indians. Although the party was started by an Indian, it remains a Chinese chauvinist party,” said Khir.\u003Cbr\u003E\u003Cbr\u003ESHAH ALAM: Selangor Umno opposition chief Dr Mohd Khir Toyo today claimed that some of his comrades from MCA are supporting the DAP and blasted them as “Chinese chauvinists”.","created_at":"2014-04-21T11:38:19.272Z","updated_at":"2014-04-21T22:38:44.930Z","source_url":"http://www.malaysia-today.net/you-are-chinese-chauvinists-khir-tells-mca-comrades/","source_date":"2010-08-03","context":"the DAP","view_count":6,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Khir Toyo","tags":["DAP","racist"]},{"id":194,"player_id":59,"quote":"Malaysia ini Negara Islam, you tak suka, you keluar dari Malaysia.","source":"Although the constitution declares Malaysia to be a secular state, there is much confusion on this subject. Several Muslims have argued, especially after former Prime Minister Mahathir bin Mohamad's declaration that Malaysia is an Islamic state, that Malaysia is in actual fact an Islamic state. One Member of Parliament (MP), Badruddin bin Amiruldin, has stated in the Dewan Rakyat house of Parliament that \"Malaysia ini negara Islam\" (\"Malaysia is an Islamic state\") and that \"you tidak suka, you keluar dari Malaysia!\" (\"You don't like it, you get out of Malaysia!\") Badruddin refused to take back his statement, and a motion to refer him to the House Committee of Privileges was rejected by a voice vote. [4] However, the first Prime Minister, Tunku Abdul Rahman, contradicted this stance in the 1980s, saying, \"All talk on Islamic States is just an empty dream. No man in his right sense would accept a nation which bases its political administration on religion, and in a country like Malaysia with its multi-racial and multi-religious people, there is no room for an Islamic State.\"\u003Cbr\u003E","created_at":"2014-04-21T09:56:52.571Z","updated_at":"2014-04-21T22:37:42.924Z","source_url":"http://www.youtube.com/watch?v=pkqyhBDU5HM","source_date":"2006-04-25","context":"","view_count":17,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Badruddin Amiruddin","tags":["islam","religion","get out"]},{"id":55,"player_id":17,"quote":"The Shariah Court is on par with civil court","source":"The Shariah Court is on par with the civil court under amendments to Article 121 (1A) of the Federal Constitution in June 1988, the Muslim Lawyers' Association of Malaysia told the Ipoh High Court today.\u003Cbr\u003E\u003Cbr\u003ELawyer Mohamed Hanif Khatri Abdulla (crt) said this was supported by the Federal Court which had made judicial pronouncements on three occasions between 1992 and 2008.\u003Cbr\u003E","created_at":"2014-04-10T08:25:32.200Z","updated_at":"2014-04-21T22:32:55.338Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/shariah-court-is-on-par-with-civil-court-say-muslim-lawyers-group","source_date":"2014-04-09","context":null,"view_count":35,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Muslim Lawyers Association","tags":[]},{"id":24,"player_id":7,"quote":"I will be a taxi driver","source":"http://www.malaysiakini.com/news/234714","created_at":"2014-04-10T00:24:29.548Z","updated_at":"2014-04-21T22:32:30.865Z","source_url":"http://www.malaysiakini.com/news/234714","source_date":"2013-07-03","context":"","view_count":40,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Ali","tags":["taxi","driver"]},{"id":62,"player_id":26,"quote":"He is a bloody racist","source":"(Free Malaysia Today) - A cabinet minister has called former prime minister Tun Dr Mahathir Mohamad a “bloody racist” and chided the Umno-owned newspaper Utusan Malaysia for its “denial sydrome.”\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EThe outburst came from Minister in the Prime Minister’s Department Datuk Seri Nazri Aziz, according to the online newspaper Malaysian Insider.\u003Cbr\u003ENazri was criticising Dr Mahathir for defending Biro Tata Negara (BTN) courses.\u003Cbr\u003EHe reasserted the Cabinet’s decision to overhaul the BTN programme, saying there was nothing to hide because “everybody knows what the BTN is.”\u003Cbr\u003EOf Utusan Malaysia, he said its “denial syndrome” was making him laugh.","created_at":"2014-04-13T02:34:22.559Z","updated_at":"2014-04-21T22:29:37.184Z","source_url":"http://www.malaysia-today.net/dr-m-a-bloody-racist-says-nazri/","source_date":"2009-12-07","context":"Mahathir","view_count":38,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Nazri Abdul Aziz","tags":["mahathir","racist"]},{"id":26,"player_id":10,"quote":"Too many newspapers will confuse Malaysians","source":"KUALA LUMPUR: The Home Ministry had rejected FZ Daily and Malaysiakini’s application for publishing permits to protect the public from the confusion of having access to “too much news”.\u003Cbr\u003E“The (number of) newspaper publications with approved publishing permits is sufficient considering the number of readers in the country,” Home Minister Ahmad Zahid Hamidi said in a parliamentary written reply Tuesday.\u003Cbr\u003E“Denying the applications from FZ Daily and Malaysiakini is an early step towards controlling the flood of newspaper publications that may confuse the people if there are too many news being published by all sorts of newspapers.”\u003Cbr\u003EHe added that Malaysiakini and FZ Daily – both online portals – were seen to be inclined towards publishing sensational and controversial news just to attract readers.\u003Cbr\u003E","created_at":"2014-04-10T04:32:17.304Z","updated_at":"2014-04-21T22:24:32.991Z","source_url":"http://www.freemalaysiatoday.com/category/nation/2014/03/27/zahid-too-many-newspapers-will-confuse-msians/","source_date":"2014-03-27","context":null,"view_count":67,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":188,"player_id":51,"quote":"Mempersilakan Datin Paduka Rafidah Aziz naik ke pentas untuk membuka kain","source":"[Source Needed: Please email us]","created_at":"2014-04-21T09:46:14.987Z","updated_at":"2014-04-21T22:22:49.620Z","source_url":"","source_date":"1992-12-15","context":"","view_count":48,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Samy Vellu","tags":[]},{"id":13,"player_id":10,"quote":"Slapping is not a threat. If they say murder, then it is a threat.","source":"The focus of the group was Kok and her Chinese New Year greeting video, entitled \"Onederful Malaysia CNY 2014”. They later smeared the blood of the chickens on a banner featuring photographs of Kok and other DAP leaders.\u003Cbr\u003E\u003Cbr\u003EEarlier today, Zahid, when met by The Malaysian Insider, questioned the need for the police to probe the protesters.\u003Cbr\u003E\u003Cbr\u003E\"Why do we need to investigate that? Slapping is not a threat. If they say murder, then it is a threat,\" he said, adding action would only be taken if the act were carried out.\u003Cbr\u003E\u003Cbr\u003EResponding to this, some cheeky Twitter users such as @slaveration said, “Zahid Hamidi come over here and let me slap you”.\u003Cbr\u003E","created_at":"2014-04-09T09:08:34.220Z","updated_at":"2014-04-21T22:21:26.658Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/netizens-poke-fun-at-zahid-after-his-dismissal-of-slap-threat-by-protesters","source_date":"2014-02-08","context":"Teresa Kok","view_count":18,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":["slapping"]},{"id":88,"player_id":5,"quote":"I can find it in one second","source":"PUTRAJAYA: Prime Minister Datuk Seri Najib Tun Razak has taken to task an opposition leader who claimed that he could solve the mystery of the missing Malaysia Airlines flight MH370 “in a second” if he were in power.\u003Cbr\u003E\u003Cbr\u003EWithout naming the leader, Najib said it was ludicrous for him to make such a claim when a multi-nation effort had yet to locate the missing jetliner.\u003Cbr\u003E\u003Cbr\u003E“The remark by the opposition leader is illogical and it makes Malaysians in general look foolish,” Najib said at the monthly meeting of the Finance Ministry here yesterday.\u003Cbr\u003E\u003Cbr\u003EHe said the search for Flight MH370 needed the support of countries within and outside the region due to the complexity and its unprecedented challenges.\u003Cbr\u003E\u003Cbr\u003EOn April 5, a Chinese newspaper published an interview by the Southern Weekly magazine with Opposition Leader Datuk Seri Anwar Ibrahim which quoted him as saying that if he were the Prime Minister, he would take only one second to solve the issue of the missing MH370.\u003Cbr\u003E","created_at":"2014-04-16T08:14:12.437Z","updated_at":"2014-04-21T22:20:58.340Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/16/PM-slams-opposition-leaders-MH370-boast-Najib-Even-multination-effort-has-yet-to-find-plane","source_date":"2014-04-16","context":"MH370","view_count":115,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Anwar Ibrahim","tags":["mh370"]},{"id":208,"player_id":54,"quote":"Tanam sendiri sayur kekang kenaikan harga pasaran","source":"Former minister encourages citizens to plant their own veges to curb the surging market price of vegetables.","created_at":"2014-04-21T10:35:03.814Z","updated_at":"2014-04-21T22:19:50.687Z","source_url":"http://www.utusan.com.my/utusan/info.asp?y=2010\u0026dt=1213\u0026pub=Utusan_Malaysia\u0026sec=Dalam_Negeri\u0026pg=dn_06.htm","source_date":"2010-12-13","context":"","view_count":10,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ismail Sabri Yaakob","tags":["price hikes","harga naik","foot in mouth"]},{"id":127,"player_id":21,"quote":"His English is poor","source":"As the multinational search and rescue mission for MH370 continues, both Lim Guan Eng and MCA chose to trade insults instead after the former used the incident to launch the first strike.\u003Cbr\u003E\u003Cbr\u003EIn a below-the-belt swipe at his political nemesis, Lim said it was fortunate that MCA president Liow Tiong Lai did not assume the transport minister post before the plane disappeared.\u003Cbr\u003E\u003Cbr\u003EAccording to China Press, the Penang chief minister said in a speech that Liow, with his poor command of English, would not have been able to handle the international media.\u003Cbr\u003E\u003Cbr\u003E\"Luckily, Liow is not the transport minister,\" Lim quipped at a function.\u003Cbr\u003E\u003Cbr\u003EIn an equally poor response, MCA's publicity chief Chai Kim Sen described the DAP secretary-general as being \"brain damaged\".\u003Cbr\u003E\u003Cbr\u003EChai noted that Lim had admitted that he too did not dare converse in English with the older generation whose command was \"too good\" but yet had the audacity to criticise Liow's language skills.\u003Cbr\u003E\u003Cbr\u003EHe conceded that Liow might not be well-versed in certain English phrases such as \"you print, I sue\", in a sarcastic reference to Lim's defamation suit against newspapers.\u003Cbr\u003E","created_at":"2014-04-18T09:01:19.111Z","updated_at":"2014-04-21T22:17:23.660Z","source_url":"http://www.malaysiakini.com/news/257798","source_date":"2014-03-21","context":"Liow Tiong Lai","view_count":101,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Lim Guan Eng","tags":["English","MCA"]},{"id":105,"player_id":31,"quote":"The Muslim court should be universal","source":"KUALA LUMPUR, April 16 — Insisting that Islam is the pre-eminent religion in Malaysia, a former judge has joined a growing chorus for the Shariah court to expand its jurisdiction to cover non-Muslims, as controversy rages over child custody in a mixed-faith marriage.\u003Cbr\u003E\u003Cbr\u003ERetired Court of Appeals judge Datuk Mohd Noor Abdullah disagreed that the civil court should have jurisdiction over child support and custody disputes between a non-Muslim and the spouse who has converted to Islam, even though the couple’s marriage was registered at the civil court.\u003Cbr\u003E\u003Cbr\u003E“You forgot that Islam is the religion of the state. It puts Islam at a different level,” Mohd Noor told The Malay Mail Online and Bernama in a joint-interview yesterday.\u003Cbr\u003E\u003Cbr\u003EThe judge, who retired in 2006, stressed that Islam is the “national religion”, citing Article 3(1) of the Federal Constitution which states that Islam is the “religion of the Federation”.\u003Cbr\u003E","created_at":"2014-04-17T09:48:56.868Z","updated_at":"2014-04-21T22:15:29.778Z","source_url":"http://www.themalaymailonline.com/malaysia/article/muslim-court-should-be-universal-says-ex-judge-am","source_date":"2014-04-16","context":"","view_count":10,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Mohd Noor Abdullah","tags":["judiciary","islam","conversion"]},{"id":21,"player_id":7,"quote":"Malaysian men have extramarital sex because of wives who neglect their responsibilities.","source":"Malaysian men have extramarital sex because of \"wives who neglect their responsibilities\" to their husbands, a Malaysian MP has told his country's Parliament, outraging women's groups.\u003Cbr\u003E\"Husbands driving home after work see things that are sexually arousing and go to their wives to ease their urges,\" said independent lawmaker Ibrahim Ali, according to online portal Malaysiakini.\u003Cbr\u003E\"But when they come home to their wives, they will say, 'wait, I'm cooking,' or 'wait, I'm getting ready to visit relatives,'\" Mr Ibrahim said.\u003Cbr\u003E\"In Islam, wives are supposed to stop everything to fulfil their husband's demands.\"\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E","created_at":"2014-04-10T00:15:24.601Z","updated_at":"2014-04-21T22:13:29.723Z","source_url":"http://www.smh.com.au/world/men-have-affairs-because-wives-neglect-their-responsibilities-mp-tells-parliament-20110408-1d6k7.html","source_date":"2011-04-08","context":null,"view_count":35,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Ali","tags":[]},{"id":104,"player_id":30,"quote":"Who wants to challenge Karpal Singh? Please submit your name.","source":"As the nation mourns the passing of a great politician, BN MP Datuk Nawawi Ahmad insulted the late Karpal Singh by posting a picture of the veteran politician's blood-smeared face as he lay in his Toyota Alphard following a tragic accident this morning.\u003Cbr\u003E\u003Cbr\u003EAlong with the Facebook picture was a newspaper cutting on Karpal being opposed to the implementation of hudud laws in the country.\u003Cbr\u003E\u003Cbr\u003ENawawi also posted a comment which read: \"Siapa nak sambut cabaran karpal singh? Sila bagi nama he he.\"\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E(Who wants to challenge Karpal Singh? Please submit your name.)\u003Cbr\u003E\u003Cbr\u003EHe wrote this in reference to the newspaper article which quoted Karpal as saying: \"Mahu wujudkan negara Islam langkah mayat kami dulu – Karpal Singh.\"\u003Cbr\u003E\u003Cbr\u003E","created_at":"2014-04-17T06:03:42.542Z","updated_at":"2014-04-21T22:12:45.479Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/langkawi-bn-mp-pokes-fun-at-karpal-singhs-remain","source_date":"2014-04-16","context":"Karpal Singh's car accident","view_count":15,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Nawawi Ahmad","tags":["islam","Offensive","Hudud"]},{"id":35,"player_id":10,"quote":"The time for warnings is over, stern action will be taken.","source":"Petaling Jaya (The Star/ANN) - Malaysian Home Minister Dr Ahmad Zahid Hamidi said there will be no more warnings against those bent on taking part in illegal rallies and assemblies that could disrupt peace and stability in the country.\u003Cbr\u003E\"The time for warnings is over ...stern action will be taken,\" he said, adding that \"prevention is better than cure\" and immediate action is, thus, justified.\u003Cbr\u003EAhmad Zahid said this when contacted over the spate of illegal rallies nationwide to denounce the GE13 results and the recent arrest of student activist Adam Adli Abdul Halim over alleged seditious statements made at a May 13 forum in Kuala Lumpur.\u003Cbr\u003E","created_at":"2014-04-10T04:53:09.156Z","updated_at":"2014-04-21T22:11:08.124Z","source_url":"https://my.news.yahoo.com/msia-impose-stern-action-against-rally-goers-040005703.html","source_date":"2013-05-20","context":"Post-GE13 rallies","view_count":9,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":147,"player_id":36,"quote":"Doesn't matter how much, all 'pao' lah inside!","source":"\u003Ca href=\"http://imgur.com/m8XugUe\"\u003E\u003Cimg src=\"http://i.imgur.com/m8XugUe.jpg\" width=\"100%\" title=\"Ng Yen Yen Pao\" /\u003E\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/LBtlTJxfzzA?hl=en_GB\u0026amp;version=3\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/LBtlTJxfzzA?hl=en_GB\u0026amp;version=3\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-19T22:39:44.850Z","updated_at":"2014-04-21T22:10:00.778Z","source_url":"http://www.youtube.com/watch?v=LBtlTJxfzzA","source_date":"2011-07-12","context":"RM1.8mil Facebook spending","view_count":18,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["events","Tourism"]},{"id":94,"player_id":29,"quote":"The Gods had to be sold off cheap. Hindus bought the deities cheap","source":"\u003Cobject width=\"420\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/Lj8Dp-RBokU?version=3\u0026amp;hl=en_GB\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/Lj8Dp-RBokU?version=3\u0026amp;hl=en_GB\" type=\"application/x-shockwave-flash\" width=\"420\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E\u003Cbr\u003E\u003Cbr\u003EPETALING JAYA: Independent MP for Kulim-Bandar Baharu Zulkifli Noordin has belittled Hindu deities in a 5:34 minute video clip available on social networking site, Facebook.\u003Cbr\u003E\u003Cbr\u003EZulkifli questions the concept of God and the purity of Hindus in what appears to be a recording at a ceramah.\u003Cbr\u003E\u003Cbr\u003EHe recalls his conversation with a Hindu deity trader in the Masjid India area in Kuala Lumpur whose business was hit by a flood.\u003Cbr\u003E\u003Cbr\u003E“I asked, was God hit by the flood and he said ‘yes’.” he said.\u003Cbr\u003EZulkifli then said God is supposed not to get hit by the flood.\u003Cbr\u003E“Why didn’t you line up the Gods in front of your shop to stop the flood from entering your shop and divert it to the Muslim shops?\u003Cbr\u003E“Why didn’t you do that since God is suppose to protect us? (God) cannot even stop the water? And the trader tells me, ‘brother, thats a stone’.\u003Cbr\u003E“The Gods had to be sold off cheap. Hindus bought the deities cheap,” he added.\u003Cbr\u003E","created_at":"2014-04-17T03:26:05.287Z","updated_at":"2014-04-21T22:08:26.433Z","source_url":"http://www.freemalaysiatoday.com/category/nation/2013/03/28/mp-belittles-hindu-beliefs/","source_date":"2013-03-28","context":"","view_count":28,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["Hindus","Offensive","God"]},{"id":30,"player_id":10,"quote":"Quit if you're not happy with police actions","source":"Former Hindraf leader P Waythamoorthy should resign from his Cabinet position if he wants to act like a representative of a non-governmental organisation, said Home Minister Datuk Seri Dr Ahmad Zahid Hamidi (pic).\u003Cbr\u003E\u003Cbr\u003E\"In the war against crime, there should be no quarter given to criminals,\" Ahmad Zahid said, referring to Waythamoorthy's criticism over the shootout in Penang.\u003Cbr\u003E\u003Cbr\u003E\"If an individual who once led an NGO, issues negative statements which bear the hallmarks of his past, then he should just resign from his position in the Cabinet,\" he said.\u003Cbr\u003E","created_at":"2014-04-10T04:45:05.093Z","updated_at":"2014-04-21T22:08:18.591Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/just-quit-if-not-happy-with-police-actions-zahid-tells-waytha","source_date":"2013-08-24","context":null,"view_count":19,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":129,"player_id":37,"quote":"DAP seditious for calling Muhyiddin seditious","source":"KUALA LUMPUR, August 5 ― The DAP's claim that Tan Sri Muhyiddin Yassin was seditious for allegedly blaming non-Muslims for an increase in anti-Islam sentiments falls foul of the same law and threatens national harmony, the Malay Consultative Council (MPM) said today.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E \u003Cbr\u003EThe coalition of Malay rights groups defended the deputy prime minister from what it called provocation aimed at dividing the Malays, adding that Muhyiddin, as a Muslim leader, had every right to speak up amid purported attempts by “certain quarters” to incite religious tension.\u003Cbr\u003E\u003Cbr\u003E“In a situation where Islam is constantly insulted and threatened, not only in Malaysia, of course a Muslim leader like the (deputy prime minister) to express his concern over a trend that should not be allowed to spread, especially in the country.\u003Cbr\u003E\u003Cbr\u003E“He has the right to criticise,” the group said in a statement.\u003Cbr\u003E\u003Cbr\u003EA task force has been set up to study the contents of some of the speeches made by the DAP leaders that the coalition deemed seditious, added MPM.\u003Cbr\u003E\u003Cbr\u003E“We are taking this action because there are signs that the provocations are premeditated and there is a continuous attempt to divide the Muslims and Islam in Malaysia”.\u003Cbr\u003E\u003Cbr\u003E \u003Cbr\u003E- See more at: http://www.themalaymailonline.com/malaysia/article/dap-seditious-for-calling-muhyiddin-seditious-says-malay-group#sthash.TdliXrR9.dpuf","created_at":"2014-04-18T09:09:33.339Z","updated_at":"2014-04-21T22:04:39.323Z","source_url":"http://www.themalaymailonline.com/malaysia/article/dap-seditious-for-calling-muhyiddin-seditious-say","source_date":"2013-08-05","context":"","view_count":18,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Malay Consultative Council","tags":["Malays","DAP"]},{"id":159,"player_id":48,"quote":"The people should realise that they have been fooled for a long time. ","source":"KUALA LUMPUR, April 15 — Malaysia’s civil law and shariah systems are not parallels, Datuk Zaid Ibrahim said today when criticising “weak” Muslim leaders for perpetuating the “false” view that has led to controversial interfaith child custody disputes.\u003Cbr\u003E\u003Cbr\u003EThe former de facto law minister lambasted Muslim leaders in both the ruling Barisan Nasional (BN) coalition and opposition pact Pakatan Rakyat (PR) for their hypocrisy, saying neither were willing to admit that Malaysia was founded as a secular democracy.\u003Cbr\u003E\u003Cbr\u003EAt the same time, however, he said they also refused to openly embrace an Islamic theocracy for fear of losing their privileges.\u003Cbr\u003E\u003Cbr\u003E“These Muslim leaders are a weak bunch, fearful of being honest with the people because what’s paramount for them is holding the seat of power,” Zaid wrote on his blog, zaid.my, yesterday.\u003Cbr\u003E\u003Cbr\u003E“The people should realise that they have been fooled for a long time, and must now collectively stand up and be counted. We cannot live with this charade forever,” he added.\u003Cbr\u003E\u003Cbr\u003EZaid stressed that Shariah laws in the country are applicable to Muslims only in “selected matters”.\u003Cbr\u003E\u003Cbr\u003E“Personal laws for Muslims are part of the main system and they are not meant to override the main body of laws in the country. Yet no one is prepared to publicly declare that the civil High Court is the superior court under the Constitution,” he said.\u003Cbr\u003E\u003Cbr\u003E“It’s illogical to say we have two systems coexisting in parity when they are totally different in scope and power. Our civil courts must be able to make a ruling to determine if the Shariah Court has applied the law correctly; otherwise, what we get is the chaos we are seeing today,” added Zaid, who had served as de facto law minister in the Abdullah administration.\u003Cbr\u003E\u003Cbr\u003EThe boundaries between the civil and Shariah court's jurisdictions have been blurred recently again with a bitter child custody dispute between a Hindu woman and her estranged Muslim convert husband.\u003Cbr\u003E\u003Cbr\u003EOn April 7, the Seremban High Court had granted S. Deepa full custody of her two children ― a nine-year-old daughter and a six-year-old son ― with N. Viran who later embraced Islam after they got married.\u003Cbr\u003E\u003Cbr\u003EThe ruling said the couple’s marriage was a civil union and was outside the jurisdiction of the Shariah courts.\u003Cbr\u003E\u003Cbr\u003EBut 48 hours after losing the custody dispute in the civil court, Viran ― who was earlier granted child custody by the Shariah court ― took their son from outside his estranged wife’s house in Jelebu, Negri Sembilan.\u003Cbr\u003E\u003Cbr\u003EThe police have refused to act on the Hindu mother’s abduction report against the child’s father, with Inspector-General of Police Tan Sri Khalid Abu Bakar citing the two conflicting court orders as the reason.\u003Cbr\u003E\u003Cbr\u003EZaid said yesterday that if “weak Muslim leaders” in peninsular Malaysia really want to elevate shariah above everything else, they should amend the Federal Constitution and declare unequivocally that Islamic laws are the foundation of all laws.\u003Cbr\u003E\u003Cbr\u003E“Then the Shariah Court will be superior to the High Court. We might not even need the High Court by then. It would then also be opportune to declare that the Quran is the highest law of the land and that the Federal Constitution is subject to it.\u003Cbr\u003E\u003Cbr\u003E“At least then we would know where we stand. These leaders must not be allowed to continue confusing everybody, including our policemen,” said the outspoken politician.\u003Cbr\u003E\u003Cbr\u003EZaid also criticised the police for saying that a father could not possibly abduct his own son.\u003Cbr\u003E\u003Cbr\u003E“This same policeman will one day say that a husband could not possibly rape his wife, or that any sexual crime requires four witnesses, regardless of what the law says,” he said.\u003Cbr\u003E\u003Cbr\u003EIn the Seremban case, Viran — who has adopted the Muslim name, Izwan Abdullah — managed to convert his children to Islam last year without his wife's knowledge, despite a Cabinet decision in 2009 prohibiting children from being converted to Islam without the consent of both parents.\u003Cbr\u003E\u003Cbr\u003EA committee under Datuk Seri Mohamed Nazri Aziz, who was de facto law minister then, had proposed amendments to the Law Reform (Marriage and Divorces) Act and the Federal Territory Islamic Enactment to protect minors from being converted to Islam, but five years on, the amendments have yet to be tabled in Parliament.\u003Cbr\u003E\u003Cbr\u003EIslam is listed in the constitution as the religion of the federation, but some including former prime minister Tun Dr Mahathir Mohamad interpret this to mean that Malaysia is an Islamic state.\u003Cbr\u003E- See more at: http://www.themalaymailonline.com/malaysia/article/zaid-malaysia-does-not-have-dual-legal-system#sthash.MyiTC9Q6.dpuf","created_at":"2014-04-20T17:49:00.891Z","updated_at":"2014-04-21T22:03:49.855Z","source_url":"http://www.themalaymailonline.com/malaysia/article/zaid-malaysia-does-not-have-dual-legal-system","source_date":"2014-04-15","context":"","view_count":17,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zaid Ibrahim","tags":[]},{"id":97,"player_id":29,"quote":"Apologising to the Malays is almost insulting for the DAP","source":"According to Zulkifili topping the list of these seven threats were not Christians, liberals, Hindus, or Buddhists, but the DAP.\u003Cbr\u003EZulkifli identified the opposition party as the “main threat” to the “Malay-Muslim race” for being allegedly chauvinistic, racist, extremists and anti Malay-Muslim.\u003Cbr\u003EHe brought up as an example Jelutong MP Jeff Ooi’s forced open apology to the Penang Municipal Council staff for calling them ‘kucing kurap’ (mangy cat) last Sunday.\u003Cbr\u003E“The DAP’s delegates booing and mocking of Jeff Ooi when he was forced to apologise for his rude remarks to the predominantly Malay staff of the Penang Municipal Council proves how chauvinistic and racist they are.\u003Cbr\u003E“Apologising to the Malays is almost insulting for the DAP!” said Zulkifli, apparently forgetting that it was DAP chairman Karpal Singh himself who had called for Ooi to make the public apology, and that race had never been a part of the issue.\u003Cbr\u003E","created_at":"2014-04-17T03:41:23.977Z","updated_at":"2014-04-21T22:03:47.936Z","source_url":"http://www.freemalaysiatoday.com/category/nation/2013/12/07/beware-the-christians-malay-liberals-and-spore/","source_date":"2013-12-07","context":"Jelutong MP Jeff Ooi’s apology","view_count":17,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["Malays","DAP"]},{"id":93,"player_id":29,"quote":"Many Indians are fighting to buy statues of the elephant god, even the one with its trunk broken off","source":"\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/JBAEYhAeBvg?version=3\u0026amp;hl=en_GB\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/JBAEYhAeBvg?version=3\u0026amp;hl=en_GB\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E\u003Cbr\u003E\u003Cbr\u003EZulkifli also appeared to mock what he described as a rush to buy up the broken idols.\u003Cbr\u003E\u003Cbr\u003E“Many Indians are fighting to buy statues of the elephant god, even the one with its trunk broken off… I asked him why they were buying this god, [when] the trunk is broken. He said, ‘never mind we’ll mend it back on’,” said lawmaker who was sacked from PKR.\u003Cbr\u003E\u003Cbr\u003EThis is the second incident of the year in which Hindus were the apparent target.\u003Cbr\u003E","created_at":"2014-04-17T03:23:33.643Z","updated_at":"2014-04-21T22:03:04.204Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/zul-noordin-asks-why-hindu-gods-did-not-stop-flood/","source_date":"2013-03-29","context":"","view_count":24,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["Hindu","Indians","Offensive"]},{"id":173,"player_id":51,"quote":"Orang-orang muda sekarang banyak suka hisap dada.","source":"Needs reputable source, please email us.","created_at":"2014-04-21T09:00:39.747Z","updated_at":"2014-04-21T22:02:19.977Z","source_url":"","source_date":"1992-12-15","context":"","view_count":27,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Samy Vellu","tags":[]},{"id":92,"player_id":29,"quote":"How can you say it’s pure? There are chicken carcasses and small sticks floating.","source":"KUALA LUMPUR, March 29 ― Perkasa vice-president Datuk Zulkifli Noordin has been slammed by Hindu leaders after delivering a religious lecture recently in which he tells of how he questioned an Indian trader here on why Hindu gods did not prevent the man’s shop from being flooded.\u003Cbr\u003E\u003Cbr\u003EThe independent Kulim-Bandar Baharu lawmaker also questioned the purity of the Ganges River, also known as Ganga in India, which is considered sacred by Hindus.\u003Cbr\u003E","created_at":"2014-04-17T03:22:38.143Z","updated_at":"2014-04-21T22:02:18.832Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/zul-noordin-asks-why-hindu-gods-did-not-stop-flood/","source_date":"2013-03-29","context":"the Ganges river","view_count":22,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["Hindu","islam"]},{"id":164,"player_id":41,"quote":"Barang naik jangan salahkan BN","source":"\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/hN865jJQkf4?version=3\u0026amp;hl=en_GB\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/hN865jJQkf4?version=3\u0026amp;hl=en_GB\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-21T02:02:09.064Z","updated_at":"2014-04-21T22:01:58.591Z","source_url":"http://www.youtube.com/watch?v=hN865jJQkf4","source_date":"2011-10-12","context":"","view_count":10,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Bung Mokhtar Radin","tags":["price hike","barang naik","BN"]},{"id":136,"player_id":34,"quote":"Don’t play the fool.","source":" a catchphrase of sorts for the statesman, Karpal Singh said this on many occasions – to the Registrar of Societies when his beloved party was faced with the threat of deregistration, after being sent live bullets by thugs.","created_at":"2014-04-18T19:26:52.926Z","updated_at":"2014-04-21T21:57:01.105Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/18/Dont-play-the-fool-and-other-quotes-by-Karpal-Singh","source_date":"2014-04-19","context":"","view_count":27,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Karpal Singh","tags":[]},{"id":211,"player_id":56,"quote":"Hitam metalik, haram jadah.","source":"A racist remark on the current chief minister of Perak, after the takeover by the National Front. The MP from Taiping later apologised for the inflammatory statement.\u003Cbr\u003E\u003Cbr\u003E“He should have known racial undertones were never acceptable in Malaysia. It is silly for him to be doing that. I believe they (the party discplinary committee)  are doing something,” he said when asked about possible action against Nga.\u003Cbr\u003E \u003Cbr\u003ENga, during a political talk (ceramah) in Kamunting had reportedly said Perak has a Menteri Besar “yang hitam metalik, yang haram jadah itu, masuk dari pintu belakang,” abviously referring to Zambry.\u003Cbr\u003E \u003Cbr\u003EA short video clip of the insulting speech was posted in several blogs including Rocky’s Bru. \u003Cbr\u003E \u003Cbr\u003EMeanwhile DAP deputy chairman and Kepong MP Dr Tan Seng Giaw said that the allegations against Nga must be proven before any action could be considered.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Ehttp://www.mole.my/content/action-must-be-taken-against-nga-kor-ming","created_at":"2014-04-21T10:52:45.789Z","updated_at":"2014-04-21T21:55:15.175Z","source_url":"http://www.youtube.com/watch?v=O8c8OlQN4cQ","source_date":"2011-09-08","context":"Perak Menteri Besar","view_count":15,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Nga Kor Ming","tags":["racist","foot in mouth"]},{"id":185,"player_id":51,"quote":"Besoh kirim, hari ini juga sampai","source":"","created_at":"2014-04-21T09:44:36.686Z","updated_at":"2014-04-21T21:54:34.603Z","source_url":"","source_date":"1992-12-15","context":"on context","view_count":38,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Samy Vellu","tags":["tag1","tag2"]},{"id":143,"player_id":40,"quote":"Secularism in Malaysia will lead to apostasy","source":"Apabila seseorang muslim mengatakan mereka ingin Malaysia menjadi negara sekular, adakah mereka faham implikasinya kepada status Islamnya? Sekular bermaksud penolakan agama. Negara sekular bermaksud negara yang tidak membenarkan agama mencampuri urusan pentadbiran, pembentukan polisi dan segala yang berkait dengan negara.\u003Cbr\u003E\u003Cbr\u003ESeorang muslim tidak sepatutnya mengeluarkan pendapat sebegitu kerana ia amat bertentangan dengan teras Islam.\u003Cbr\u003E\u003Cbr\u003EIslam adalah agama syumul yang merangkumi segenap sudut kehidupan. Allah juga mahukan muslim menerima Islam dengan kesyumulannya itu.  Firman Allah yang bermaksud:\u003Cbr\u003E\u003Cbr\u003E“Wahai orang-orang yang beriman! Masuklah kamu ke dalam agama Islam (dengan mematuhi) segala hukum-hukumnya; dan janganlah kamu menurut jejak langkah syaitan; Sesungguhnya syaitan itu musuh bagi kamu yang terang nyata.” (Al-Baqarah: 208)\u003Cbr\u003E","created_at":"2014-04-18T20:14:22.800Z","updated_at":"2014-04-21T21:53:14.943Z","source_url":"http://www.ismaweb.net/2014/04/boleh-jatuh-murtad-jika-mahu-malaysia-jadi-sekular/","source_date":"2014-04-17","context":"","view_count":8,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ikatan Muslimin Malaysia","tags":["islam","secularism","religion","isma"]},{"id":6,"player_id":6,"quote":"We can have Chinese Perkasa and even Indian Perkasa","source":"Tan Sri Muhyiddin Yassin said today that anyone was free to form an association, including Chinese or Indian versions of the Malay rights group, Perkasa. \u003Cbr\u003E\u003Cbr\u003E“We can have Chinese Perkasa and even Indian Perkasa,” he said today. He said that it was an individual’s right to form an association and it was acceptable as long as it was formed with good intentions. \u003Cbr\u003E\u003Cbr\u003EHe said that it was an individual’s right to form an association and it was acceptable as long as it was formed with good intentions.\u003Cbr\u003E","created_at":"2014-04-07T23:35:10.676Z","updated_at":"2014-04-21T21:50:30.260Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/muhyiddin-all-can-form-own-perkasa/","source_date":"2013-07-13","context":null,"view_count":38,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Muhyiddin Yassin","tags":[]},{"id":8,"player_id":6,"quote":"I am a Malay first, Malaysian Second","source":"Deputy Prime Minister Tan Sri Muhyiddin Yassin says he is a Malay first but that does not mean that he is not a Malaysian at heart.\u003Cbr\u003E\u003Cbr\u003EHe said he would be shunned by all the Malays if he were to say that he is a Malaysian first and a Malay second.\u003Cbr\u003E\u003Cbr\u003EMuhyiddin said this in response to DAP adviser Lim Kit Siang’s challenge for him to resign if he refused to admit that he is a Malaysian first and a Malay second as proof that he was in full support of the 1Malaysia concept.\u003Cbr\u003E\u003Cbr\u003E“I will not bow to his demand. He can repeat it a thousand times. I am a Malay first but I want to say that being a Malay does not mean that you are not a Malaysian,” he told reporters in Parliament yesterday.\u003Cbr\u003E","created_at":"2014-04-07T23:35:35.011Z","updated_at":"2014-04-21T21:50:15.047Z","source_url":"http://www.thestar.com.my/story.aspx/?file=%2f2010%2f4%2f1%2fnation%2f5976477","source_date":"2010-04-01","context":null,"view_count":58,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Muhyiddin Yassin","tags":[]},{"id":64,"player_id":26,"quote":"We have to start accepting that we are all different and think of ourselves as Malaysians first","source":"Datuk Seri Mohamed Nazri Abdul Aziz believes that his contributions to Malaysia pale in comparison to that of Datuk Nicol David or Datuk Lee Chong Wei, who both wield racquets in the country's name.\u003Cbr\u003E\u003Cbr\u003E“I am nothing compared to Nicol’s contributions. She has done so much for Malaysia on the world stage,” the Umno veteran and Tourism and Culture Minister tells The Malaysian Insider.\u003Cbr\u003E\u003Cbr\u003EYet the pride that he expresses towards the world squash champion and badminton ace is tempered with pain when he thinks of how some Malay-Muslims feel towards people like Nicol and Lim.\u003Cbr\u003E\u003Cbr\u003E","created_at":"2014-04-13T02:40:58.071Z","updated_at":"2014-04-21T21:45:19.045Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/after-50-years-time-to-think-as-malaysians-first-says-nazri","source_date":"2013-09-12","context":"Race relations","view_count":39,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Nazri Abdul Aziz","tags":["race","Malaysia"]},{"id":101,"player_id":3,"quote":"Shut up. Really, shut up.","source":"\u003Ca href=\"http://imgur.com/sMiiij7\"\u003E\u003Cimg src=\"http://i.imgur.com/sMiiij7.png\" title=\"Hosted by imgur.com\" width=\"80%\" /\u003E\u003C/a\u003E","created_at":"2014-04-17T03:54:17.888Z","updated_at":"2014-04-21T21:42:12.071Z","source_url":"https://twitter.com/Khairykj/status/456608483735896064","source_date":"2014-04-16","context":"Zulkifli Noordin","view_count":39,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Khairy Jamaluddin","tags":["Shut Up","Twitter"]},{"id":128,"player_id":21,"quote":"We never use samsengs","source":"Penang Chief Minister Lim Guan Eng (pic) is suing Umno-controlled English daily New Straits Times for linking him to thugs.\u003Cbr\u003E\u003Cbr\u003EHe said that the daily’s online report, titled \"Indian-interest group claims thugs interrupted meeting\", on Wednesday alleged that he and his deputy Dr P. Ramasamy sent thugs to stop a non-governmental organisation's meeting.\u003Cbr\u003E\u003Cbr\u003ELim described the report as unprofessional, unethical and immoral, and told a press conference at his office in Komtar saying:\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\"We have consulted our lawyers. As the report is defamatory, we ask the daily to issue an open apology, and pay the necessary damages and costs. It was malicious of the NST again.\u003Cbr\u003E\u003Cbr\u003E\"How can the paper publish something it knows to be false? The NST has a motive of deliberately spreading lies to tarnish our reputation.\u003Cbr\u003E\u003Cbr\u003E\"This is not my first suit against the paper and I am sure it will not be the last. The NST has been on a rampage against me and the state government.\"\u003Cbr\u003E\u003Cbr\u003EIn the report, NST quoted N. Ganeson, a spokesperson of the Concerned Citizens of the Indian Community, who claimed that thugs disturbed a meeting by the NGO.\u003Cbr\u003E\u003Cbr\u003EAccording to Ganeson, they threatened to cause hurt and tried to stop a petition from being sent to the state government as the group was unhappy over issues on the Batu Lanchang crematorium, which was under the purview of the state's Hindu Endowment Board headed by Ramasamy.\u003Cbr\u003E\u003Cbr\u003EGaneson went on to claim that the thugs were sent by Lim and Ramasamy.\u003Cbr\u003E\u003Cbr\u003ELim said a notice of demand has been sent to the NST today.\u003Cbr\u003E\u003Cbr\u003E\"We never use samsengs (gangsters) and will never use samsengs.\u003Cbr\u003E\u003Cbr\u003E\"We talk about press freedom but to them (the NST) press freedom is the freedom to spread lies. This will never happen in the West where the media knows they can be sued.\u003Cbr\u003E\u003Cbr\u003E\"Only in Malaysia newspapers that publish lies can survive,\" he said.\u003Cbr\u003E\u003Cbr\u003EJust last month Lim took the NST to task for a report which alleged that the DAP interfered in state religious matters.\u003Cbr\u003E","created_at":"2014-04-18T09:03:22.800Z","updated_at":"2014-04-21T21:40:47.987Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/guan-eng-to-sue-english-daily-for-linking-him-to","source_date":"2013-12-06","context":"","view_count":69,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Lim Guan Eng","tags":["samseng"]},{"id":167,"player_id":25,"quote":"The crime index not important","source":"KUALA LUMPUR, Jan 20 – The crime index is not important as numbers can be disputed and belittled as has been seen in the run-up to Election 2013, Datuk Seri Hishammuddin Hussein said today.\u003Cbr\u003E\u003Cbr\u003EThe home minister also insisted that Putrajaya has succeeded in cutting down crime despite increasing concern over public safety that has raised doubt over the accuracy of official crime statistics.\u003Cbr\u003E\u003Cbr\u003EJust four days ago, crime watchdog MyWatch accused the government of massaging the figures and furnished what it claimed to be the official police data showing the country’s crime rate had spiked.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E“The figures can be disputed and belittled since elections are near. The index will be polemicised so the index is not important.\u003Cbr\u003E\u003Cbr\u003E“Just try asking those involved. Ask those down there, the uncles and aunties,” Hishammuddin said after launching a police motorcycle patrol unit in Pandan Indah.\u003Cbr\u003E","created_at":"2014-04-21T07:19:00.036Z","updated_at":"2014-04-21T21:33:58.074Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/hishammuddin-crime-index-not-important","source_date":"2013-01-20","context":"","view_count":18,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Hishammuddin Hussein","tags":["crime","safety"]},{"id":59,"player_id":19,"quote":"No police action against Muslim convert who took son","source":"KUALA LUMPUR: Police will not take any action against a man for taking his six-year-old-son from his ex-wife’s house, despite a High Court order granting her custody of their two children.\u003Cbr\u003E\u003Cbr\u003EInspector-General of Police Tan Sri Khalid Abu Bakar (pic) said this was because the man, Izwan Abdullah, 31, who converted to Islam, had obtained a custody order from the Syariah Court last year.\u003Cbr\u003E\u003Cbr\u003E“As there are two clashing court orders on the matter, we will wait for the courts to decide,” he said during a press conference here Friday.\u003Cbr\u003E\u003Cbr\u003EKhalid also said that the child was not in any danger as he was with his father.\u003Cbr\u003E\u003Cbr\u003EThe Syariah Court had last year awarded Izwan, previously known as N. Viran, the custody of his six-year-old son as well as nine-year-old daughter.\u003Cbr\u003E\u003Cbr\u003EOn Monday, the High Court awarded custody of both children to Izwan’s ex-wife S. Deepa, 31, after deciding that the law that had jurisdiction over matters pertaining to a civil marriage was the Law Reform (Marriage and Divorce) Act.\u003Cbr\u003E","created_at":"2014-04-12T19:34:29.564Z","updated_at":"2014-04-21T21:31:41.433Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/11/Izwan-no-action-for-taking-son-IGP/","source_date":"2014-04-11","context":"","view_count":33,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Khalid Abu Bakar","tags":["islam","muslim","convert"]},{"id":10,"player_id":8,"quote":"Apa lagi orang Cina mahu?","source":"Headline and article by Zulkiflee Bakar, Senior News Editor of Utusan Malaysia.\u003Cbr\u003E\u003Cbr\u003EMasyarakat Cina gagal dalam usaha mereka untuk menumbangkan kerajaan Barisan Nasional (BN) yang orang Melayu menjadi terasnya.\u003Cbr\u003E\u003Cbr\u003EKegagalan itu sudah tentulah mengecewakan mereka yang amat berharap dalam Pilihan Raya Umum Ke-13 (PRU-13) ia menjadi medan untuk mereka 'menguburkan' UMNO melalui kejayaan pakatan pembangkang.\u003Cbr\u003E\u003Cbr\u003EBiarpun mereka melakukan gerakan yang dilihat bersepadu di seluruh negara dengan memastikan hampir semua undi diberikan kepada parti cauvinis, DAP dan calon-calon pakatan pembangkang lain khususnya Parti Keadilan Rakyat (PKR) namun ia belum cukup menumbangkan kepimpinan BN yang UMNO menjadi tonggak utama.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003ETranslation:\u003Cbr\u003EThe Chinese community has failed to 'topple' the Barisan Nasional government in which Malays are its core.\u003Cbr\u003E\u003Cbr\u003EThis failure must have certainly disappointed those (the Chinese) that really hoped for the 13th General Election to be an avenue to 'bury' UMNO through the success of the opposition.\u003Cbr\u003E\u003Cbr\u003EAlthough they have performed 'maneuvers' that seemed united throughout the country by ensuring almost all votes are given to the 'chauvinist party', DAP and other opposition candidates especially PKR, it still wasn't enough to 'topple' the BN leadership that is headed by UMNO.","created_at":"2014-04-09T05:32:41.949Z","updated_at":"2014-04-21T21:30:36.551Z","source_url":"http://www.utusan.com.my/utusan/Pilihan_Raya/20130507/px_03/Apa-lagi-orang-Cina-mahu","source_date":"2013-05-06","context":null,"view_count":41,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Utusan Malaysia","tags":[]},{"id":23,"player_id":7,"quote":"Muslims must seize and burn Bibles which contained the term Allah and other Arabic religious terms","source":"PERMATANG PAUH: Perkasa president Ibrahim Ali has called on Muslims to seize and burn copies of Bibles which contain the term “Allah” or other Arabic religious words.\u003Cbr\u003EStressing that he was not instigating communal tension, the Pasir Mas MP insisted that it was the only way to stop non-Muslims from stirring the sensitivities and sentiments of the majority of population in the country.\u003Cbr\u003EHe said certain non-Muslim groups were out to provoke the Muslims by using the term “Allah” or any other Arabic religious words in the Bible.\u003Cbr\u003EUnder the Non-Islamic Religion (Control on Expansion Among Muslims) Act 1988, he said non-Muslims are prohibited from using several Arabic religious terms, including Allah, in their prayers or scriptures.\u003Cbr\u003E","created_at":"2014-04-10T00:17:05.698Z","updated_at":"2014-04-21T21:26:54.252Z","source_url":"http://www.freemalaysiatoday.com/category/nation/2013/01/19/burn-allah-bibles-perkasa-chief-tells-muslims/","source_date":"2013-01-19","context":"","view_count":33,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Ali","tags":[]},{"id":53,"player_id":16,"quote":"If we provide our husbands with more than a prostitute can give, then they will not go out looking for it.","source":"A women's group that aims to teach Muslim wives how to \"keep their spouses happy in the bedroom\" is taking root in south-east Asia, prompting outrage from Muslims and non-Muslims alike.\u003Cbr\u003E\u003Cbr\u003EThe Obedient Wives Club (OWC), which has chapters in Malaysia, Indonesia and Singapore and intends to open in London and Paris later this year, says it intends to curb various social problems, including prostitution and gambling, by showing Muslim wives how to \"be submissive and keep their spouses happy in the bedroom\". This, in turn, would lead to more harmonious marriages and societies, it says.\u003Cbr\u003E\u003Cbr\u003E\"In Islam, if the husband wants sex and the wife is not in the mood, she has to give in to him,\" the Singapore club's co-founder Darlan Zaini said recently. \"If not, the angels will curse her. This is not good for the family.\"\u003Cbr\u003E\u003Cbr\u003EThe OWC, which launched in Jordan this year, opened a branch in Malaysia last month and in Indonesia last week. In Malaysia, it caused a furore when its international vice-president, Rohaya Mohamad, declared that, by becoming a \"good whore … to your husband\" and serving him \"better than a first-class prostitute\", women could help \"curb social ills like prostitution, domestic violence, human trafficking and abandoned babies\" – all of which she attributed to unfulfilled sexual needs.\u003Cbr\u003E","created_at":"2014-04-10T05:55:33.036Z","updated_at":"2014-04-21T21:26:48.546Z","source_url":"http://www.theguardian.com/world/2011/jul/06/outrage-at-obedient-wives-club-singapore?CMP=twt_gu","source_date":"2011-07-06","context":"Muslim wives","view_count":28,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Obedient Wives Club","tags":[]},{"id":95,"player_id":29,"quote":"I asked, was God hit by the flood and he said ‘yes'.","source":"He then described how an Indian trader selling garlands and Hindu deities in the Masjid India area laughed when he asked the businessman why the Hindu deities did not protect the shop.\u003Cbr\u003E“I asked, was God hit by the flood and he said ‘yes’.” he said.\u003Cbr\u003EZulkifli then said God is supposed not to get hit by the flood.\u003Cbr\u003E“Why didn’t you line up the Gods in front of your shop to stop the flood from entering your shop and divert it to the Muslim shops?\u003Cbr\u003E“Why didn’t you do that since God is suppose to protect us? (God) cannot even stop the water? And the trader tells me, ‘brother, thats a stone’.\u003Cbr\u003E“The Gods had to be sold off cheap. Hindus bought the deities cheap,” he added.\u003Cbr\u003E","created_at":"2014-04-17T03:29:20.964Z","updated_at":"2014-04-21T21:26:24.744Z","source_url":"http://www.freemalaysiatoday.com/category/nation/2013/03/28/mp-belittles-hindu-beliefs/","source_date":"2013-03-28","context":"","view_count":29,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["Hindu","Offensive","God"]},{"id":124,"player_id":36,"quote":"We don't have a big budget for promotion. We need to use creativity and innovation.","source":"Tourism Malaysia chairman Datuk Seri Dr Ng Yen Yen (pic) said the agency will restructure its operations to make it more effective in promoting Malaysia to foreign countries.\u003Cbr\u003E\u003Cbr\u003EShe said the agency would be looking for better ways to attract more tourists to come to Malaysia during the Visit Malaysia Year 2014 campaign amid a tight budget.\u003Cbr\u003E\u003Cbr\u003E\"We don't have a big budget for promotion, therefore we need to use creativity and innovation to stretch the dollar,\" she told 150 of the agency's directors from overseas and domestic offices, who were having a comprehensive tour at i-City in Shah Alam tonight.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EThus, she urged the agency's officers to make full use of digital technology in doing their promotional work. \u003Cbr\u003E\u003Cbr\u003EShe also said the agency's offices such as in Alor Setar and Kota Baru would use a more practical approach to do tourism promotion in southern Thailand, as they were nearer instead of relying on the office in Bangkok. - Bernama, December 5, 2013.\u003Cbr\u003E","created_at":"2014-04-18T08:48:25.756Z","updated_at":"2014-04-21T21:20:02.510Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/tourism-malaysia-being-restructured-to-be-more-e","source_date":"2013-12-05","context":"restructuring Tourism Malaysia","view_count":19,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["creativity","Tourism"]},{"id":12,"player_id":10,"quote":"Slap me and get RM501","source":"The slap bounty offered by former Sabah Chief Minister Yong Teck Lee to slap Home Minister Datuk Seri Ahmad Zahid Hamidi has taken a twist, with an open invitation by the latter.\u003Cbr\u003EZahid motivated the bounty offer and challenged Yong to slap him for a reward of RM501.\u003Cbr\u003EAccording to a report by Utusan Online, Ahmad Zahid said in his address to the ministry’s staff in Putrajaya that Yong should be brave enough to carry out the deed himself instead of paying someone else to do it.\u003Cbr\u003E“A generous person offered RM500 to the person who slaps me. Anyone who does the deed will get the money.\u003Cbr\u003E“I am also making an offer of RM501 to this good person if he will come slap me. If he is brave enough to do so, why ask others to slap me?” the report quoted Ahmad Zahid as saying although he did not directly name Yong.\u003Cbr\u003E","created_at":"2014-04-09T09:04:26.944Z","updated_at":"2014-04-21T21:14:35.947Z","source_url":"http://www.therakyatpost.com/news/2014/04/08/slap-me-and-i-will-pay-you-rm501-ahmad-zahid-counters-challenge/","source_date":"2014-04-08","context":"","view_count":45,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":["slapping"]},{"id":33,"player_id":10,"quote":"Not all deaths in custody are our fault","source":"The Home Minister denied that police brutality was the main cause of deaths in custody. \u003Cbr\u003E\u003Cbr\u003EDatuk Seri Zahid Hamidi today told Parliament that only two deaths out of 231 since 2000 until May this year, have been proven to be due to police brutality. \u003Cbr\u003E\u003Cbr\u003E\"The rest are from other factors,\" he added. \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EIn providing the statistics, Zahid said that 166 deaths were due to illnesses,such as HIV, asthma, heart attack and others; 29 committed suicide, 2 died in fights among inmates while 2 slipped and injured themselves in the lock-up before succumbing to the injuries. \u003Cbr\u003E","created_at":"2014-04-10T04:50:13.412Z","updated_at":"2014-04-21T21:12:03.743Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/home-minister-not-all-deaths-in-custody-are-our-fault/","source_date":"2013-06-26","context":null,"view_count":16,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":36,"player_id":10,"quote":"Don't use religion in politics.","source":"KUALA LUMPUR, May 11 — Political parties were yesterday reminded not to use religion in politics to win public support and votes.\u003Cbr\u003E\u003Cbr\u003EUmno vice-president Datuk Seri Dr Ahmad Zahid Hamidi said religion should not be made a tool to ensure the people would continue to support the leadership of a political party.\u003Cbr\u003E\u003Cbr\u003E“There could be political turbulence which will worsen the situation if religion is used for a political motive,” he said.\u003Cbr\u003E","created_at":"2014-04-10T04:55:12.926Z","updated_at":"2014-04-21T21:11:53.084Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/zahid-hamidi-dont-use-religion-in-politics","source_date":"2013-05-11","context":"Elections","view_count":17,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":163,"player_id":41,"quote":"Batu Gajah tiap-tiap bulan bocor juga","source":"\u003Cobject width=\"420\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/xqnw-q93wyc?version=3\u0026amp;hl=en_GB\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/xqnw-q93wyc?version=3\u0026amp;hl=en_GB\" type=\"application/x-shockwave-flash\" width=\"420\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E\u003Cbr\u003E\u003Cbr\u003ELast week, Mohd Said and Kinabatangan MP Datuk Bung Mokhtar Radin uttered a sexist remark against Fong Poh Kuan (DAP – Batu Gajah) while they were in a heated argument over the ceiling leakage in the Parliament building. \u003Cbr\u003E\u003Cbr\u003EBoth of them said: “Mana ada bocor? Batu Gajah pun bocor tiap-tiap bulan juga (Where is the leak? The Batu Gajah MP leaks every month too.)” \u003Cbr\u003E\u003Cbr\u003EA video footage of the incident is posted on YouTube. The footage, which received four-and-a-half star rating, was viewed more than 18,000 times. \u003Cbr\u003E\u003Cbr\u003EBung Mokhtar could not be reached.  \u003Cbr\u003E\u003Cbr\u003ETangga Batu MP Datuk Idris Haron, who earlier reportedly said that the remark should not be seen as a gender issue and accused Fong of using it to get publicity, said if the remarks truly intended to hurt women at large, it would be wise for Mohd Said and Bung Mokhtar to apologise but it was up to them to do so. \u003Cbr\u003E\u003Cbr\u003EIdris said MPs had to be accountable for what they said.  ","created_at":"2014-04-21T01:45:10.258Z","updated_at":"2014-04-21T21:04:26.245Z","source_url":"http://www.thestar.com.my/story.aspx/?file=%2f2007%2f5%2f16%2fnation%2f17736594","source_date":"2007-05-16","context":"Menstruation","view_count":21,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Bung Mokhtar Radin","tags":["sexist","Offensive","women","foot in mouth"]},{"id":47,"player_id":15,"quote":"Malaysian prisons among the best in the world","source":"KUALA LUMPUR: Malaysian prisons have been recognised as among the best in the world for caring for the welfare and rights of inmates and meet international standards, parliament heard on Wednesday.\u003Cbr\u003E\u003Cbr\u003E\"The Malaysia Prisons Department is very sensitive about the rights and welfare of inmates and provide professional service based on human values of fairness and equitable,” said Deputy Home Minister Datuk Dr Wan Junaidi Tuanku Jaafar\u003Cbr\u003E\u003Cbr\u003E\"All inmates are treated fairly in accordance with the standard procedure regardless of race, gender or political affiliation,\" he said replying to Shamsul Iskandar Mohd Akin (PKR-Bukit Katil) who asked whether the treatment of inmates meet standards under the United Nations Standard Minimum Rules (UNSMR).\u003Cbr\u003E","created_at":"2014-04-10T05:29:12.857Z","updated_at":"2014-04-21T21:02:32.996Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/02/Best-Prison-Wan-Junaidi/?utm_source=dlvr.it\u0026utm_medium=twitter","source_date":"2014-04-02","context":null,"view_count":12,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Wan Junaidi","tags":[]},{"id":160,"player_id":48,"quote":"I am still Malay and I hope more Malays will not be cowards like our leaders.","source":"A sensible person is one with common sense, a sufficient dose of fairness and a realistic and practical view of life. When life offers challenges and problems, a sensible person offers solutions and finds ways to overcome them.\u003Cbr\u003E\u003Cbr\u003ESensible people understand that the wellbeing of their families and communities are important and must be protected but they will not sacrifice justice and fairness to others for the sake of that protection.\u003Cbr\u003E\u003Cbr\u003ESensible Malays are those who will not do to others what they do not want done to them.\u003Cbr\u003E\u003Cbr\u003EDo we have enough sensible Malays in the country? I am afraid it’s a difficult question and, as a Malay, I feel embarrassed that I am unable to say a definite “yes”.\u003Cbr\u003EToday, Malays do not seem outraged that a mother can’t have custody of her own son—even with a High Court order—just because she is Hindu. Instead, Malays seem to be supportive of the father who became a Muslim and took the son away illegally, telling everybody of course that it was to prevent his son from being converted to Hinduism.\u003Cbr\u003E\u003Cbr\u003EObviously, Malays have changed dramatically over the years. A generation ago, the Malay community would not have been silent. It would not have condoned this travesty of justice.\u003Cbr\u003E\u003Cbr\u003EMalays of the past would have had no difficulty accepting that changing the religion of a child requires the decision of both parents (or guardians). It’s just common sense.\u003Cbr\u003E\u003Cbr\u003EMalays of the past would not have accepted the proposition that a single parent could unilaterally change the religion of a child against the wishes of the other parent. Those Malays had no difficulty following the law that enabled the child to decide what his or her religion was upon reaching the age of 18.\u003Cbr\u003E\u003Cbr\u003EMalays today, however, have abandoned empathy and fairness. What matters to them is that the parent doing the conversion is a Muslim. Malays today do not bother to even consider how they might feel if they were on the receiving end—if, hypothetically, the law should allow a non-Muslim parent to unilaterally convert a Muslim child to Hinduism or Christianity.\u003Cbr\u003E\u003Cbr\u003EMalays today no longer believe that fairness is about doing to others what they want others to do to them.\u003Cbr\u003E\u003Cbr\u003EI am still Malay and I hope more Malays will not be cowards like our leaders. They must speak up for justice and the principle of fairness to all.\u003Cbr\u003E\u003Cbr\u003EIt’s not possible to be a strong community if we do not even have a basic sense of decency and fairness. If we have no capacity to feel for others, how will it be possible for us to do justice to our own kind?","created_at":"2014-04-20T17:51:15.273Z","updated_at":"2014-04-21T20:57:27.282Z","source_url":"http://www.zaid.my/current/what-sensible-malays-should-do/","source_date":"2014-04-16","context":"What a sensible malays should do.","view_count":6,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zaid Ibrahim","tags":[]},{"id":168,"player_id":6,"quote":"Reducing sugar subsidies can prevent diabetes","source":"\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/Y55b-u8dtLw?version=3\u0026amp;hl=en_GB\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/Y55b-u8dtLw?version=3\u0026amp;hl=en_GB\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E\u003Cbr\u003E\u003Cbr\u003EIn Sungai Limau, Deputy Prime Minister Muhyiddin Yassin says no sugar subsidies,as announced in the new budget, will ultimately be good for the rakyat, suggesting complications from diabetes such as suffered by the late assemblyman and former Kedah Menter Besar Azizan Abdul Razak could have been avoided if not for excess sugar.\u003Cbr\u003E","created_at":"2014-04-21T07:22:38.063Z","updated_at":"2014-04-21T20:55:44.463Z","source_url":"https://my.news.yahoo.com/video/muhyiddin-sugar-subsidy-less-sugar-073043751.html","source_date":"2013-10-26","context":"","view_count":9,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Muhyiddin Yassin","tags":["health","foot in mouth"]},{"id":150,"player_id":43,"quote":"Do you think only humans have problems? Animals have problems. Cats have problems.","source":"\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/xL25dpv_cg0?version=3\u0026amp;hl=en_GB\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/xL25dpv_cg0?version=3\u0026amp;hl=en_GB\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E\u003Cbr\u003E\u003Cbr\u003EPETALING JAYA: The widely circulated and viewed video clip featuring a Universiti Utara Malaysia (UUM) student being belittled by a forum panellist has taken a new twist.\u003Cbr\u003E\u003Cbr\u003EBloggers revealed that K.S. Bawani (pic) was neither an ordinary student nor a political novice, as she was associated with Parti Sosialis Malaysia (PSM) and had actively participated in anti-government rallies.\u003Cbr\u003E\u003Cbr\u003EWhile berating Bawani for using the forum to deliver a politically-motivated speech instead of asking questions, pro-Barisan Nasional bloggers also criticised forum panellist Sharifah Zohra Syed Shah Miskin for talking down to the student.\u003Cbr\u003E\u003Cbr\u003EThe 24-minute video clip showed Sharifah Zohra chiding Bawani after the latter kept talking about free education even though the panellist had told her to stop during “Forum Suara Mahasiswa Part 4”.\u003Cbr\u003E\u003Cbr\u003EThe video, which was uploaded last week, had become the subject of parody and songs, taking a dig at Sharifah Zohra’s now infamous “listen, listen, listen, listen”.\u003Cbr\u003E\u003Cbr\u003ENetizens had been firing salvos at Sharifah Zohra, who is president of Suara Wanita 1Malaysia (SW1M) yesterday.\u003Cbr\u003E\u003Cbr\u003EOn the Facebook “We are All Bawani”, Noor Azlan M. Harif wrote that “the mass did not question so much about free education or whatever ideas from Bawani but rather the unprofessional behaviour of the moderator”.\u003Cbr\u003E\u003Cbr\u003EAnother wrote that “they want Sharifah to say sorry to Ms Bawani”.\u003Cbr\u003E\u003Cbr\u003EHowever, blogs such as stopthelies.my have exposed the “hidden” life of the second-year law student.\u003Cbr\u003E\u003Cbr\u003EThe bloggers uploaded pictures of Bawani at several anti-government rallies and a photograph of her with PSM chairman Dr Nasir Hashim.\u003Cbr\u003E\u003Cbr\u003EPSM secretary-general S. Arut­chelvan confirmed that Bawani was a party supporter and that she had worked as his personal assistant for four years.\u003Cbr\u003E\u003Cbr\u003E“She is a member of Socialist Youth, not PSM. But she is a supporter of our party,” he said.\u003Cbr\u003E\u003Cbr\u003EYesterday, in an interview with China Press, Bawani said her idol was Che Guevara, the late Argentinian Marxist revolutionary and guerilla leader who became a symbol of rebellion.\u003Cbr\u003E\u003Cbr\u003ESharifah Zohra claimed that SW1M was being used as a “black sheep” to divert attention from Pakatan Rakyat’s unsuccessful Himpunan Kebangkitan Rakyat rally that failed to attract one million protesters.\u003Cbr\u003E\u003Cbr\u003EUUM vice-chancellor Datuk Prof Dr Mohamed Mustafa Ishak said Bawani had not contravened university rules although she was actively involved in political activities.\u003Cbr\u003E\u003Cbr\u003E“Students are allowed to join political parties as long as they do not bring partisan politics to campus,” he said, adding that Bawani lost in a recent campus polls.\u003Cbr\u003E\u003Cbr\u003EThe university was aware of Bawani’s participation in rallies such as Bersih and Himpunan Kebangkitan Rakyat, said Dr Mustafa, who also distanced the university from Sharifah Zohra.\u003Cbr\u003E\u003Cbr\u003E“She (Sharifah Zohra) has nothing to do with UUM or the Government. It is a programme organised by SW1M together with a small student body. We have allowed hundreds of such programmes to be held at the campus,” he said, describing the way the panellist entertained Bawani’s question as “a bit harsh and undiplomatic”.\u003Cbr\u003E\u003Cbr\u003E“We regret that the incident had angered many.”\u003Cbr\u003E","created_at":"2014-04-20T05:34:51.455Z","updated_at":"2014-04-21T20:48:09.610Z","source_url":"http://www.freemalaysiatoday.com/category/nation/2013/01/20/sw1ms-sharifah-i-forgive-bawani/","source_date":"2013-01-20","context":"","view_count":37,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Sharifah Zohra Jabeen","tags":["rude","BN","listen"]},{"id":166,"player_id":40,"quote":"Chinese and Indians are imported to dispossess Malays of their birthright","source":"KUALA LUMPUR, April 21 ― Indians and Chinese were brought into Malaysia to weaken the Malay identity and undermine the community’s birthright to peninsular Malaysia on the pretext of multiculturalism, Islamist group Ikatan Muslimin Malaysia (Isma) said today.\u003Cbr\u003E \u003Cbr\u003EAccusing the country’s previous British colonial masters of the conspiracy, the group pointed to a claimed 350-million strong “Malay people” purportedly rooted here to insist that peninsular Malaysia be identified as a Malay and Islamic state.\u003Cbr\u003E\u003Cbr\u003E“Malaysia is a huge province which has been settled by the Malays and hold the Malay identity for over 60,000 years, and has embraced Islam for hundreds of years.\u003Cbr\u003E\u003Cbr\u003E“History also showed that Borneo, including Sabah and Sarawak has the same identity,” Isma vice-president Abdul Rahman Mat Dali said on the group’s website here.\u003Cbr\u003E\u003Cbr\u003EHe also asserted that Malaysia was dubbed “The Cradle of Human Civilisation”. The nickname has been claimed by many areas worldwide, but is widely recognised to be either in ancient Mesopotamia, Egypt, China, India, the Andes or Central America.\u003Cbr\u003E\u003Cbr\u003EDespite ISMA’s assertions, however, it is estimated that there are only around 30 million ethnic Malays worldwide, primarily in Malaysia, Indonesia, and Thailand.\u003Cbr\u003E\u003Cbr\u003E - See more at: http://www.themalaymailonline.com/malaysia/article/indians-chinese-imported-to-dispossess-malays-of-birthright-isma-claims#sthash.iBCGXPu0.i18m4DaI.dpuf","created_at":"2014-04-21T06:46:29.734Z","updated_at":"2014-04-21T20:48:02.484Z","source_url":"http://www.themalaymailonline.com/malaysia/article/indians-chinese-imported-to-dispossess-malays-of-","source_date":"2014-04-21","context":"","view_count":21,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ikatan Muslimin Malaysia","tags":["racist","isma","foot in mouth"]},{"id":142,"player_id":40,"quote":"Religion is not like choosing food from a buffet spread","source":"Sebelum mengulas lanjut, saya ucapkan tahniah kepada Raja Azmi yang baru pulang dari menunaikan ibadah umrah. Semoga akan berbekas jua di dalam jiwanya semangat untuk beramal soleh dengan keikhlasan ibadatnya. Namun sebagai seorang saudara seagama saya ingin menegur salah faham Raja Azmi dalam menunaikan perintah Allah, yang menganggap agama itu dilaksanakan secara terpisah-pisah dan menurut rasa hati.\u003Cbr\u003E\u003Cbr\u003ESesungguhnya agama Allah ini adalah agama yang menyeluruh meliputi segala aspek kehidupan. Semua perintah Allah dijalankan secara serentak, bukan dipilih-pilih seperti kita memilih-milih makanan di meja buffet. \u003Cbr\u003E\u003Cbr\u003EMelaksanakan satu perintah Allah yang disukai dan meninggalkan satu perintah lain yang dirasakan tidak kena dengan selera. Ini seolah-olah kita menunjukkan seseorang itu masih belum bersedia untuk menyerahkan segala ketaatannya kepada Penciptanya, malah mungkin secara tidak sedar ia sebenarnya dikawal oleh rasa hati dan hawa nafsu.","created_at":"2014-04-18T20:10:36.548Z","updated_at":"2014-04-21T20:47:53.626Z","source_url":"http://www.ismaweb.net/2014/04/agama-bukan-seperti-memilih-makanan-di-meja-buffet/","source_date":"2014-04-20","context":"","view_count":8,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ikatan Muslimin Malaysia","tags":["islam","religion","bad analogy","isma"]},{"id":102,"player_id":7,"quote":"I love disabled people from the bottom of my heart","source":"KUALA LUMPUR: A commotion broke out in the Parliament lobby Thursday when Datuk Ibrahim Ali (Independent - Pasir Mas) stormed out of a meeting with a group of disabled people demanding for his apology to Karpal Singh at the Parliament lobby at noon.\u003Cbr\u003E\u003Cbr\u003EThe group, known as Malaysians Against the Discrimination of the Disabled (MADD), urged Ibrahim to retract insulting statements he made against Karpal recently when he asked the latter to stand when speaking in Dewan Rakyat.\u003Cbr\u003E\u003Cbr\u003EIbrahim had apologised to the group initially for hurting their feelings over the remarks he made in the Dewan Rakyat to Karpal.\u003Cbr\u003E\u003Cbr\u003EHowever, he refused to say sorry to Karpal.\u003Cbr\u003E\u003Cbr\u003E\"My problem was with Karpal Singh and never with all of you. I have never offended you and I love disabled people from the bottom of my heart.\u003Cbr\u003E\u003Cbr\u003E\"But if you all have misinterpreted my meaning, I extend my sincerest apologies.\u003Cbr\u003E\u003Cbr\u003E\"I hope you don't misunderstand this because there are groups trying to take advantage of you,\" he said, referring to several Pakatan Rakyat leaders, Datin Seri Dr Wan Azizah Wan Ismail, Lim Lip Eng, Loh Gwo Burne, Gobind Singh Deo and others, who had escorted the group into Parliament.\u003Cbr\u003E","created_at":"2014-04-17T04:00:07.996Z","updated_at":"2014-04-21T20:45:59.503Z","source_url":"http://www.thestar.com.my/story.aspx/?file=%2f2008%2f5%2f8%2fnation%2f20080508153335\u0026sec=nation","source_date":"2008-05-08","context":"","view_count":33,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Ali","tags":["disabled","apology","insults"]},{"id":177,"player_id":51,"quote":"The MMR2 is pipe not fixed by God","source":"The best statement of 2007 by former works minister, when asked why the MRR2 in KL has cracks and pieces of debris on the roads below.","created_at":"2014-04-21T09:25:44.704Z","updated_at":"2014-04-21T20:45:01.302Z","source_url":"http://www.youtube.com/watch?v=3vcmgy3KUCg","source_date":"1992-12-15","context":"shoddy construction","view_count":25,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Samy Vellu","tags":["God","construction"]},{"id":178,"player_id":52,"quote":"Malaysia was never colonised by the British","source":"According to this local Professor, he says that Malaysia was just under the protection of the British.\u003Cbr\u003EThen why celebrate independence day?","created_at":"2014-04-21T09:32:44.669Z","updated_at":"2014-04-21T20:43:21.735Z","source_url":"http://www.malaysiakini.com/news/175301","source_date":"2011-09-09","context":"","view_count":27,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zainal Kling","tags":["kangkung","foot in mouth"]},{"id":32,"player_id":10,"quote":"Abolition of Sedition Act may lead to dispute of Federal Constitution.","source":"PUTRAJAYA: The abolition of the Sedition Act 1948 may lead to the dispute of four core aspects enshrined in the Federal Constitution, said Datuk Seri Dr Ahmad Zahid Hamidi.\u003Cbr\u003E\u003Cbr\u003EAccording to Zahid, the four core aspects are the special rights of Malays, the status of Malay rulers, the status of Islam as the Federal religion and the status of Bahasa Melayu as the national language.\u003Cbr\u003E\u003Cbr\u003EThe Home Minister said he wanted the Act retained so that these will not be questioned.\u003Cbr\u003E\u003Cbr\u003E“The Cabinet cannot decide to abolish (the Act) but (it can propose) to amend.\u003Cbr\u003E\u003Cbr\u003E“If the Sedition Act is abolished wholly, (people) will have the rights to touch on these four areas although these are enshrined in the Constitution.\u003Cbr\u003E\u003Cbr\u003E“I will not compromise if there are parties who want to touch on any of these four main aspects of the Constitution.\u003Cbr\u003E\u003Cbr\u003E“Those who do, must be charged under the existing Sedition Act 1964,” said Dr Ahmad Zahid on Sunday after launching the commemoration of the International Day Against Drug Abuse and Illicit Trafficking here.\u003Cbr\u003E","created_at":"2014-04-10T04:49:06.890Z","updated_at":"2014-04-21T20:32:23.603Z","source_url":"http://www.thestar.com.my/News/Nation/2013/07/07/Zahid-Hamidi-Sedition.aspx/?utm_source=dlvr.it\u0026utm_medium=twitter","source_date":"2013-07-07","context":null,"view_count":43,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":61,"player_id":25,"quote":"It's not considered as a loss due to his betrayal and violence in the past","source":"KUALA LUMPUR, Sept 16 — Defence Minister Datuk Seri Hishammuddin Hussein said Chin Peng’s death is not considered as a loss due to his betrayal and violence in the past.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E \u003Cbr\u003E“Chin Peng who led the Malayan Communist Party (PKM) was responsible for the deaths of thousands of soldiers, security personnel and our people in defending the sovereignty of this country,” he said in a statement today.\u003Cbr\u003E\u003Cbr\u003E- See more at: http://www.themalaymailonline.com/malaysia/article/hishammuddin-chin-pengs-death-not-a-loss#sthash.be8jNFXE.dpuf","created_at":"2014-04-13T02:32:25.253Z","updated_at":"2014-04-21T20:19:51.693Z","source_url":"http://www.themalaymailonline.com/malaysia/article/hishammuddin-chin-pengs-death-not-a-loss","source_date":"2013-09-16","context":"Chin Peng's death","view_count":13,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Hishammuddin Hussein","tags":["chin peng","communism"]},{"id":18,"player_id":8,"quote":"Bersih supporters are stubborn Mat Rempits","source":"KUALA LUMPUR, July 4 — Utusan Malaysia continued its tirade against Bersih 2.0 today, this time likening its organisers and supporters to “stubborn mat rempits” for insisting on marching this July 9.\u003Cbr\u003E\u003Cbr\u003EA day after the Yang di-Pertuan Agong, Tuanku Mizan Zainal Abidin, stepped in and asked the government and Bersih to negotiate their difference, the Umno-owned paper said the authorities should not “give face” to the group and should instead round up all rabble-rousers under the Internal Security Act (ISA).\u003Cbr\u003E\u003Cbr\u003E“Just imagine what would happen if mat rempits want to negotiate with the police to organise an illegal race,” wrote Zulkiflee Bakar, an editor of the daily. “They say they will follow orders if the cops specify the routes that they can take.\u003Cbr\u003E","created_at":"2014-04-10T00:10:00.589Z","updated_at":"2014-04-21T20:12:37.593Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/utusan-likens-bersih-organisers-supporters-to-mat-rempits","source_date":"2011-07-04","context":null,"view_count":18,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Utusan Malaysia","tags":[]},{"id":175,"player_id":12,"quote":"Kau sokong liwat?","source":"Noh Omar asks Nurul Izzah in parliament if she supports sodomy (sokong liwat)","created_at":"2014-04-21T09:02:44.157Z","updated_at":"2014-04-21T19:57:44.150Z","source_url":"http://www.youtube.com/watch?v=9fHGHHklGCA","source_date":"1992-12-15","context":"","view_count":7,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Abd Rahman Abu Bakar","tags":["sexist","Liwat","women"]},{"id":109,"player_id":34,"quote":"Singh is always King, and if they knock one Karpal down, 100 Karpals will rise. ","source":"Karpal: If one Karpal is put down, 100 Karpals will rise\u003Cbr\u003E\u003Cbr\u003E\"What I did was merely state my opinion as a lawyer on the Perak constitutional crisis.\u003Cbr\u003E\u003Cbr\u003E“Singh is always King, and if they knock one Karpal down, 100 Karpals will rise. The BN government will also have to be prepared to overturn the 41,000 plus majority that I have gained in 2013 (should he loses his appeal),” said Karpal Singh.\u003Cbr\u003E","created_at":"2014-04-17T15:35:54.424Z","updated_at":"2014-04-21T19:56:36.752Z","source_url":"http://www.malaysiakini.com/news/256738","source_date":"2014-03-11","context":"","view_count":53,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Karpal Singh","tags":[]},{"id":153,"player_id":40,"quote":"Syariah flogging requires females in a sitting position, proving that Islam respects them","source":"Wanita ISMA fully supports the actions by Johor Religious Department to exercise the enactment of Syariah Law in the form of 6 strokes of whipping  as it is meted out in the manner that complies to the Syariah flogging. The Syariah flogging requires that the female offender is in sitting position as opposed to the opposite sex who needs to stand. This is a proof that Islam places great respect to female, without abandoning its principle that every crime must be punished, regardless of gender. Furthermore, the punishment will be postponed if the women is pregnant of in the period of nursing her child.\u003Cbr\u003E\u003Cbr\u003EThe offender  is fully clothed and the whipping will not be on her face, head and private parts or on body parts where vital organs are located, the abdomen and the chest. The flogging stick has been specified to meet certain length and thickness.  The executer cannot raise his hand more than his head in whipping and all these are very unlikely to cause physical harm to the offender.\u003Cbr\u003E","created_at":"2014-04-20T06:39:23.276Z","updated_at":"2014-04-21T19:48:24.868Z","source_url":"http://en.harakahdaily.net/index.php/letter/7413-protest-over-johors-shariah-laws-misplaced.html","source_date":"2013-06-19","context":"","view_count":8,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ikatan Muslimin Malaysia","tags":["islam","syariah","Hudud","isma","women"]},{"id":145,"player_id":1,"quote":"You help me, I help you","source":"I am told, the people of Rajang Park got problem... \"Can you help or not?\" \u003Cbr\u003EI want to make a deal with you! Can we have an understanding or not?\u003Cbr\u003EThe understanding is quite simple. You help me, I help you.\u003Cbr\u003E\u003Cbr\u003EIni bukan tipu!\u003Cbr\u003E\u003Cbr\u003EI said to them, [if] Barisan Nasional wins on Sunday, on Monday I'll ask for the cheque to be prepared.\u003Cbr\u003E\u003Cbr\u003E\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/LwNLT428PqU?version=3\u0026amp;hl=en_GB\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/LwNLT428PqU?version=3\u0026amp;hl=en_GB\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-19T22:26:17.449Z","updated_at":"2014-04-21T19:41:46.286Z","source_url":"http://www.youtube.com/watch?v=LwNLT428PqU","source_date":"2010-05-15","context":"voting BN","view_count":16,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["elections","bribery","election fraud","sibu"]},{"id":219,"player_id":25,"quote":"It's only confusion if you want it to be seen as confusion","source":"Hishammuddin on allegations that the search offorts for MH370 has been mired with confusion","created_at":"2014-04-21T13:57:48.334Z","updated_at":"2014-04-21T19:38:17.198Z","source_url":"http://www.thestar.com.my/News/Nation/2014/03/13/Hunt-not-in-disarray-Hisham-dismisses-allegations-that-search-efforts-mired-in-confusion/","source_date":"2014-03-13","context":"","view_count":4,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Hishammuddin Hussein","tags":["mh370"]},{"id":152,"player_id":45,"quote":"Air Asia uniforms are sexy. They do not reflect Malaysian identity.","source":"The iconic red uniforms of low-cost carrier AirAsia’s female flight attendants have caught attention of Malaysia’s transport ministry that asked the airline on July 9 cryptically to \"reassess the uniforms to better reflect the Malaysian culture,\" but also noted that it would, on its side, \"reassess\" the airline’s license.\u003Cbr\u003EThe matter emerged after a member of parliament of the ruling United Malays National Organisation (UMNO), Ikmal Hisham Abdul Aziz, noted in a  parliamentary request that the airline’s uniforms were \"sexy\" and \"did not reflect the national identity\". He then asked if dress code guidelines were imposed on the airline when its license was issued.\u003Cbr\u003EThe bone of discontention seems to be that the red uniforms comprise tight skirts that end slightly above the knee, as well as contoured jackets over white blouses. AirAsia’ cabin crew, many of whom are Muslim Malays, this week won Investvine’s ranking of the most attractive stewardesses in ASEAN.\u003Cbr\u003EHowever, the ministry did not specify what would be appropriate.\u003Cbr\u003E\"Airlines have to abide by the safety standards, among others, and comply with emergency evacuation in the allotted time, as set by the Civil Aviation Department and the International Civil Aviation Organisation,\" the ministry said in its answering letter to parliament.\u003Cbr\u003EIt added that airlines including AirAsia were \"free to choose their uniforms as long as it complies with the criteria set by the authorities,\" without specifying what the criteria is. \u003Cbr\u003E\u003Cbr\u003Ehttp://archive.today/o4ZJr\u003Cbr\u003E\u003Cbr\u003Ehttps://forum.lowyat.net/topic/2872302/all","created_at":"2014-04-20T06:34:16.781Z","updated_at":"2014-04-21T19:37:53.939Z","source_url":"http://archive.today/o4ZJr","source_date":"2013-07-12","context":"","view_count":7,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ikmal Hisham","tags":["sexist","airasia","women"]},{"id":107,"player_id":32,"quote":"Serve cendol on flight, not beer.","source":"Ridhuan, in the Sinar Harian column, also urged Malaysia Airlines not to imitate Western values and suggested the airline stopped serving liquor on its flights.\u003Cbr\u003E\u003Cbr\u003E\"Those who ask for liquor are those who are used to drinking. Distract them with more nutritious local food like cendol and such,\" said Ridhuan, referring to the sweet coconut milk dessert.\u003Cbr\u003E\u003Cbr\u003ERidhuan, who teaches at the Malaysian National Defence University, also urged MAS to emulate crew members of neighbouring airlines from Thailand and Brunei, who he said adhere to their cultural identities.","created_at":"2014-04-17T15:09:13.144Z","updated_at":"2014-04-21T19:35:05.353Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/ridhuan-tees-take-on-lessons-from-the-missing-mh","source_date":"2014-03-24","context":"","view_count":18,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ridhuan Tee Abdullah","tags":["cendol","beer"]},{"id":48,"player_id":15,"quote":"Non-Malays are more accepting of child rape","source":"Deputy Home Minister Datuk Wan Junaidi Tuanku Jaafar (pic) has dismissed suggestions by his critics that he is a racist when he compared statistics of statutory rape between Malays and non-Malays.\u003Cbr\u003E\u003Cbr\u003E\"How can I be a racist when my wife is Chinese and I have many relatives who are non-Muslims/Malays,\" he said, when asked to clarify his remarks.\u003Cbr\u003E\u003Cbr\u003EHe said the Malays tend to lodge reports due to their religious and cultural sensitivities on statutory rape, even if was a consensual act.\u003Cbr\u003E\u003Cbr\u003E\"They have no other solution, but to lodge police reports, even when they realise that consensual sex with a minor was a statutory sexual offence,\" he told reporters after opening the Asia Pacific non-governmental organisation conference on Human Trafficking in Kuala Lumpur today.\u003Cbr\u003E","created_at":"2014-04-10T05:32:10.469Z","updated_at":"2014-04-21T19:31:33.172Z","source_url":"http://www.thestar.com.my/News/Nation/2014/03/18/wan-junaidi-malays-more-sensitive-to-rape/?utm_source=dlvr.it\u0026utm_medium=twitter","source_date":"2014-03-18","context":null,"view_count":23,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Wan Junaidi","tags":[]},{"id":114,"player_id":36,"quote":"The rise of violent crime in the country has not affected tourism","source":"\u003Ca href=\"http://imgur.com/L0slNJW\"\u003E\u003Cimg src=\"http://i.imgur.com/L0slNJW.png\" title=\"Hosted by imgur.com\" /\u003E\u003C/a\u003E","created_at":"2014-04-18T08:24:52.012Z","updated_at":"2014-04-21T19:22:08.990Z","source_url":"http://www.thestar.com.my/News/Nation/2013/08/17/Violent-crime-cases-not-affecting-tourism-says-Ng.a","source_date":"2013-08-17","context":"","view_count":11,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["crime","Tourism"]},{"id":56,"player_id":18,"quote":"Questioning Perkasa's fundings will not unite people","source":"KUALA LUMPUR: Asking questions such as whether Malay rights group Perkasa was funded by the government would only lead to divisions, Minister in the Prime Minister's Department Tan Sri Joseph Kurup told Parliament.\u003Cbr\u003E\u003Cbr\u003ETo a supplementary question by Sim Tze Tzin (PKR-Bayan Baru) on action that was taken against Perkasa over its threat to burn the bibles, Kurup said that the matter was for the relevant authorities to address.\u003Cbr\u003E\u003Cbr\u003EA brief shouting match ensued when Sim asked if Perkasa was funded by the government, prompting Kurup to retort that such questions by the Opposition \"did not unite but divide the people\".\u003Cbr\u003E\u003Cbr\u003ESim wanted to know if the government's funding of Perkasa contradicted its efforts to unite the people.\u003Cbr\u003E","created_at":"2014-04-10T20:00:34.366Z","updated_at":"2014-04-21T19:17:07.251Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/10/parliament-kurup-questions-on-perkasa-will-divide-people/","source_date":"2014-04-10","context":null,"view_count":19,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Joseph Kurup","tags":["perkasa"]},{"id":19,"player_id":7,"quote":"The Chinese are ungrateful for not voting BN","source":"PETALING JAYA: Perkasa president Datuk Ibrahim Ali has labelled the Chinese as ungrateful for not voting Barisan Nasional despite its promises and pledges to help the community during the campaign period for the Sibu by-election.\u003Cbr\u003E\u003Cbr\u003EIn a statement on the Perkasa website yesterday, Ibrahim, who is Pasir Mas MP, claimed the Chinese voters in Sibu had not appreciated the promises of projects and financial assistance made by Prime Minister Datuk Seri Najib Tun Razak.\u003Cbr\u003E\u003Cbr\u003E“The Chinese voters didn’t appreciate what has been given by the Prime Minister to them, for example, his support for vernacular schools and so on.\u003Cbr\u003E\u003Cbr\u003E“The Chinese voters openly supported the DAP policies. The Chinese voters want their own ways to prevail, despite the bumiputras having to ‘swallow’ the Barisan Nasional’s call for compromise to allow the Chinese community to have their wish,” he said here yesterday.\u003Cbr\u003E\u003Cbr\u003EIt was the second such statement by the controversial independent MP after his earlier statement asking the Government to delay development for the Chinese community after Barisan Nasional won the Hulu Selangor by-election last month.\u003Cbr\u003E","created_at":"2014-04-10T00:13:36.479Z","updated_at":"2014-04-21T19:15:49.085Z","source_url":"http://www.thestar.com.my/story.aspx/?file=%2f2010%2f5%2f18%2fsibu%2f6279918\u0026sec=sibu","source_date":"2010-05-18","context":"","view_count":20,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Ali","tags":["Chinese","BN"]},{"id":151,"player_id":44,"quote":"Love is in the air","source":"\u003Cobject width=\"420\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/hMt2M9lJ9rI?hl=en_GB\u0026amp;version=3\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/hMt2M9lJ9rI?hl=en_GB\u0026amp;version=3\" type=\"application/x-shockwave-flash\" width=\"420\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-20T05:41:15.382Z","updated_at":"2014-04-21T19:06:51.630Z","source_url":"http://www.youtube.com/watch?v=hMt2M9lJ9rI","source_date":"2013-04-22","context":"","view_count":9,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Malaysian Chinese Association","tags":["MCA","GE13","Love","Karaoke"]},{"id":98,"player_id":29,"quote":"I am the living proof of Najib's transformation programme","source":"KUALA LUMPUR, April 21 — Perkasa’s Datuk Zulkifli Noordin believes his image does not need any repairing with any demographic in the Shah Alam race, saying he is also confident of Barisan Nasional (BN) recapturing Selangor in Election 2013.\u003Cbr\u003E\u003Cbr\u003EThe incumbent Kulim-Bandar Baharu MP has riled the Indian community with his comments about their faith, but he told the fz.com news portal that his BN candidacy was “living proof” of coalition chairman Datuk Seri Najib Razak’s commitment to political transformation.\u003Cbr\u003E\u003Cbr\u003E“I am what I am,” Zulkifli said in a video interview uploaded in the news portal yesterday.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E“It is a proof of Najib’s commitment to transform the political scenario in Malaysia, thinking outside the box. So I am the living proof of that transformation programme,” he claimed proudly, referring to his candidacy as someone not affiliated to any of the BN component parties.\u003Cbr\u003E\u003Cbr\u003EThe syariah lawyer and former defence lawyer for Datuk Seri Anwar Ibrahim is the first person to be running under the flag of “Friends of Barisan Nasional” in the May 5 general elections.\u003Cbr\u003E","created_at":"2014-04-17T03:45:03.942Z","updated_at":"2014-04-21T19:05:46.179Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/zul-noordin-confident-with-his-image-selangor-bn-sweep/","source_date":"2013-04-21","context":"","view_count":23,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["Transformation","1Malaysia","perkasa","BN"]},{"id":193,"player_id":44,"quote":"The rise in crime rate means the economy of our country is doing well","source":"Said by Chor Chee Heung, MP of Alor Setar (MCA)\u003Cbr\u003E\u003Cbr\u003EDato' Chor Chee Heung (Chinese: 曹智雄; pinyin: Cáo Zhìxióng; Cantonese Yale: Chòuh Ji-hùhng); is a Malaysian politician and was the Member of the Parliament of Malaysia for the Alor Setar constituency in Kedah, Malaysia from 1990 to 2012. He is a member of the Malaysian Chinese Association in the governing Barisan Nasional coalition and was the Minister for Housing and Local Government.","created_at":"2014-04-21T09:55:40.517Z","updated_at":"2014-04-21T18:51:08.805Z","source_url":"http://www.youtube.com/watch?v=oqOQWEK12g4","source_date":"2007-12-16","context":"","view_count":13,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Malaysian Chinese Association","tags":["economy","foot in mouth"]},{"id":189,"player_id":41,"quote":"Censor the Internet so China won't get mad","source":"KUALA LUMPUR, March 25 — Putrajaya must restrict information on the Internet about Malaysia Airlines flight MH370 to protect Malaysians from the rage of Chinese families who lost their relatives to the doomed plane, Datuk Bung Mokhtar Radin said today.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EAccording to the Kinabatangan MP, continued bad news about the plane that is now assumed lost with no survivors among the 239 people on board could move Chinese citizens to take out their anger on Malaysians abroad.\u003Cbr\u003E\u003Cbr\u003E“With our uncontrolled media, everything can be uploaded to their heart’s content. What will then happen?” Bung asked in Parliament today.\u003Cbr\u003E\u003Cbr\u003E“What will happen if Chinese citizens believe in such issues? They will riot and torture any Malaysians wherever they are. We don’t want this to happen.”\u003Cbr\u003E\u003Cbr\u003EBung made his remark when he, as a representative of the Barisan Nasional Backbenchers Club, was debating an emergency motion on MH370 proposed by Prime Minister Datuk Seri Najib Razak earlier.\u003Cbr\u003E\u003Cbr\u003E- See more at: http://www.themalaymailonline.com/malaysia/article/bung-mokhtar-censor-internet-to-calm-chinese-anger-on-mh370#sthash.7njav0dB.dpuf","created_at":"2014-04-21T09:51:02.157Z","updated_at":"2014-04-21T18:47:42.226Z","source_url":"http://www.themalaymailonline.com/malaysia/article/bung-mokhtar-censor-internet-to-calm-chinese-anger-on-mh370","source_date":"2014-03-25","context":"","view_count":4,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Bung Mokhtar Radin","tags":["Internet","censorship","foot in mouth"]},{"id":96,"player_id":29,"quote":"I would not be surprised if the 14th general election turns out to be a 'Christianisation Tsunami'.","source":"Perkasa today highlighted seven threats to the survival of Malay-Islam in Malaysia and warned Putrajaya that the 14th general election may turn out to be a \"Christianisation Tsunami\" if the threats are not dealt with seriously.\u003Cbr\u003E\u003Cbr\u003EThe vice-president of the Malay rights group, Datuk Zulkifli Noordin, said the threats included Pakatan Rakyat, Singapore, non-government organisations (NGOs) and liberal Malays.\u003Cbr\u003E\u003Cbr\u003EHe pointed out that the move by Christians to drag the Allah issue to court was provocative and one which insulted Muslims.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\"Their failure in the appellate court did not deter them as they attempted to drag it into the international arena using the United Nations.\u003Cbr\u003E\u003Cbr\u003E\"The Christian movement has received support from a faction of Malays who are hell-bent on capturing Putrajaya at all costs.\u003Cbr\u003E\u003Cbr\u003E\"If the 13th general election was labelled as a 'Chinese Tsunami', I would not be surprised if the 14th general election turns out to be a 'Christianisation Tsunami',\" Zulkifli was quoted in today's Utusan Malaysia.\u003Cbr\u003E","created_at":"2014-04-17T03:37:53.261Z","updated_at":"2014-04-21T18:42:39.606Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/the-7-threats-against-muslims-in-malaysia-according-to-perkasas-zulkifli-no?","source_date":"2013-12-07","context":"","view_count":12,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zulkifli Noordin","tags":["Christians","GE14","Tsunami","perkasa"]},{"id":16,"player_id":7,"quote":"I am 1000x better than Anwar as Prime Minister","source":"Presiden Pertubuhan Pribumi Perkasa Malaysia (Perkasa), Datuk Ibrahim Ali berkata beliau sebenarnya lebih layak untuk menjadi perdana menteri berbanding dengan dengan Ketua Pembangkang, Datuk Seri Anwar Ibrahim.\u003Cbr\u003E\u003Cbr\u003EIbrahim menyifatkan beliau 1,000 kali lebih bagus daripada ketua umum PKR itu dari segi moral dan perangai serta boleh menjalankan tugas lebih baik daripada Anwar sebagai perdana menteri Malaysia.\u003Cbr\u003E\u003Cbr\u003E\"Sekiranya anda mahukan perdana menteri dan tidak suka dengan calon sedia ada, Ibrahim Ali juga boleh jadi perdana menteri,\" katanya dalam program penyerahan pelantikan baru jawatankuasa kepimpinan Perkasa negeri di Seamo-Rescam, di Pulau Pinang hari ini.\u003Cbr\u003E\u003Cbr\u003EEnglish: http://www.themalaysianinsider.com/malaysia/article/i-am-1000-million-times-better-than-anwar-for-prime-minister-says-ibrahim-a","created_at":"2014-04-10T00:00:46.590Z","updated_at":"2014-04-21T18:26:23.629Z","source_url":"http://www.themalaysianinsider.com/bahasa/article/saya-lebih-layak-jadi-pm-berbanding-anwar-kata-ibrahim-ali","source_date":"2014-02-16","context":null,"view_count":25,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ibrahim Ali","tags":[]},{"id":161,"player_id":48,"quote":"The Police have become the ultimate interpreters of the laws of the land.","source":"Now the Police have become the ultimate interpreters of the laws of the land. No one dares to correct them or to interpret for them. They have become what they are because our politicians are always afraid to stand up for the right thing. These Muslims leaders don’t dare table the necessary changes to the laws on civil marriage or to Muslims family laws in Parliament (which were amended years ago and are still waiting for Parliament to pass them).","created_at":"2014-04-20T17:57:59.527Z","updated_at":"2014-04-21T18:17:35.756Z","source_url":"http://www.zaid.my/current/muslims-leaders-please-wake-up/","source_date":"2014-04-14","context":"","view_count":6,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zaid Ibrahim","tags":[]},{"id":121,"player_id":36,"quote":"The Facebook pages do not cost a single sen.","source":"KUALA LUMPUR, June 15 — With Barisan Nasional (BN) and Pakatan Rakyat (PR) both demanding an explanation for the tourism ministry’s RM1.8 million Facebook campaign, Datuk Seri Dr Ng Yen Yen denied any wrongdoing today and accused DAP of twisting the truth.\u003Cbr\u003E\u003Cbr\u003E“The opposition just goes around saying it’s for Facebook. They are twisting the issue.\u003Cbr\u003E\u003Cbr\u003E“The Facebook pages do not cost a single sen. This is a social media advertising, promotions and branding campaign and also data collection,” the MCA vice president told reporters today.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EHowever, her contention that the Facebook pages were free appeared to contradict her ministry’s detailed account of the cost for each page.\u003Cbr\u003E\u003Cbr\u003EYesterday, Deputy Tourism Minister James Dawos Mamit had replied in Parliament to Anthony Loke (DAP-Rasah) that each Facebook page had cost RM293,072.\u003Cbr\u003E\u003Cbr\u003EDr Ng also added today that the RM1.8 million would cover the cost of six different campaigns across seven months and includes the cost of contests and advertising on Google and Facebook.\u003Cbr\u003E","created_at":"2014-04-18T08:41:45.024Z","updated_at":"2014-04-21T18:12:00.853Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/yen-yen-claims-facebook-pages-free-contradicts-r","source_date":"2011-06-15","context":"RM1.8mil Facebook spending","view_count":25,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["Facebook","flip-flop","corruption","BN"]},{"id":157,"player_id":47,"quote":"Belum kahwinkah? Saya ada kuota tiga lagilah.","source":"“What Abang Johari said in the state assembly in November was not only a sexist remark but a form of sexual harassment against both the DAP assemblywomen.”\u003Cbr\u003E\u003Cbr\u003EDuring their debate a week earlier, both Yong and Chiew had invited Abang Johari to “turun padang” (go to the ground) to see for himself the plight of the hawkers at the Satok Kubah Ria market, the country's largest market.\u003Cbr\u003E\u003Cbr\u003EAbang Johari, who is the assemblyman for Satok, had made light of their invitation and said: “If I were to go with you (Chiew), people will say this is a new girlfriend. Nanti susah (later it would be difficult for me), this is my kawasan (constituency), you know? It is my kawasan.”\u003Cbr\u003E\u003Cbr\u003EThe assembly erupted in laughter at his remarks.\u003Cbr\u003E\u003Cbr\u003ETo Yong's observations on the market, Abang Johari ended his reply by asking her: “Belum kahwinkah? Saya tidak tahu. Saya ada kuota tiga lagilah (Are you married? I don't know. I still have a quota of three) – a reference to Muslims who can marry up to four wives.\u003Cbr\u003E\u003Cbr\u003Ehttp://www.themalaysianinsider.com/malaysia/article/have-a-little-dignity-and-apologise-for-sexist-remarks-dap-tells-abang-joha","created_at":"2014-04-20T06:54:28.940Z","updated_at":"2014-04-21T18:11:31.523Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/sarawak-lawmaker-fails-to-get-minister-to-withdr","source_date":"2013-11-27","context":"visiting his constituency with female politicians","view_count":19,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Amar Abang Johari","tags":["sexist","nonsense"]},{"id":131,"player_id":1,"quote":"Kita akan berdepan dengan puak-puak ini!","source":"\u003Cobject width=\"560\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/4_jdEgrhZGY?version=3\u0026amp;hl=en_GB\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/4_jdEgrhZGY?version=3\u0026amp;hl=en_GB\" type=\"application/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-18T09:19:09.779Z","updated_at":"2014-04-21T18:10:51.512Z","source_url":"https://www.youtube.com/watch?v=4_jdEgrhZGY","source_date":"2011-07-12","context":"Bersih","view_count":15,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["Bersih","GE13","elections","UMNO"]},{"id":46,"player_id":15,"quote":"If I could have it my way, I would close down all [remote Sabah] resorts","source":"KUALA LUMPUR: The Eastern Sabah Security Command (Esscom) should not be blamed for the abductions at Singamata Reef Resort, said Deputy Home Minister Datuk Dr Wan Junaidi Tuanku Jaafar.\u003Cbr\u003E\u003Cbr\u003EWan Junaidi, however, Esscom could not guarantee safety of resorts that operated offshore on isolated islands.\u003Cbr\u003E\u003Cbr\u003EWan Junaidi said operators of such resorts should beef up its security and communication systems.\u003Cbr\u003E\u003Cbr\u003EThe alternative, he said, would be to shut down so safety of their customers would not be compromised.\u003Cbr\u003E","created_at":"2014-04-10T05:28:42.000Z","updated_at":"2014-04-21T17:59:31.184Z","source_url":"http://www.thestar.com.my/News/Nation/2014/04/04/Semporna-resort-kidnap-dont-blame-esscom-wan-junaidi/?utm_source=dlvr.it\u0026utm_medium=twitter","source_date":"2014-04-04","context":"","view_count":13,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Wan Junaidi","tags":[]},{"id":216,"player_id":28,"quote":"The Japanese tsunami is a result of negligence in conducting environmental-friendly developments","source":"\u003Cobject width=\"420\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/zuMLtycp_0I?hl=en_GB\u0026amp;version=3\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/zuMLtycp_0I?hl=en_GB\u0026amp;version=3\" type=\"application/x-shockwave-flash\" width=\"420\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E\u003Cbr\u003E\u003Cbr\u003EWhen asked to comment on Japan's quake-tsunami disaster, wife of Malaysian Prime Minister, Datin Seri Rosmah Mansor said that it is a result of negligence in conducting environmental-friendly developments.\u003Cbr\u003E \u003Cbr\u003E\"To me, this is a lesson to other countries, that in everything they do or in whatever development they plan, they should study the surrounding environment and connect it with climate change and green technology,\" she told private news channel Astro Awani.\u003Cbr\u003E\u003Cbr\u003EA video clip of Rosmah airing her view instantly became a hit among internet users, circulating in sites such as Twitter and Facebook, and being met with sarcastic comments from viewers.\u003Cbr\u003E \u003Cbr\u003E","created_at":"2014-04-21T12:02:31.677Z","updated_at":"2014-04-21T17:55:25.980Z","source_url":"http://ireport.cnn.com/docs/DOC-571969","source_date":"2011-03-14","context":"","view_count":7,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Rosmah Mansor","tags":["Tsunami","rosmah","foot in mouth","Japan"]},{"id":202,"player_id":53,"quote":"V-necks and man bags are early signs that your son may be gay","source":"The Ministry of Education in Malaysia has endorsed guidelines to help parents tell if their children are gay or lesbian.\u003Cbr\u003E\u003Cbr\u003EMalaysiakini reports that the list of 'symptoms' for gay men includes stereotypes such as:\u003Cbr\u003E\u003Cbr\u003E‘Have a muscular body and like to show their body by wearing V-neck and sleeveless clothes’\u003Cbr\u003E‘Prefer tight and light-coloured clothes’\u003Cbr\u003E‘Like to bring big handbags, similar to those used by women, when hanging out’\u003Cbr\u003EThe list of ‘warning’ signs for lesbians are less superficial.\u003Cbr\u003E\u003Cbr\u003EPotential lesbians apparently ‘distance themselves from other women… besides their female companions’, ‘like to hang out, have meals and sleep in the company of women’ and ‘have no affection for men’.\u003Cbr\u003E\u003Cbr\u003E- See more at: http://www.gaystarnews.com/article/malaysia-warns-parents-look-out-signs-their-kids-are-gay130912#sthash.GFNPVvIL.dpuf","created_at":"2014-04-21T10:03:13.746Z","updated_at":"2014-04-21T17:55:06.916Z","source_url":"http://www.gaystarnews.com/article/malaysia-warns-parents-look-out-signs-their-kids-are-gay130912","source_date":"2012-09-13","context":"","view_count":9,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Mohd Puad Zarkashi","tags":["gay","foot in mouth"]},{"id":14,"player_id":4,"quote":"The overwhelming bids for MCA series number plates prove that people are proud of the party and love it.","source":"“Previously, people sarcastically said that no one would want the MCA plate, but now it has broken records and is the highest tender (series) made in the country so far,” he said.\u003Cbr\u003E\u003Cbr\u003EDr Chua noted that the tender for the MCA series was worth approximately RM1.5mil.\u003Cbr\u003E","created_at":"2014-04-09T09:23:39.550Z","updated_at":"2014-04-21T17:43:34.366Z","source_url":"http://www.thestar.com.my/Story/?sec=nation\u0026file=%2F2010%2F12%2F31%2Fnation%2F7715391","source_date":"2010-12-31","context":null,"view_count":18,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":["MCA"]},{"id":130,"player_id":3,"quote":"Macam beruk-beruk di jalan raya","source":"\u003Cobject width=\"420\" height=\"315\"\u003E\u003Cparam name=\"movie\" value=\"//www.youtube.com/v/bukjYb7penc?version=3\u0026amp;hl=en_GB\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"//www.youtube.com/v/bukjYb7penc?version=3\u0026amp;hl=en_GB\" type=\"application/x-shockwave-flash\" width=\"420\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E","created_at":"2014-04-18T09:16:29.581Z","updated_at":"2014-04-21T17:36:56.738Z","source_url":"https://www.youtube.com/watch?v=bukjYb7penc","source_date":"2008-01-18","context":"Bersih","view_count":20,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Khairy Jamaluddin","tags":["Bersih"]},{"id":116,"player_id":36,"quote":"I would love to dance (with Psy) if I had the chance","source":"\u003Cimg src=\"https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-ash3/529197_10151238020155906_1719321975_n.jpg\" width=\"100%\"\u003E\u003Cbr\u003E\u003Cbr\u003EFlamboyant Tourism Minister Dr Ng Yen Yen said today she would love to dance in the Gangnam style with South Korean pop sensation Psy at the BN Chinese New Year open house to be held in Penang.\u003Cbr\u003E\u003Cbr\u003E“I would love to dance (with Psy) if I had the chance,” Ng said.\u003Cbr\u003E\u003Cbr\u003EAsked whether she could dance in the Gangnam style, Ng (left in photo), clad in a red kebaya, stood up and performed part of the signature dance, catching many off guard and those at the press conference bursting  into laughter.\u003Cbr\u003E\u003Cbr\u003ENg brushed off allegations that BN was using Psy to win popularity and to recapture Penang, saying that the BN did not consider Psy’s appearance as a “bid to win votes”.\u003Cbr\u003E\u003Cbr\u003E“Malaysians love to speculate, Malaysians love to jump to conclusions,” she complained, referring to widespread speculation that the federal government and BN were footing Psy’s bill and wished to win votes through the singer.\u003Cbr\u003E\u003Cbr\u003EShe said all Malaysians loved to be happy and bringing Psy here would make the people happy.\u003Cbr\u003E\u003Cbr\u003E“Do you think Psy is interested in who wins? I don’t think Psy is interested,” she said.\u003Cbr\u003E\u003Cbr\u003E“(I think) Psy doesn’t want to make himself a (political) tool.”","created_at":"2014-04-18T08:28:24.588Z","updated_at":"2014-04-21T17:32:27.217Z","source_url":"http://www.malaysiakini.com/news/221036","source_date":"2013-02-08","context":"","view_count":23,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["PSY","MCA","BN"]},{"id":17,"player_id":12,"quote":"Ibrahim Ali is a tested and proven leader. We are solidly behind him and hope he will return to lead Perkasa again.","source":"KUALA LUMPUR, May 10 — The Supreme Council of Right wing Malay non-government organisation Perkasa has unanimously rejected the resignation of its president Datuk Ibrahim Ali and instead agreed to extend his leave till its annual general meeting in December.\u003Cbr\u003E\u003Cbr\u003EPerkasa deputy president Datuk Abd Rahman Abu Bakar said the council and Perkasa members throughout the country were hoping that Ibrahim would continue to helm Perkasa in defending the rights of the Malays and Islam which was becoming increasingly challenging.\u003Cbr\u003E","created_at":"2014-04-10T00:04:16.861Z","updated_at":"2014-04-21T17:24:44.433Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/perkasa-tells-ibrahim-ali-to-stay-on","source_date":"2013-05-10","context":null,"view_count":21,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Abd Rahman Abu Bakar","tags":[]},{"id":120,"player_id":36,"quote":"Barisan Nasional is very strong now. They do not want to see us prosper.","source":"Dr Ng said there had been all-round support from associations in the industry that the rally should not go on.\u003Cbr\u003E\u003Cbr\u003E“The rally will impact our tourism industry, especially since July is the peak season for Middle Eastern tourists to come.”\u003Cbr\u003E\u003Cbr\u003EShe accused Bersih 2.0 of wanting to impede the progress made by the Government.\u003Cbr\u003E\u003Cbr\u003E“They have a strong agenda to destroy the Government and disrupt the country's economy as Barisan Nasional is very strong now. They do not want to see us prosper,” she said.","created_at":"2014-04-18T08:38:44.829Z","updated_at":"2014-04-21T17:22:32.235Z","source_url":"http://www.thestar.com.my/story.aspx/?file=%2f2011%2f6%2f29%2fnation%2f8994213\u0026sec=nation","source_date":"2011-06-29","context":"Bersih","view_count":7,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["Bersih","Tourism","BN"]},{"id":65,"player_id":8,"quote":"At least we have quality readers","source":"Malaysiakini boleh menuduh Utusan sebagai penyokong kerajaan dan tidak adil kepada pembangkang. Tetapi tidak boleh menafikan Utusan mempunyai pengikut yang berkualiti untuk menilai Utusan adil atau tidak. Utusan sama sekali tidak memerlukan pengikut yang seperti pembahas-pembahas di Malaysiakini. Maaflah kerana Utusan bukanlah jentera propaganda yang membutakan pemikiran rakyat dengan menjaja kewartawanan adil yang palsu. Sebab itulah saya rasa terhina apabila nama disebut dalam Malaysiakini\u003Cbr\u003E\u003Cbr\u003EArtikel Penuh: http://www.utusan.com.my/utusan/Rencana/20140413/re_07/Memeriksa-erti-kewartawanan-adil-iMalaysiakinii#ixzz2ykCLx3S9 \u003Cbr\u003E© Utusan Melayu (M) Bhd ","created_at":"2014-04-13T06:11:39.180Z","updated_at":"2014-04-21T17:12:41.606Z","source_url":"http://www.malaysiakini.com/news/259863","source_date":"2014-04-13","context":"Utusan attacking Malaysiakini","view_count":12,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Utusan Malaysia","tags":["quality","readers","utusan"]},{"id":50,"player_id":15,"quote":"Malaysia is the envy of many countries","source":"KUCHING: Malaysia’s rapid progress and success in nation building has been described as phenomenal by other countries, said Deputy Dewan Rakyat Speaker Datuk Wan Junaidi Tuanku Jaafar.\u003Cbr\u003EAccording to him, this is because the countries admire the way Malaysia is administered despite the fact that it only gained its independence only 54 years ago.\u003Cbr\u003E“This is a sincere recognition given by other countries to us that we are emerging tremendously and progressing phenomenally in all aspects. This is something that we should be proud of and defend. We are now capable of standing tall with the rest of the developed countries in the world,” he stressed.\u003Cbr\u003EHe said this at the closing ceremony of 1Malaysia seminar cum launching of ‘Kibarkan Jalur Gemilang’ day at the old state legislative assembly building yesterday.\u003Cbr\u003EWan Junaidi went on to say that all the achievements would not be possible without a stable and peaceful government under the ruling party.\u003Cbr\u003E“Under Barisan Nasional (BN) government, we have achieved some victories beyond other nations despite the fact we are living in a multi-racial country. All of these are achieved harmoniously and we are moving towards more success and economic boom,” he added.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003ERead more: http://www.theborneopost.com/2011/07/28/malaysia-the-envy-of-many-countries-%e2%80%93-wan-junaidi/#ixzz2ySVooQOX","created_at":"2014-04-10T05:35:59.870Z","updated_at":"2014-04-21T17:11:59.872Z","source_url":"http://www.theborneopost.com/2011/07/28/malaysia-the-envy-of-many-countries-%E2%80%93-wan-junaidi/?utm_medium=twitter\u0026utm_source=twitterfeed","source_date":"2011-07-28","context":"","view_count":14,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Wan Junaidi","tags":["BN"]},{"id":28,"player_id":10,"quote":"There is no need to give any more warning. If we get the evidence, we shoot first.","source":"Malaysia's security minister has called for police to \"shoot first\" when they encounter criminals and defended a spate of killings by police.\u003Cbr\u003EThe opposition has branded remarks by Ahmad Zahid Hamidi, the minister for internal security, as giving police a licence to kill to deal with a recent upsurge in gang-related violence in the generally peaceful nation.\u003Cbr\u003EMr Zahid said there is no longer a need to comprise with suspects.\u003Cbr\u003E\"There is no need to give any more warning shots. If we get the evidence we shoot first,\" he said, referring to 40,000 alleged gang members, half of whom he claimed were ethnic-Indian Malaysians.\u003Cbr\u003E\u003Cbr\u003Ehttp://www.smh.com.au/world/licence-to-kill-malaysian-police-allowed-to-shoot-first-20131008-2v56w.html\u003Cbr\u003E\u003Cbr\u003E","created_at":"2014-04-10T04:39:51.340Z","updated_at":"2014-04-21T17:11:31.941Z","source_url":"https://my.news.yahoo.com/zahid-hamidi-defends-shoot-first-remark-says-priority-080000633.html","source_date":"2013-10-08","context":"Criminals","view_count":22,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":182,"player_id":38,"quote":"Opposition members are shit stirrers","source":"Federal Territories Minister Tengku Adnan Tengku Mansor blames the opposition for the deterioration of good old Malaysian values.\u003Cbr\u003E\u003Cbr\u003EHe was responding to a question on his stand on the abolishment of the Sedition Act.\u003Cbr\u003E\u003Cbr\u003EThough he did not directly answer the question, he had a bit to say about moral values.","created_at":"2014-04-21T09:36:59.678Z","updated_at":"2014-04-21T17:11:11.237Z","source_url":"http://www.youtube.com/watch?v=kXr3fjb2YYE","source_date":"2013-07-09","context":"","view_count":7,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Tengku Adnan","tags":["Opposition","rude","BN"]},{"id":156,"player_id":32,"quote":"Kiasu spinster","source":"Controversial lecturer Dr Ridhuan Tee Abdullah (pic) has denied that he had taught ethnic cleansing in the university, saying today he was just giving examples of such events in other countries, including Singapore.\u003Cbr\u003E\u003Cbr\u003EThe National Defence University Malaysia (UPNM) associate professor said he was willing to be investigated over the allegations that were revealed in a parliamentary question by DAP Seputeh MP Teresa Kok.\u003Cbr\u003E\u003Cbr\u003E\"My answer is, please conduct an investigation. I am ready any time alongside thousands of my students,\" Tee wrote in his column today in Malay daily “Sinar Harian”.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EKok had posed the question to Deputy Defence Minister Datuk Abdul Rahim Bakri if such an incident did occurr, weeks after she said Tee had plagiarised an article written by Universiti Teknologi Malaysia lecturer Dr Airil Yasreen Mohd Yassin.\u003Cbr\u003E\u003Cbr\u003EWithout naming names, Tee wrote that the \"kiasu spinster\" who attacked him in Parliament should continue to study and obtain more degrees.\u003Cbr\u003E\u003Cbr\u003EThe controversial lecturer argued that ethnic cleansing was happening in Singapore.\u003Cbr\u003E\u003Cbr\u003E\"Based on proof, there is obviously ethnic cleansing.\u003Cbr\u003E\u003Cbr\u003E\"No need to go far, just look at Muslims in Singapore. Their rights are already denied in their homeland, until they cannot even cover their 'aurat' in public institutions, such as schools.\"\u003Cbr\u003E\u003Cbr\u003EHe also clarified that he was teaching ethnic relations and Islamic and Asian civilisation (Titas) in UPNM.\u003Cbr\u003E","created_at":"2014-04-20T06:49:52.022Z","updated_at":"2014-04-21T17:10:11.144Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/ridhuan-tee-denies-teaching-ethnic-cleansing-ask","source_date":"2013-12-09","context":"Teresa Kok","view_count":16,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ridhuan Tee Abdullah","tags":["kiasu"]},{"id":37,"player_id":10,"quote":"It is impossible to abolish the Internal Security Act","source":"KUALA LUMPUR: Defence Minister Datuk Seri Dr Ahmad Zahid Hamidi said it was impossible for the Internal Security Act (ISA) to be abolished but it could be amended or its name to be changed to be more appropriate with current times.\u003Cbr\u003E\u003Cbr\u003EHe said the country needed laws like the ISA, that could allow a person to be questioned before a matter or case could be taken to court, as well as needing other laws.\u003Cbr\u003E\u003Cbr\u003E\"Don't just look to our country only. See our neighbours or other countries. They too have laws more or less like ours or more stricter.\u003Cbr\u003E\u003Cbr\u003E\"The act is meant to enure economic and political stability so that there are no problems related to religion, race and culture and this is what the government stresses,\" he told reporters after officiating a political speeches course organised by the Cheras Umno division here Saturday.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E","created_at":"2014-04-10T04:57:10.484Z","updated_at":"2014-04-21T17:09:39.107Z","source_url":"http://www.mysinchew.com/node/27801","source_date":"2009-08-01","context":"","view_count":11,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":31,"player_id":10,"quote":"Police force understaffed, not to be blamed for recent spate of shootings","source":"PUTRAJAYA: The recent spate of shootings should not be blamed on the police as it faces a shortage in manpower and equipment compared to other developed countries.\u003Cbr\u003E\u003Cbr\u003E\"For example, in New York, a policeman serves 35 residents while a policeman in Malaysia serves 700 residents,\" said Home Minister Datuk Seri Dr Ahmad Zahid Hamidi.\u003Cbr\u003E\u003Cbr\u003EHe was speaking at a press conference after receiving a courtesy call from the Australia's High Commissioner to Malaysia, Miles Kuppa at his office here Wednesday.\u003Cbr\u003E\u003Cbr\u003EAhmad Zahid admitted that one of the factors for the spike in the crime rate was the release of detainees from Simpang Renggam prison.\u003Cbr\u003E","created_at":"2014-04-10T04:47:14.709Z","updated_at":"2014-04-21T17:08:40.029Z","source_url":"http://www.thestar.com.my/News/Nation/2013/07/30/Zahid-police-understaffed.aspx/?utm_source=dlvr.it\u0026utm_medium=twitter","source_date":"2013-07-30","context":"Malaysian police","view_count":10,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zahid Hamidi","tags":[]},{"id":181,"player_id":6,"quote":"The fact that people were able to use social media indicates that Malaysia has a robust democracy","source":"We have to explain to Malaysians and foreigners alike that this is not \u003Cbr\u003Ewhat democracy is all about. Democracy also is about citizens having the \u003Cbr\u003Efreedom to exercise their right to vote and it also guarantees that there is rule of \u003Cbr\u003Elaw and accountable governance. The fact that people were able to use the \u003Cbr\u003Esocial media freely, albeit within the ambit of our laws, is an indication that a \u003Cbr\u003Erobust form of democracy is in place in Malaysia. \u003Cbr\u003E","created_at":"2014-04-21T09:36:47.349Z","updated_at":"2014-04-21T17:08:28.058Z","source_url":"http://www.idfr.gov.my/images/stories/speeches/Speech%208th%20HOMC%20YAB%20DPM.pdf","source_date":"2014-02-25","context":"social media = democracy","view_count":2,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Muhyiddin Yassin","tags":["social media","democracy"]},{"id":212,"player_id":57,"quote":"Lee Kuan Yew is LESS chauvinistic than the Chinese in Malaysia","source":"Former information Minister accuses the Malaysian Chinese of being chauvinists.\u003Cbr\u003E\u003Cbr\u003EKUALA LUMPUR - Former Singapore premier Lee Kuan Yew found a strange ally in controversial Umno former Information minister Zainuddin Maidin.\u003Cbr\u003EZainuddin was reported in the Umno-controlled Utusan newspaper as saying Malaysia should be thankful to Kuan Yew for having \"successfully wiped out” the communists and Chinese chauvinists in the island republic as they could have disrupted the peace in Malaysia.\u003Cbr\u003E“Lee was not chauvinistic. He ‘taught’ the Chinese, closed Chinese, Tamil and Malay schools as well as succeeded in upholding socialism to achieve a stable Singapore,” Utusan reported Zainuddin as saying.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EFull article: http://www.malaysia-chronicle.com/index.php?option=com_k2\u0026view=item\u0026id=143042:kuan-yew-less-chauvinistic-than-the-chinese-in-msia-ex-umno-minister\u0026Itemid=2#ixzz2zWF6Seln \u003Cbr\u003EFollow us: @MsiaChronicle on Twitter","created_at":"2014-04-21T11:05:17.672Z","updated_at":"2014-04-21T16:56:29.452Z","source_url":"http://www.malaysia-chronicle.com/index.php?option=com_k2\u0026view=item\u0026id=143042:kuan-yew-less-chauvinistic-than-the-chinese-in-msia-ex-umno-minister\u0026Itemid=2#axzz2zW9XzDly","source_date":"2013-08-11","context":"on context","view_count":4,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Zainuddin Maidin","tags":[]},{"id":196,"player_id":58,"quote":"UMNO has ruled Malaysia for 50 years and they can rule for another 50 years more.","source":"Umno has ruled Malaysia for 50 years, said Ali Rustam, and they can rule for another 50 years more. And Umno does not need PPP, MCA, MIC, Gerakan, Sabah, Sarawak or anyone else to do this. Yes; and even God Himself can’t sink Umno like He could not sink the Titanic.\u003Cbr\u003E","created_at":"2014-04-21T09:59:00.056Z","updated_at":"2014-04-21T16:53:18.232Z","source_url":"http://sarawak-national-party.blogspot.com/2007_10_01_archive.html","source_date":"2007-10-20","context":"","view_count":4,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ali Rustam","tags":["UMNO","religion","CONFIDENCE"]},{"id":155,"player_id":46,"quote":"We want to 'adopt' a polygamous husband as an icon in the state","source":"ROLE MODEL HUSBAND: Kelantan government wants to prove that a man can treat all his wives fairly\u003Cbr\u003EKOTA BARU: CALLING all polygamous husbands. If you think your marriage is exemplary, then you could be just the person the Kelantan government is looking for to serve as its \"public face\" of polygamy.\u003Cbr\u003EThe Kelantan government is looking for a polygamous husband to be a role model in maintaining harmonious relationships by being fair to all his wives.\u003Cbr\u003EState Women, Community Development and Health Committee chairman Mumtaz Md Nawi said the selected candidate would serve as proof that a husband could ensure harmony in a polygamous marriage.\u003Cbr\u003E\"We will not stop people from practising polygamy as it is allowed in Islam, but with the condition that the wives must be treated well.\u003Cbr\u003E\"At the same time, we are considering 'adopting' a polygamous husband as an exemplary candidate or an icon in the state to show other people that polygamous husbands can create a good and harmonious family, too,\" she said here yesterday.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003ERead more: Looking for the ideal polygamist - General - New Straits Times http://www.nst.com.my/nation/general/looking-for-the-ideal-polygamist-1.329251#ixzz2zPGcmLSj","created_at":"2014-04-20T06:47:17.396Z","updated_at":"2014-04-21T16:47:21.692Z","source_url":"http://www.nst.com.my/nation/general/looking-for-the-ideal-polygamist-1.329251","source_date":"2013-07-30","context":"","view_count":5,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Parti Islam Se-Malaysia","tags":["Kelantan","PAS","islam"]},{"id":122,"player_id":4,"quote":"That creativity, I don’t know how much they will charge","source":"\u003Ca href=\"http://imgur.com/YT9WuaM\"\u003E\u003Cimg src=\"http://i.imgur.com/YT9WuaM.png\" title=\"Hosted by imgur.com\" /\u003E\u003C/a\u003E","created_at":"2014-04-18T08:45:26.063Z","updated_at":"2014-04-21T16:29:31.869Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/soi-lek-says-tourism-facebook-pages-costlier-tha","source_date":"2011-06-18","context":"RM1.8mil Facebook spending","view_count":22,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Chua Soi Lek","tags":["Facebook","MCA","Tourism","corruption"]},{"id":172,"player_id":50,"quote":"Horror films and commercials deemed too sexy for young viewers might lead to deviant teachings","source":"THEY may be the princesses of the party, but Puteri Umno delegates who stepped up to the debate rostrum made fiery speeches that could rival their senior speakers.\u003Cbr\u003E\u003Cbr\u003EFeisty Sabah delegate Hamidah Mumamad Jafar called for support for bold moves to curb cases of baby-dumping, such as setting up a school for pregnant mothers and providing more baby hatches.\u003Cbr\u003E\u003Cbr\u003EThe Putatan Puteri Umno division chief said the Government should fully support innovative approaches as the growing number of baby-dumping cases was alarming.\u003Cbr\u003E\u003Cbr\u003E“Setting the school and the baby-hatch provided a lifeline for pregnant unwed mothers and their babies.\u003Cbr\u003E\u003Cbr\u003E“Sex education in schools is also a must to prevent young girls from being involved in premarital sex,” she said, to the applause of the more than 700 delegates.\u003Cbr\u003E\u003Cbr\u003EJohor Baru Puteri Umno chief Azura Mohd Afandi wants the Information Ministry to curb television shows and commercials that could lead people astray from the right religious paths.\u003Cbr\u003E\u003Cbr\u003E“Horror films and commercials deemed too sexy for young viewers might lead to deviant teachings.\u003Cbr\u003E\u003Cbr\u003E“For example, commercials on sanitary pads are openly shown on TV and this could influence the young to get involved in social ills,” said Azura, urging the ministry to increase shows that teach good values and religious practices.\u003Cbr\u003E\u003Cbr\u003EKedah delegate Azifah Abdul Rahman supports the continued use of the Internal Security Act against those who threaten the country’s security.\u003Cbr\u003E\u003Cbr\u003EShe said: “The Act is needed, especially as there are those who dare question the Malay rights.”\u003Cbr\u003E","created_at":"2014-04-21T07:32:48.695Z","updated_at":"2014-04-21T16:26:13.240Z","source_url":"http://www.thestar.com.my/story.aspx/?file=%2f2010%2f10%2f21%2fnation%2f7266377\u0026sec=nation","source_date":"2010-10-21","context":"","view_count":15,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Azura Mohd Afandi","tags":["foot in mouth"]},{"id":117,"player_id":36,"quote":"The BN government always appreciated women's sacrifices towards the nation's progress","source":"GEORGE TOWN - The opposition has no policies whatsoever for the development of women in this country, said Penang MCA Datuk Seri Dr Ng Yen Yen.\u003Cbr\u003ESpeaking after opening the Penang MCA annual general meeting here today, she said the opposition has never acknowledged the role of women, unlike the central government which always appreciated their sacrifices towards the nation's progress.\u003Cbr\u003EThe government has also gone a step further and approved a policy to achieve at least 30 percent of women at the decision making level of the corporate sector, she added.\u003Cbr\u003ENg said Prime Minister Datuk Seri Najib Abdul Razak himself had instructed the Women, Family and Community Development Ministry to conduct relevant training programmes for women.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EFull article: http://www.malaysia-chronicle.com/index.php?option=com_k2\u0026view=item\u0026id=38012:opposition-never-acknowledged-role-of-women-yen-yen-gripes\u0026Itemid=2#ixzz2zE0F28un \u003Cbr\u003EFollow us: @MsiaChronicle on Twitter","created_at":"2014-04-18T08:31:39.504Z","updated_at":"2014-04-21T16:17:55.276Z","source_url":"http://www.malaysia-chronicle.com/index.php?option=com_k2\u0026view=item\u0026id=38012:opposition-never-acknow","source_date":"2012-08-11","context":"women development policies","view_count":11,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["women","BN"]},{"id":214,"player_id":36,"quote":"RM150 per head for dinner is ‘international standard’","source":"If you don't spend at least RM150 for dinner in Kuala Lumpur, you don't have 'standards'.\u003Cbr\u003E\u003Cbr\u003ETourism Minister Datuk Seri Ng Yen Yen today defended her ministry’s heavy spending for dinners during an international conference this year, claiming that it is in line with “international” standards.","created_at":"2014-04-21T11:58:02.251Z","updated_at":"2014-04-21T15:57:38.212Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/ng-yen-yen-rm150-per-head-for-pata-dinner-is-international-standard","source_date":"2012-11-06","context":"","view_count":1,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["dinner","kuala lumpur","foot in mouth"]},{"id":207,"player_id":39,"quote":"Muslims are not encouraged to use \"Rest in Peace\"","source":"The council, said the expression \"rest in peace\" had its origin in a form of Christian prayer during the 18th century and which regularly engraved on tombstones. Muslims, however can send their condolences  to relatives of the recently demised.","created_at":"2014-04-21T10:23:30.544Z","updated_at":"2014-04-21T15:54:47.829Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/muslims-not-encouraged-to-use-rip-says-national-fatwa-council","source_date":"2014-04-17","context":"","view_count":3,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"National Fatwa Council ","tags":["RIP","religion","Muslims"]},{"id":119,"player_id":36,"quote":"Bersih might cause tourism industry to lose up to RM1bil","source":"KUALA LUMPUR: The tourism industry could lose up to RM1bil if the Opposition-initiated Bersih 2.0 rally goes on as planned, Tourism Minister Datuk Seri Dr Ng Yen Yen said.\u003Cbr\u003E\u003Cbr\u003EThe industry, she said, was “sensitive” to changes.\u003Cbr\u003E\u003Cbr\u003ENoting that last year's tourist expenditure was about RM1bil per week, she said: “Last year, the number of tourist arrivals in July alone was 2.2 million and tourist expenditure was RM6bil. If we lose 20% of that, we would lose RM1.2bil.”\u003Cbr\u003E","created_at":"2014-04-18T08:37:27.969Z","updated_at":"2014-04-21T15:53:44.311Z","source_url":"http://www.thestar.com.my/story.aspx/?file=%2f2011%2f6%2f29%2fnation%2f8994213\u0026sec=nation","source_date":"2011-06-29","context":"","view_count":12,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Ng Yen Yen","tags":["Bersih","Tourism"]},{"id":170,"player_id":1,"quote":"PAS sanggup `berkhalwat' dengan DAP ","source":"JELI 2 Mac - Datuk Seri Najib Tun Razak menyifatkan Pas sanggup melakukan apa sahaja termasuk 'berkhalwat' dengan DAP dan membuang tokoh yang berjuang mempertahankan akidah umat Islam semata-mata untuk mendapatkan kuasa.\u003Cbr\u003E\u003Cbr\u003EPerdana Menteri berkata, ia amat berbeza dengan UMNO yang konsisten memperjuang dan mempertahankan Islam di negara ini sejak dahulu sehingga hari ini.\u003Cbr\u003E\u003Cbr\u003EBeliau berkata, Pas tidak mempunyai hala tuju dan dasar perjuangannya semata-mata untuk memancing undi.\u003Cbr\u003E\u003Cbr\u003E\"Aspek Islam dan akidah kita pertahankan, hok (yang) puak Pas hari ini tidak buat, bila ada orang hendak perjuang akidah dia buang daripada parti seperti mana kata, Datuk Dr. Hassan Ali, dia perjuangkan akidah dan akhlak tetapi dia terpelanting daripada Pas.\u003Cbr\u003E\u003Cbr\u003E\"Ke mana hala mana Pas hari ini, kerana hendak kerusi dan menawan Putrajaya yang dulu dia hendak lelong, sekarang pakat dengan DAP nak duduk Putrajaya.\u003Cbr\u003E\u003Cbr\u003E\"Mimpi lain-lain, khalwat dengan DAP pun tidak apa, janji dapat duduk Putrajaya,\" katanya semasa berucap di hadapan lebih 20,000 penduduk pada majlis Perdana Menteri Bersama Rakyat di Universiti Malaysia Kelantan (UMK) di sini, hari ini. - UTUSAN\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EArtikel Penuh: http://www.utusan.com.my/utusan/info.asp?y=2012\u0026dt=0302\u0026pub=Utusan_Malaysia\u0026sec=Terkini\u0026pg=bt_12.htm#ixzz2zVHt3t6C \u003Cbr\u003E© Utusan Melayu (M) Bhd ","created_at":"2014-04-21T07:28:24.518Z","updated_at":"2014-04-21T15:37:25.076Z","source_url":"http://www.utusan.com.my/utusan/info.asp?y=2012\u0026dt=0302\u0026pub=Utusan_Malaysia\u0026sec=Terkini\u0026pg=bt_12.htm","source_date":"2012-03-02","context":"","view_count":9,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Najib Razak","tags":["foot in mouth"]},{"id":217,"player_id":25,"quote":"I view the intrusion as a blessing in disguise. It taught us a lesson","source":"Hishamuddin on the Lahad Datu attacks, a statement which he has since retracted.","created_at":"2014-04-21T12:13:47.815Z","updated_at":"2014-04-21T14:31:05.652Z","source_url":"http://www.malaysia-today.net/invasion-a-tragedy-not-a-blessing-hisham/","source_date":"2013-07-16","context":"Lahad Datu intrusion","view_count":0,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Hishammuddin Hussein","tags":["lahad datu","kampung tanduo","royal sulu army","sabah invasion","sulu claim"]},{"id":220,"player_id":30,"quote":"Siapa nak sambut cabaran Karpal Singh? Sila bagi nama!","source":"A tweet after Karpal Singh's mourned death.\u003Cbr\u003E\u003Cbr\u003Ehttp://atsixty-zakriali.blogspot.com/2014/04/ahli-parlimen-langkawi-datuk-nawawi.html\u003Cbr\u003E\u003Cbr\u003Ehttp://www.themalaysianinsider.com/malaysia/article/langkawi-mp-unrepentant-continues-insults-on-late-karpal-says-facebook-user","created_at":"2014-04-21T14:05:44.310Z","updated_at":"2014-04-21T14:30:14.242Z","source_url":"http://www.themalaysianinsider.com/malaysia/article/langkawi-mp-unrepentant-continues-insults-on-late-karpal-says-facebook-user","source_date":"2014-04-19","context":"","view_count":0,"accepted":true,"submitted_by":"balikcina","submitted_by_email":"info@balikcina.com","player_name":"Nawawi Ahmad","tags":["Insensitive","foot in mouth"]}]